Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/items.strings
Languages: de, it, ja, ru, uk

source: Fangbone Bulwark Armlet-desc
de: Dieses Bollwerk aus Reißzähnen hält jeden auf, der es wagt, den Träger anzugreifen.
it: Queste zanne ti difendono da chiunque osi attaccare il messaggero.
ja: この牙は持ち主に手を出す者すべてを退ける
ru: Эти клыки защитят от любого, кто посмеет напасть на их носителя.
uk: Ці ікла захистять від будь-кого, хто посміє напасти на їхнього носія.

source: Stormrush Armlet
de: Sturmrausch-Armreif
it: Bracciale tempesta impetuosa
ja: 嵐駆の腕輪
ru: Штормовые поручи
uk: Штормові поручі

source: Stormrush Armlet-desc
de: Aus Winden geboren, die niemals vergehen, verleiht dieser Armreif seinem Träger unaufhaltsame Schnelligkeit und unbeugsame Macht.
it: Nato da venti che non si placano mai, questo bracciale dona a chi lo indossa velocità implacabile e forza incrollabile.
ja: 絶えることなき風から生まれたこの腕輪は、持ち主に猛スピードと不屈の力を与える
ru: Рожденные нестихающими ветрами, эти поручи наделяют своего владельца неумолимой скоростью и непреклонной мощью.
uk: Народжені нестримними вітрами, ці поручі наділяють свого власника невблаганною швидкістю і непохитною міццю.

source: Skybreaker Band
de: Himmelbrecher-Ring
it: Fascia spaccacielo
ja: 天翔ける者の腕輪
ru: Поручи разрушителя небес
uk: Доручи підкорювача небес

source: Skybreaker Band-desc
de: Einst getragen von Legenden, die zwischen den Wolken tanzten, verleiht er seinem Träger die Macht, der Schwerkraft selbst zu trotzen.
it: Indossata in passato da leggende che danzavano tra le nuvole, chi la indossa avrà la forza necessaria per sconfiggere la gravità in persona.
ja: かつて雲の間で踊った伝説の者たちが身につけたとされる 腕輪の力で重力をも打ち破れ
ru: Некогда носимые легендами, парящими среди облаков, теперь они дают своему владельцу шанс бросить вызов гравитации.
uk: Колись їх носили легенди, що ширяли серед хмар, тепер вони дають своєму власникові шанс кинути виклик гравітації.

source: Bloodforged Charm Earring
de: Blutgeschmiedeter Talisman
it: Orecchino di sangue
ja: 血鍛のチャーム
ru: Кроверожденная серьга
uk: Кровонароджена сережка

source: Bloodforged Charm Earring-desc
de: In das Blut tausender Duelle getaucht, birgt dieser Talisman die Stärke derjenigen, die sich weigerten zu fallen.
it: Bagnato nel sangue di migliaia di duelli, questo orecchino racchiude la forza di coloro che non si sono mai arresi.
ja: 千の決闘の血を浴びて鍛えられたチャーム 倒れぬ者たちの力が宿る
ru: Омытая кровью тысяч поединков, эта серьга несет в себе силу несломленных.
uk: Омита кров'ю тисяч поєдинків, ця сережка несе в собі силу незламних.

source: Azure Dash Charm Earring
de: Azurrausch-Talisman
it: Orecchino azzurro
ja: 蒼翔のチャーム
ru: Серьга лазурного рывка
uk: Сережка блакитного стрибка

source: Azure Dash Charm Earring-desc
de: Aus einem Splitter des Himmels selbst geschmiedet, beschleunigt dieser Talisman jeden Schritt und schärft jeden Schlag.
it: Forgiato da un frammento di cielo, questo orecchino velocizza ogni passo e affila ogni colpo.
ja: 空の欠片から作られたこのチャームは 一歩一撃に鋭さと加速を与える
ru: Созданная из частицы самого неба, эта серьга ускоряет каждый шаг и оттачивает каждый удар.
uk: Створена з частинки самого неба, ця сережка прискорює кожен крок і відточує кожен удар.

source: Shadowleap Charm Earring
de: Schattensprung-Talisman
it: Orecchino furtivo
ja: 影跳びのチャーム
ru: Серьга крадущегося в тени
uk: Сережка захованого в тіні

source: Shadowleap Charm Earring-desc
de: Dieser Talisman verleiht dir die Schnelligkeit der Schatten und die Anmut des Unsichtbaren.
it: Questo orecchino dona la velocità delle ombre e la grazia dell'invisibilità a chi lo indossa.
ja: 影のごとき俊敏さと見えざる者の優雅さをもたらすチャーム
ru: Эта серьга наделяет носителя стремительностью и грацией тени.
uk: Ця сережка наділяє носія стрімкістю і грацією тіні.

source: Wildtooth Pendant
de: Wildzahn-Anhänger
it: Ciondolo dente feroce
ja: 野牙のペンダント
ru: Кулон дикого зуба
uk: Кулон дикого ікла

source: Wildtooth Pendant-desc
de: Aus dem Zahn einer uralten Bestie geschmiedet, schützt dieser Anhänger seinen Träger mit der urtümlichen Kraft der Wildnis.
it: Forgiato dall'artiglio di un'antica bestia, questo ciondolo protegge chi lo indossa grazie alla forza primitiva dei feroci.
ja: 古の獣の牙で作られたこのペンダントは 野生の力で持ち主を守る
ru: Созданный из клыка древнего зверя, этот кулон защищает своего владельца от первобытной силы дикой природы.
uk: Створений з ікла стародавнього звіра, цей кулон захищає свого власника від первісної сили дикої природи.

source: Mystwind Pendant
de: Mystenwind-Anhänger
it: Ciondolo venticello
ja: 幻風のペンダント
ru: Подвеска ветра тайн
uk: Підвіска вітру таїнств

source: Mystwind Pendant-desc
de: Dieser Anhänger verleiht seinem Träger die Schnelligkeit unsichtbarer Winde und die Anmut einer vorbeiziehenden Brise.
it: Questo ciondolo regala a chi lo indossa la velocità di venti nascosti e la gentilezza di una leggera brezza.
ja: このペンダントは目に見えぬ風のごとき俊敏さと 流れる風のような優雅さを与える
ru: Эта подвеска дарит владельцу стремительность ветра и изящество бриза.
uk: Ця підвіска дарує власнику стрімкість вітру та витонченість бризу.

source: Moonbound Necklace
de: Mondgebundene Kette
it: Collana vincolo lunare
ja: 月縛のネックレス
ru: Лунное ожерелье
uk: Місячне намисто

source: Moonbound Necklace-desc
de: Unter einem Blutmond geschmiedet, bindet diese Kette ihren Träger an uralte Kräfte, die sowohl die Schwerkraft als auch das Schicksal herausfordern.
it: Creata alla luce di una luna di sangue, questa collana collega chi la indossa ai poteri antichi che sfidano la gravità e il fato.
ja: 血の月の下で鍛えられたこのネックレスは 持ち主を重力と運命を超える古代の力と結びつける
ru: Созданное под кровавой луной, это ожерелье связывает своего владельца с древними силами, которые бросают вызов гравитации и судьбе.
uk: Створене під кривавим місяцем, це намисто пов'язує свого власника з древніми силами, які кидають виклик гравітації і долі.

source: Root of Judgement Hammer
de: Wurzel des Urteils
ja: Root of Judgement
uk: Корень Приговора

source: Root of Judgement Hammer-desc
de: Ein Relikt aus dem Herzen des heiligen Baumes. Es trägt das Gewicht vergessener Tugenden.
ja: A relic from the sacred tree's heart. Bearing the weight of forgotten virtues.
uk: Реликвия из сердца священного древа. Несёт тяжесть дремлющих добродетелей.

source: Eye of the Rift Hammer
de: Auge des Risses
ja: Eye of the Rift
uk: Око Бездны

source: Eye of the Rift Hammer-desc
de: Geschmiedet in einer vergessenen Zukunft. Es sieht durch die Zeit und das, was es sieht... blickt zurück.
ja: Forged in a forgotten future. It sees through time, and what it sees... gazes back.
uk: Выковано в забытом будущем. Видит сквозь время — и то, что оно видит... смотрит в ответ.

source: Crowned Dragonhead Staff
de: Gekrönter Drachenkopf
ja: Crowned Dragonhead
uk: Дракон Царственного Пламени

source: Crowned Dragonhead Staff-desc
de: Einst bewachten Drachen den Riss zwischen den Welten. Dieser hier dient nun einem neuen Meister.
ja: Dragons once guarded the rift between worlds. This one bows to a new master.
uk: Драконы некогда стерегли разлом между мирами. Этот склонился перед новым властелином.

source: Knight of Discord Armor
de: Ritter von Discord
ja: Knight of Discord
uk: Knight of Discord
