Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/items.strings
Languages: de, it, ja, ru, uk

source: Conqueror Edge
de: Erobererschneide
it: Ciglio del conquistatore
ja: 征服者の斧
ru: Бердыш завоевателя
uk: Бердиш завойовника

source: Edge of Death
de: Schneide des Todes
it: Ciglio della morte
ja: デスエッジ
ru: Секира смерти
uk: Сокира смерті

source: Primitive Scalpel
de: Primitives Skalpell
it: Bisturi primitivo
ja: 原始の小刀
ru: Первобытный скальпель
uk: Первісний скальпель

source: Skewer of the King
de: Spieß des Königs
it: Spiedo del Re
ja: キングダガー
ru: Королевский штык
uk: Королівський багнет

source: Curved Bronze Skewer
de: Gebogener Bronzespieß
it: Spiedo curvo di bronzo
ja: 曲がった銅短剣
ru: Винтовой бронзовый шампур
uk: Гвинтовий бронзовий шампур

source: Gutwrencher
de: Darmaufreißer
it: Straziatore di viscere
ja: ガットレンチャー
ru: Брюхопор
uk: Брюхопор

source: Dragonclaw
de: Drachenklaue
it: Artiglio di drago
ja: ドラゴンクロウ
ru: Коготь дракона
uk: Кіготь дракона

source: Diamond Piercer
de: Diamantendurchbohrer
it: Perforatore di diamanti
ja: 金剛一閃
ru: Алмазный пронзатель
uk: Алмазний пронизувач

source: Ferocious Skewer
de: Wilder Spieß
it: Spiedo feroce
ja: 絶望の短剣
ru: Беспощадный штык
uk: Нещадний багнет

source: Razor of Diligence
de: Rasierklinge des Fleißes
it: Rasoio della diligenza
ja: 精励の短剣
ru: Лезвие усердия
uk: Лезо старанності

source: Twilight Ebon Mace
de: Schwarze Dämmerungskeule
it: Mazza ferrata di ebano crepuscolare
ja: 黄昏の黒槌
ru: Сумеречная эбонитовая булава
uk: Сутінкова ебонітова булава

source: Dawnbreaker
de: Dämmerungsbrecher
it: Distruttore d'alba
ja: ドーンブレイカー
ru: Разрушитель зари
uk: Руйнівник зорі

source: Enlightened Hammer
de: Erleuchteter Hammer
it: Martello illuminato
ja: 知恵与える槌
ru: Просветлённый молот
uk: Просвітлений молот

source: Soulless Scepter
de: Seelenloses Zepter
it: Scettro senz'anima
ja: 無心笏
ru: Бездушный скипетр
uk: Бездушний скіпетр

source: Smasher of Mercy
de: Zertrümmerer der Barmherzigkeit
it: Distruttore di misericordia
ja: 優しき心の槌
ru: Сокрушитель милосердия
uk: Крушитель милосердя

source: Soul-Forged Hammer
de: Seelengeschmiedeter Hammer
it: Martello forgiato con l'anima
ja: ソウルハンマー
ru: Молот несломимого духа
uk: Молот незламного духу

source: Dancing Smasher
de: Tanzender Zertrümmerer
it: Distruttore danzante
ja: 破砕する踊り子
ru: Танцующий дробитель
uk: Танцюючий дробитель

source: Ivory Crusher
de: Elfenbeinbrecher
it: Frantumatore d'avorio
ja: 象牙の破槌
ru: Крушитель из бивня мамонта
uk: Крушитель з бивня мамонта

source: Smasher of the Damned
de: Zertrümmerer der Verdammten
it: Frantumatore maledetto
ja: 堕落の砕槌
ru: Чекан проклятых
uk: Чекан проклятих

source: Lightning Halberd
de: Blitzenhellebarde
it: Alabarda di luce
ja: いかずちの鉾槍
ru: Алебарда молний
uk: Алебарда блискавок

source: Wicked Skewer
de: Böser Spieß
it: Spiedo perfido
ja: 悪の一突き
ru: Свирепый штык
uk: Лютий багнет

source: Arcane Piercer
de: Arkaner Durchbohrer
it: Perforatore arcano
ja: 深遠の槍
ru: Арканный пронзатель
uk: Арканний пронизувач

source: Loyal Pike
de: Treuere Pike
it: Picco leale
ja: ロイヤルパイク
ru: Верная пика
uk: Вирний спис

source: Moonlit Trident
de: Mondbeleuchteter Dreizack
it: Tridente lunare
ja: 月光の三叉槍
ru: Лунный трезубец
uk: Місячний тризуб

source: Challenger's Impaler
de: Pfähler des Herausforderers
it: Impalatore dello sfidante
ja: 挑む者の突槍
ru: Прокалыватель конкурентов
uk: Проколювач конкурентів

source: Cataclysmic Spear
de: Kataklysmischer Speer
it: Asta cataclismatica
ja: 破滅の槍
ru: Копьё катаклизма
uk: Спис катаклізму

source: Vindictive Piercer
de: Rachsüchtiger Durchbohrer
it: Perforatore vendicativo
ja: 報復の突槍
ru: Мстительный пронзатель
uk: Мстивий пронизувач

source: Unholy Might
de: Unheilige Macht
it: Potere iniquo
ja: 不浄なる力
ru: Нечестивая сила
uk: Нечестива сила

source: Malicious Quickblade
de: Bösartige Schnellklinge
it: Lama veloce maliziosa
ja: 穢心の流剣
ru: Ловкое вредоносное жало
uk: Спритне лихе жало

source: Frost Rapier
it: Stocco di gelo
ja: フロストレイピア
ru: Морозная рапира
uk: Морозна рапіра

source: Darkheart
de: Schattenherz
it: Cuore oscuro
ja: ダークハート
ru: Сердце тьмы
uk: Серце пітьми

source: Shadow Strike
de: Schattenschlag
it: Colpo d'ombra
ja: 闇討
ru: Теневой выпад
uk: Тіньовий випад

source: Exiled Blade
de: Verbannte Klinge
it: Lama esiliata
ja: 禁じられた剣
ru: Клинок изгнанного
uk: Клинок вигнаного

source: Soulblade
de: Seelenklinge
it: Lama dell'anima
ja: ソウルブレード
ru: Клинок души
uk: Лезо душі

source: Doomblade
de: Verdammnisklinge
it: Lama della sventura
ja: 運命刀
ru: Меч судного дня
uk: Меч судного дня

source: Adamantite Greatsword
de: Adamantit-Großschwert
it: Grande spada d'adamantino
ja: アダマンタイトの大剣
ru: Адамантиевый клеймор
uk: Адамантієвий клеймор

source: Storm Breaker
de: Sturmbrecher
it: Creatore di tempeste
ja: 嵐払い
ru: Разрубатель бурь
uk: Розрубувач бур

source: Cthulhu Set
it: Set Cthulhu
ja: クトゥルフセット
ru: Комплект Ктулху
uk: Комплект Ктулху

source: Sword of 103 Lamentations
de: Schwert der 103 Klagelieder
it: Spada dei 103 lamenti
ja: 百三度嘆いた剣
ru: Меч 103 оплакиваний
uk: Меч 103 оплакувань

source: Fortunes Battleaxe
de: Glücks Streitaxt
it: Ascia d'armi della fortuna
ja: 幸運の戦斧
ru: Секира обогащения
uk: Сокира збагачення

source: Goldsteel Sword
de: Goldstahl
it: Acciaio dorato
ja: ゴールドスティール
ru: Златосталь
uk: Златосталь

source: Golden Needle Sword
de: Goldene Nadel
it: Ago dorato
ja: 金の尖剣
ru: Золотая игла
uk: Золота голка

source: Wealthy Smasher Hammer
de: Wohlhabender Zertrümmerer
it: Frantumatore ricco
ja: ウェルスハンマー
ru: Богатый сокрушитель
uk: Багатий нищівник

source: Wealthy Crusher Mace
de: Wohlhabender Brecher
it: Mazza frantumante ricca
ja: ウェルスメイス
ru: Богатый дробитель
uk: Багатий подрібнювач

source: Golden Piercer Spear
de: Goldener Durchbohrer
it: Perforatore dorato
ja: 金の尖槍
ru: Золотой пронзатель
uk: Золотий пронизник

source: Precious Skewer Dagger
de: Wertvoller Spieß
it: Spiedo prezioso
ja: プレシャスダガー
ru: Драгоценный штык
uk: Дорогоцінний багнет

source: Precious Dual-blade Dagger
de: Wertvolle Doppelklinge
it: Doppia lama preziosa
ja: 尊厳の双剣
ru: Драгоценная пата
uk: Дорогоцінна пата

source: Royal War Staff
de: Königlicher Kriegsstab
it: Bastone da guerra reale
ja: 王戦の杖
ru: Королевский боевой посох
uk: Королівська бойова палиця

source: treasure-item-desc
de: Dieser Gegenstand ist viel Gold wert.
it: Questo oggetto vale tanto oro.
ja: 大量のゴールドと同じ価値のアイテム
ru: Этот предмет стоит целое состояние.
uk: Цей предмет стоїть цілу купу грошей.

source: Icebane Magic Staff
de: Eisbann
it: Assillo di ghiaccio
ja: アイスベイン
ru: Ледяная погибель
uk: Крижана смерть

source: Magic Cog
de: Magisches Zahnrad
it: Ruota dentata magica
ja: 魔車
ru: Волшебная шестерёнка
uk: Чарівна шестерня

source: magic-cog-desc
de: Beschwört einen uralten zahnradähnlichen Gefährten.
it: Evoca un antico compagno a forma di ruota dentata.
ja: 古代に存在した歯車のような味方を召喚する
ru: Вызывает компаньона в форме шестерни.
uk: Викликає компаньйона у формі шестірні.

source: Ice Dagger
de: Eisdolch
it: Pugnale di ghiaccio
ja: アイスダガー
ru: Ледяной кинжал
uk: Крижаний кинджал

source: Ice Axe
de: Eisaxt
it: Ascia di ghiaccio
ja: アイスアックス
ru: Ледяной топор
uk: Крижана сокира

source: Frost Dagger
de: Frostdolch
it: Pugnale di gelo
ja: フロストダガー
ru: Заиндевевший кинжал
uk: Заіндевілий кинджал

source: Frost Axe
de: Frostaxt
it: Ascia di gelo
ja: フロストアックス
ru: Заиндевевший топор
uk: Заіндевіла сокира

source: Volcano Sword
de: Vulkanschwert
it: Spada del vulcano
ja: 火山剣
ru: Вулканический меч
uk: Вулканічний меч

source: Unleashed Kraken Sword
de: Entfesselter Kraken
it: Kraken scatenato
ja: 暴れるクラー剣
ru: Освобождённый Кракен
uk: Звільнений Кракен

source: Frost-heart Sword
de: Frostherz
it: Cuore gelato
ja: 凍心の剣
ru: Ледяное сердце
uk: Крижане серце

source: Frost-heart Axe
de: Frostherzaxt
it: Ascia dal cuore gelato
ja: 凍心の斧
ru: Топор ледяного сердца
uk: Сокира крижаного серця

source: Blade of Decay Sword
de: Klinge des Überlebens
it: Lama della sopravvivenza
ja: 遺剣
ru: Клинок распада
uk: Клинок розпаду

source: Blade of Rusted Souls Sword
de: Klinge der verrosteten Seelen
it: Lama delle anime arrugginite
ja: 朽ちた心の剣
ru: Клинок разлагающихся душ
uk: Клинок розпаду душ

source: Arachnid Sword
de: Arachniden-Schwert
it: Spada dell'aracnide
ja: 蛛形刀
ru: Паучий меч
uk: Павучий меч

source: Frost Slasher Sword
de: Frostschlitzer
it: Aggressore gelato
ja: フロストスラッシャー
ru: Морозный секач
uk: Морозний сікач

source: Abyssal Blade Sword
de: Abgründiges Schwert
it: Lama abissale
ja: 深き海の剣
ru: Клинок бездны
uk: Клинок безодні

source: Abyssal Dual-Blade Dagger
de: Abgründige Doppelklinge
it: Doppia lama abissale
ja: 深き海の双剣
ru: Сдвоенный клинок бездны
uk: Здвоєний клинок безодні

source: Dragontooth Spear
de: Drachenzahnspeer
it: Asta del dente di drago
ja: 竜牙の槍
ru: Копьё драконьего клыка
uk: Спис драконячого ікла

source: Last Survivors Spear
de: Speer des letzten Überlebenden
it: Asta dell'ultimo sopravvissuto
ja: 生き残った者の槍
ru: Копьё последнего выжившего
uk: Спис останнього живого

source: Last Survivors Dagger
de: Dolch des letzten Überlebenden
it: Pugnale dell'ultimo sopravvissuto
ja: 生き残った者の短剣
ru: Кинжал последнего выжившего
uk: Кинджал останнього живого

source: Wind-pearl Axe
de: Windperlenaxt
it: Ascia perla del vento
ja: 風真珠の斧
ru: Топор ветренной жемчужины
uk: Сокира вітряної перлини

source: Axe of Rusted Gods
de: Axt der verrosteten Götter
it: Ascia degli dei arrugginiti
ja: 堕神の斧
ru: Топор забытых богов
uk: Сокира забутих богів

source: Smasher of Decay Hammer
de: Zertrümmerer des Verfalls
it: Frantumatore decomposto
ja: ディケイスマッシャー
ru: Молот распада
uk: Молот розпаду

source: Ice Shard Dagger
de: Eisscholle
it: Frammento di ghiaccio
ja: アイスシャード
ru: Осколок льда
uk: Уламок льоду

source: Double Decay Dagger
de: Doppelverfall
it: Decomposizione doppia
ja: 生存者の短剣
ru: Двойной распад
uk: Подвійний розпад

source: Wild Dagger
de: Wilder Dolch
it: Pugnale selvaggio
ja: 荒涼の短剣
ru: Необузданный кинжал
uk: Неприборканий кинджал

source: All Seeing Sword
de: Allsehendes Schwert
it: Spada che tutto vede
ja: 達眼の剣
ru: Всевидящий меч
uk: Всебачащий меч

source: Sword of Uncountable Lies
de: Schwert der unzähligen Lügen
it: Spada delle innumerevoli bugie
ja: 尽きぬ嘘の剣
ru: Меч бесчисленной лжи
uk: Меч незліченного обману

source: Key of Time
de: Schlüssel der Zeit
it: Chiave del tempo
ja: 時の鍵
ru: Ключ времени
uk: Ключ часу

source: key-of-time-desc
de: Öffnet die Truhe, die den Anzug der Zeitpatrouille beinhaltet.
it: Apri il forziere che contiene l'abito del tutore del tempo.
ja: タイムパトローラースーツが入ったチェストを開けるための鍵
ru: Открывает сундук с костюмом патруля времени.
uk: Відкриває скриню з костюмом патруля часу.

source: Winter Witch Armor
de: Winterhexenrüstung
it: Armatura della strega d'inverno
ja: ウィンターウィッチの鎧
ru: Броня полярной кикиморы
uk: Броня полярної кікімори

source: YT Streamers Suit
de: Tubeman-Anzug
it: Vestito da Tubeman
ja: チューバースーツ
ru: Облачение ютубера
uk: Вбрання ютубера

source: TW Streamers Suit
de: T'Witch-Anzug
it: Vestito da T'Witch
ja: ツ・ウィッチスーツ
ru: Костюм твичела
uk: Костюм твічела

source: Suit of Discord
de: Discord-Anzug
it: Vestito di Discord
ja: ディスコードスーツ
ru: Одеяние дискордиста
uk: Одяг дискордиста

source: Suit of the Faceless
de: Anzug der Gesichtslosen
it: Vestito di Faceless
ja: フェイスレススーツ
ru: Костюм лицокнижника
uk: Костюм фейсбуківника

source: Axe of Assis
de: Axt von Assis
it: Ascia d'Assisi
ja: アシスの斧
ru: Секира Ассиса
uk: Сокира Асиса

source: Barrenlands Bandit Male
de: Ödland-Bandit
it: Bandito delle terre aride
ja: 荒れ地の男盗賊
ru: Бандит пустошей
uk: Бандит пустки

source: Barrenlands Bandit Female
de: Ödland-Banditin
it: Bandita delle terre aride
ja: 荒地の女盗賊
ru: Бандитка пустошей
uk: Бандитка пустки

source: Spider Staff
de: Spinnenstab
it: Bastone del ragno
ja: 蜘蛛の杖
ru: Паучий посох
uk: Павуча палиця

source: Bunny Dagger
de: Häschen-Dolch
it: Pugnale del coniglietto
ja: バニーダガー
ru: Кинжал братца-кролика
uk: Кинжал братика-кролика

source: Bunny Claymore
de: Häschen-Breitschwert
it: Claymore del coniglietto
ja: バニークレイモア
ru: Палаш братца-кролика
uk: Палаш братика-кролика

source: Creepy Easter Bunny
de: Osternkriecher
it: Coniglietto spaventoso
ja: イースターバニー
ru: Пасхадость
uk: Паскауда

source: Easter Bunny Terminator Armor
de: Osterminator
it: Pasquerminator
ja: イースターミネーター
ru: Пасхарминатор
uk: Паскармінатор

source: The Ancient Codices
de: Die Antiken Kodexe
it: Gli antichi manoscritti
ja: 太古の本
ru: Древние кодексы
uk: Стародавні кодекси

source: The Arachnid Codex
de: Arachniden-Kodex
it: Il codice dell'aracnide
ja: 蛛形の本
ru: Кодекс арахнидов
uk: Кодекс арахнідів

source: The Daemon Codices
de: Die Dämonen-Kodexe
it: I manoscritti demoniaci
ja: 悪鬼の本
ru: Кодекс демонов
uk: Кодекс демонів

source: The Word of the Wind
de: Das Wort des Windes
it: La parola del vento
ja: ワードオブウィンド
ru: Мир ветров
uk: Світ вітрів

source: Necromorphicon
de: Nekromorphikon
it: Necronomicono
ja: ネクロモーフィコン
ru: Некроморфикон
uk: Некроморфікон

source: Compendium of Trees
de: Kompendium der Bäume
it: Compendio d'alberi
ja: 樹木大要
ru: Каталог деревьев
uk: Каталог дерев

source: The Testament of Ifrit
de: Das Testament von Ifrit
it: Il testamento di Ifrit
ja: イフリート聖書
ru: Завет ифрита
uk: Завіт іфриту

source: The Oxymos Codex
de: Der Kodex von Oxymo
it: Il codice di Oxymo
ja: オキシモの聖典
ru: Кодекс Оксимо
uk: Кодекс Оксімо

source: The Abyssal Scrolls
de: Die Schriftrollen des Abgrunds
it: Le pergamene abissali
ja: 深海の巻き物
ru: Свитки бездны
uk: Свитки безодні

source: Steel Shuriken
de: Stahl-Shuriken
it: Shuriken d'acciaio
ja: 鋼の手裏剣
ru: Стальной сюрикен
uk: Сталевий сюрікен

source: Black Shuriken
de: Schwarze Shuriken
it: Shuriken nero
ja: 黒手裏剣
ru: Чёрный сюрикен
uk: Чорний сюрікен

source: Steelblow Shuriken
de: Stahlstoß-Shuriken
it: Shuriken colpo d'acciaio
ja: 硬鋼の手裏剣
ru: Бронебойный сюрикен
uk: Бронебійний сюрікен

source: Shuriken of Loss
de: Shuriken des Verlustes
it: Shuriken della perdita
ja: 喪失の手裏剣
ru: Сюрикен лишений
uk: Сюрікен поневірянь

source: Gayan Shuriken
it: Shuriken di Gayan
ja: ガヤンの手裏剣
ru: Гаянский сюрикен
uk: Гаянський сюрікен

source: Ifrits Shuriken
it: Shuriken di Ifrit
ja: イフリートの手裏剣
ru: Сюрикен ифрита
uk: Сюрікен іфриту

source: Shooting Star Shuriken
de: Sternschnuppe Shuriken
it: Shuriken della stella cadente
ja: 流星の手裏剣
ru: Сюрикен падающей звезды
uk: Сюрікен падаючої зірки

source: Undines Shuriken
it: Shuriken di Undine
ja: アンダインの手裏剣
ru: Сюрикен русалки
uk: Сюрікен русалки

source: Trickytreat
it: Dolcetto scherzetto
ja: トリッキートリート
ru: Коварное угощение
uk: Підступне частування

source: Santa Claus
de: Weihnachtsmann
it: Babbo Natale
ja: サンタクロース
ru: Дед Мороз
uk: Санта Клаус

source: Bunnyhop Dagger
de: Hasenhop-Dolch
it: Pugnale del coniglio salterino
ja: バニーホップダガー
ru: Кинжал-кролепрыг
uk: Кинджал-кролестриб

source: Eggspike Mace
de: Eierstachelkeule
it: Mazza ferrata di Pasqua
ja: エッグスパイク
ru: Булава-яйцешип
uk: Булава-яйцешип

source: Enchanted Hare Staff
de: Verzauberter Hasenstab
it: Bastone del leprotto incantato
ja: 魔法ウサギの杖
ru: Посох зачарованного зайца
uk: Посох зачарованого зайця

source: Eggscellent Axe
de: Eggscellent-Axt
it: Ascia golosa
ja: エッグセレントアックス
ru: Заяйчательный топор
uk: Заяйчаста сокира

source: Jellybunny
de: Gummihase
it: Coniglietto tremolante
ja: ジェリーバニー
ru: Железайчик
uk: Железайчик

source: Dancers Raiment TikTok
de: Tänzergewand
it: Tenuta da ballo
ja: オッドロッカー
ru: Наряд танцора
uk: Наряд танцора

source: Pepper Brew
de: Pfeffergebräu
it: Bevanda pepata
ja: ペッパーブルー
ru: Перцовая настойка
uk: Перцева настоянка

source: Tonic of Invulnerability
de: Tonic der Unverwundbarkeit
it: Tonico dell'invulnerabilità
ja: 防毒薬
ru: Тоник неуязвимости
uk: Тонік невразливості

source: Draft of Freshness
de: Trunk des Frischseins
it: Sorso di freschezza
ja: ヒケシドライ
ru: Освежающий эликсир
uk: Освіжаючий еліксир

source: Sparkling Tonic
de: Prickelndes Tonic
it: Tonico effervescente
ja: スパイクリング
ru: Игристый тоник
uk: Ігристий тонік

source: Elixir of Duplication
de: Elixier der Duplikation
it: Elisir della duplicazione
ja: ブンレツエリクサー
ru: Эликсир дублирования
uk: Еліксир дублювання

source: Arcane Precision Tonic
de: Arkanes Präzisionstonic
it: Tonico della precisione arcana
ja: ニガサナイ薬
ru: Тоник магической точности
uk: Тонік магічної точності

source: Levitation Liqueur
de: Levitationslikör
it: Liquore levitativo
ja: 浮遊酒
ru: Ликёр левитации
uk: Лікер левітації

source: Moonjump Mixture
de: Mondsprung-Mischung
it: Miscuglio della magnificenza
ja: 月跳び調合薬
ru: Микстура лунного прыжка
uk: Мікстура місячного стрибка

source: Forbidden Flowers Extract
de: Extrakt der verbotenen Blume
it: Estratto del fiore proibito
ja: アノハナエッセンス
ru: Экстракт запретного цветка
uk: Екстракт забороненої квітки

source: Pepper Brew-desc
de: Gewährt Schutz vor Frosteffekten und erhöht die Rüstung.
it: Fornisce protezione dagli effetti glaciali e aumenta la corazza.
ja: 凍結効果から保護し、防御力を増加させる
ru: Защищает от эффектов заморозки и увеличивает броню.
uk: Захищає від ефектів заморозки та збільшує броню.

source: Tonic of Invulnerability-desc
de: Bietet Immunität gegen Giftwirkungen und erhöht die Rüstung.
it: Fornisce immunità agli effetti del veleno e aumenta la protezione della corazza.
ja: 毒に対しての免疫を得ることができ、防御力を高められる
ru: Дает иммунитет от эффектов яда и увеличивает броню.
uk: Дає імунітет від ефектів отрути та збільшує броню.

source: Draft of Freshness-desc
de: Schützt vor Feuer- und Brandschäden.
it: Ti protegge dal fuoco e dai danni da ustione.
ja: 火、燃焼ダメージを防ぐことができる
ru: Защищает от повреждений огнем и горением.
uk: Захищає від пошкоджень вогнем і горінням.

source: Sparkling Tonic-desc
de: Schützt vor Dornschäden.
it: Protegge dagli spuntoni.
ja: トゲから身を守ることができる
ru: Защита от шипов.
uk: Захист від шипів.

source: Elixir of Duplication-desc
de: Vervielfacht die Anzahl der abgefeuerten Projektile und verringert gleichzeitig leicht die Rüstung.
it: Moltiplica il numero dei proiettili lanciati mentre abbassa leggermente l'armatura.
ja: 発射弾の数を増やし、防御力を僅かに低下させる
ru: Умножает количество выпущенных снарядов, немного снижая броню.
uk: Примножує кількість випущених снарядів, трохи знижуючи броню.

source: Arcane Precision Tonic-desc
de: Abgefeuerte Projektile verfolgen Ziele automatisch, allerdings wird dabei die Rüstung leicht verringert.
it: I proiettili lanciati raggiungeranno direttamente i bersagli, a discapito dell'armatura che verrà leggermente ridotta.
ja: 発射弾はターゲットに向かって飛んでいくが、僅かに防御力が低下する
ru: Выпущенные снаряды будут наводиться на цели, но с небольшим снижением брони.
uk: Запущені снаряди будуть наводитися на цілі, але з незначним зниженням броні.

source: Levitation Liqueur-desc
de: Verhindert das Hinabstürzen in bodenlose Abgründe und gewährt zusätzliche Luftsprünge. Außerdem verursachen aus der Luft abgefeuerte Projektile erhöhten Schaden.
it: Impedisce di cadere in pozzi senza fondo e garantisce salti extra in aria. Inoltre, i proiettili lanciati mentre si è in aria, infliggono danni maggiori.
ja: 奈落への落下を防ぎ、空中ジャンプが追加され、空中で放たれた飛び道具のダメージが増加する
ru: Предотвращает падение в бездонные ямы и дает дополнительные прыжки в воздухе. Кроме того, выпущенные в воздухе снаряды наносят повышенный урон.
uk: Запобігає падінню в бездонні ями і дає додаткові стрибки в повітрі. Крім того, випущені в повітрі снаряди завдають підвищеної шкоди.

source: Levitation Liqueur-desc-alt-a
de: Verhindert das Hinabstürzen in bodenlose Abgründe und gewährt einen zusätzlichen Luftsprung. Außerdem verursachen aus der Luft abgefeuerte Projektile erhöhten Schaden.
it: Impedisce di cadere in pozzi senza fondo e garantisce un salto extra in aria. Inoltre, i proiettili lanciati mentre si è in aria, infliggono danni maggiori.
ja: 奈落への落下を防ぎ、空中ジャンプが1回追加され、空中で放たれた飛び道具のダメージが増加する
ru: Предотвращает падение в бездонные ямы и дает один дополнительный прыжок в воздухе. Кроме того, выпущенные в воздухе снаряды наносят повышенный урон.
uk: Запобігає падінню в бездонні ями і дає один додатковий стрибок у повітрі. Крім того, випущені в повітрі снаряди завдають підвищеної шкоди.

source: Levitation Liqueur-desc-alt-b
de: Verhindert das Hinabstürzen in bodenlose Abgründe. Außerdem verursachen aus der Luft abgefeuerte Projektile erhöhten Schaden.
it: Inoltre, i proiettili lanciati mentre si è in aria, infliggono danni maggiori.
ja: 奈落への落下を防ぎ、空中で放たれた飛び道具のダメージが増加する
ru: Предотвращает падение в бездонные ямы. Кроме того, выпущенные в воздухе снаряды наносят повышенный урон.
uk: Запобігає падінню в бездонні ями. Крім того, випущені в повітрі снаряди завдають підвищеної шкоди.

source: Moonjump Mixture-desc
de: Reduziert die Schwerkraft und ermöglicht höhere Sprünge sowie langsamere Abstiege. In der Luft werden deine Angriffe deutlich schneller.
it: Riduce gli effetti della gravità.
ja: 重力の影響を軽減し、高くジャンプしてゆっくり降下できるようになる 空中にいる間は攻撃速度が大幅に上昇する
ru: Уменьшает эффект гравитации.
uk: Зменшує силу тяжіння, дозволяючи вище стрибати та повільніше падати. У повітрі ваші атаки стають значно швидшими.

source: Forbidden Flowers Extract-desc
de: Bietet die Fähigkeit an, hüpfende Feuerbälle abzuschießen.
it: Ti permette di sparare sfere di fuoco rimbalzanti.
ja: バウンドする火球を放てるようになる
ru: Даёт возможность стрелять отскакивающими огненными шарами.
uk: Дає можливість стріляти вогняними кулями, що відскакують.

source: Umbranian Water
de: Umbrisches Wasser
it: Acqua delle ombre
ja: アンブラウォーター
ru: Умбранская вода
uk: Умбранська вода

source: Umbranian Water-desc
de: Löscht den aktiven Power-Up-Effekt.
it: Annulla l'effetto del potenziamento attivo.
ja: 発動中の能力強化を無効にする
ru: Снимает активный эффект усиления.
uk: Знімає активний ефект посилення.

source: Phoenix
de: Phönix
it: Fenice
ja: フェニックス
ru: Феникс
uk: Фенікс

source: Poisoned Dart
de: Vergifteter Pfeil
it: Dardo avvelenato
ja: 毒塗の矢
ru: Отравленный дротик
uk: Отруєний дротик

source: Golden Guardian
de: Goldener Wächter
it: Guardiano dorato
ja: マモリコガネ
ru: Золотой страж
uk: Золотий вартовий

source: Innkeepers Costume
de: Gastwirtskostüm
it: Costume del locandiere
ja: 宿主の装束
ru: Костюм трактирщика
uk: Костюм корчмаря

source: Greenfang Ensemble
de: Grünzahn-Ensemble
it: Completo zanne verdi
ja: 緑蜘蛛協奏曲
ru: Набор зелёного когтя
uk: Набір зеленого пазура

source: Monsters Juice
de: Monstersaft
it: Succo mostruoso
ja: モンスタージュース
ru: Сок монстра
uk: Сік монстра

source: Monsters Juice-desc
de: Verstärkt die Angriffskraft auf Kosten einer verringerten Rüstung.
it: Amplifica l'abilità d'attacco a discapito delle dimensioni dell'armatura.
ja: 防御力が弱体化するかわりに攻撃力を高める
ru: Увеличивает силу атаки за счет уменьшения брони.
uk: Збільшує силу атаки за рахунок зменшення броні.

source: Enchanted Nutcracker
it: Schiaccianoci Incantato
ja: 魔法のくるみ割り
ru: Заколдованный Щелкунчик
uk: Зачарований Лускунчик

source: Pirouette pointe
it: Punta di Pirouette
ja: ピルエット・オンポワント
ru: Пуанты для Пируэта
uk: Пуанти Пірует

source: Instant Charge Blast
de: Instante Ladungsexplosion
it: Attacco esplosivo istantaneo
ja: インスタント・チャージ・ブラスト
ru: Мгновенный взрывной заряд
uk: Миттєвий вибуховий заряд

source: Instant Charge Blast-desc
de: Lädt einen Angriff auf, der bei der Auslösung massiven Schaden verursacht. Zum Aktivieren einen Angriff abfeuern.
it: Sferra un attacco che infligge ingenti danni all'istante. Per attivarlo, sferra un attacco.
ja: 攻撃をチャージし、解放時に強力なダメージを与える 発動には攻撃を行う
ru: Заряжает следующую атаку силой, наносящей огромный урон.
uk: Заряджає наступну атаку силою, що завдає величезної шкоди.

source: Instant Thunder Wave
de: Instante Donnerwelle
it: Onda di tuono istantanea
ja: インスタント・サンダー・ウェーブ
ru: Мгновенный штормовой фронт
uk: Миттєвий штормовий фронт

source: Instant Thunder Wave-desc
de: Beschwört eine Blitzwelle, die alle umliegenden Feinde trifft. Zum Aktivieren einen Angriff abfeuern.
it: Richiama un'onda di bulloni tuonanti che colpiscono tutti i nemici nei paraggi. Per attivarla, sferra un attacco.
ja: 周囲の敵すべてに落雷を放つ 発動には攻撃を行う
ru: Вызывает волну молний, поражающих всех врагов вокруг при следующей атаке.
uk: Викликає хвилю блискавок, що вражають усіх ворогів навколо під час наступної атаки.

source: Starlight Shield
de: Sternenlichtschild
it: Scudo stellare
ja: スターライト シールド
ru: Звездный щит
uk: Зоряний щит
