Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/items.strings
Languages: de, it, ja, ru, uk

source: Starlight Shield-desc
de: Für einen kurzen Zeitraum bietet sofortige Unverwundbarkeit und schützt vor feindlichen Treffern.
it: Offre invulnerabilità immediata per un breve periodo, proteggendoti dai colpi nemici.
ja: 短時間、即座に無敵状態になり、敵の攻撃から身を守る
ru: Дает мгновенную неуязвимость от вражеских ударов на непродолжительное время.
uk: Дає миттєву невразливість від ворожих ударів на нетривалий час.

source: Scarlet Shadowweaver Garb
de: Scharlachroter Schattenweber
it: Tessitore d'ombre scarlatte
ja: スカーレット・シャドウウィーバー
ru: Алый сумеречник
uk: Багряний присмеречник

source: All Seeing Cleaver
de: Allsehende Machete
it: Machete onniveggente
ja: 全知のクリーバー
ru: Всевидящее мачете
uk: Всевидяче мачете

source: Instant Radiant Shield
de: Sofortiger Strahlungsschild
it: Scudo radiante istantaneo
ja: インスタント・ラディアント・シールド
ru: Сияющий щит готовности
uk: Сяючий щит готовності

source: Instant Radiant Shield-desc
de: Bietet ausgezeichneten Schadensschutz und schützt für eine kurze Zeit vor externen Bedrohungen.
it: Fornisce una potente protezione contro i danni, tutelando contro le minacce esterne per un breve periodo.
ja: 優れたダメージ防御を提供し、外部の脅威から短時間守る
ru: Обеспечивает превосходную защиту от урона, защищая от внешних угроз на короткое время.
uk: Забезпечує чудовий захист від пошкоджень, захищаючи від зовнішніх загроз на короткий час.

source: Starlight Supertonic
de: Sternenlicht-Supertonikum
it: Luce stellare supertonica
ja: スターライト・スーパートニック
ru: Супертоник звездного света
uk: Супертонік зоряного світла

source: Starlight Supertonic-desc
de: Gewährt vorübergehende Unverwundbarkeit und erhöht die Waffenschaden für kurze Zeit.
it: Fornisce una invulnerabilitè temporanea e potenzia la produzione di danni da arma per un breve periodo.
ja: 短時間の無敵状態を付与し、武器のダメージ出力を強化する
ru: Дает временную неуязвимость и повышает урон от оружия на короткое время.
uk: Дає тимчасову невразливість і підвищує шкоду від зброї на короткий час.

source: armor-bypass-desc
de: Angriffe mit dieser Waffe umgehen teilweise die Rüstung des Ziels.
it: I colpi di quest'arma aggirano parzialmente la corazza del bersaglio.
ja: この武器の攻撃は、対象の防御を一部無視する
ru: Удары этим оружием частично проходят сквозь броню цели.
uk: Удари цією зброєю частково проходять крізь броню цілі.

source: Tome of the Sands
de: Foliant des Sandes
it: Tomo delle sabbie
ja: 砂の書
ru: Том песков
uk: Том пісків

source: Scarabs Sting
de: Stachel des Scarabäus
it: Morso dello scarabeo
ja: スカラベの針
ru: Жало скарабея
uk: Жало скарабея

source: Dune Whisper
de: Dünenflüstern
it: Sussurratore delle dune
ja: 砂丘の囁き
ru: Шепот пустыни
uk: Шепіт пустелі

source: Scorpion Fang
de: Skorpionfangzahn
it: Zanna dello scorpione
ja: サソリの牙
ru: Жало скорпиона
uk: Жало скорпіона

source: Sand Serpent
de: Sandschlange
it: Serpente della sabbia
ja: 砂の蛇
ru: Песчаный змей
uk: Піщаний змій

source: Oasis Blade
de: Oasenklinge
it: Lama dell'oasi
ja: オアシスブレード
ru: Клинок оазиса
uk: Клинок оазису

source: Desert Mirage
de: Wüstentrugbild
it: Miraggio del deserto
ja: 砂漠の蜃気楼
ru: Пустынный мираж
uk: Пустельний міраж

source: Scarab Staff
de: Stab des Scarabäus
it: Bastone dello scarabeo
ja: スカラベの杖
ru: Посох скарабея
uk: Посох скарабея

source: Sandstorm Rod
de: Sandsturmrute
it: Bastone della tempesta di sabbia
ja: 砂漠の竿
ru: Жезл песчаной бури
uk: Жезл піщаної бурі

source: Sun Gods Will
de: Sonnengottes Wille
it: Volere del dio del sole
ja: 太陽神の意志
ru: Воля бога солнца
uk: Воля бога сонця

source: Dune Cleaver
de: Dünenhackbeil
it: Mannaia delle dune
ja: 砂丘のクリーバー
ru: Дюнный секач
uk: Дюнний сікач

source: Scarab Axe
de: Skarabäus-Axt
it: Ascia dello scarabeo
ja: スカラベの斧
ru: Топор скарабея
uk: Сокира скарабея

source: Sunset Reaper
de: Sonnenuntergangs-Schnitter
it: Mietitore del tramonto
ja: 夕日の死神
ru: Закатный жнец
uk: Сутінковий жнець

source: Desert Vengeance
de: Wüstenrache
it: Vendetta del deserto
ja: 砂漠の死神
ru: Месть пустыни
uk: Помста пустелі

source: Oasis Crusher
de: Oasenbrecher
it: Frantumatore dell'oasi
ja: オアシスクラッシャー
ru: Оазисный крушитель
uk: Оазисний нищівник

source: Scarabs Fury
de: Skarabäuswut
it: Furia dello scarabeo
ja: スカラベの猛威
ru: Ярость скарабея
uk: Лють скарабея

source: Sun Gods Might
de: Sonnengottes Macht
it: Potere del dio del sole
ja: 太陽神の力
ru: Мощь бога солнца
uk: Міць бога сонця

source: Desert Pounder
de: Wüstenhämmerer
it: Arma del deserto
ja: デザートパウンダー
ru: Пустынное орудие
uk: Пустельне знаряддя

source: Spear of the Sand King
de: Speer des Sandkönigs
it: Lancia del re della sabbia
ja: 砂王の槍
ru: Копье короля песков
uk: Спис короля пісків

source: Scarabs Piercer
de: Skarabäus-Stecher
it: Perforatore dello scarabeo
ja: スカラベ・ピアサー
ru: Пронзитель скарабея
uk: Пронизувач скарабея

source: Sunstrike Spear
de: Sonnenschlagspeer
it: Lancia del colpo solare
ja: 太陽の一撃槍
ru: Копье солнечного удара
uk: Спис сонячного удару

source: Oasis Javelin
de: Oasenspeer
it: Giavellotto dell'oasi
ja: オアシス・ジャベリン
ru: Копье оазиса
uk: Спис оазису

source: Shadow Fang Dagger
de: Schattenfang
it: Zanna delle ombre
ja: 闇の牙ダガー
ru: Призрачный клык
uk: Примарне ікло

source: Whispering Blade Dagger
de: Flüsternde Klinge
it: Lancia sussurrante
ja: 囁き剣ダガー
ru: Шепчущий клинок
uk: Шепітливий клинок

source: Nightshades Kiss Dagger
de: Nachtschattenkuss
it: Bacio dell'ombra notturna
ja: ナイトシェードのキス
ru: Поцелуй ночной тени
uk: Поцілунок нічної тіні

source: Enchanted Thorn Dagger
de: Verzauberter Dorn
it: Spina incantata
ja: 魔法の棘
ru: Зачарованный терновник
uk: Зачарований терен

source: Darkness Dagger
de: Dolch der Dunkelheit
it: Pugnale dell'oscurità
ja: 闇のダガー
ru: Кинжал мрака
uk: Кинджал мороку

source: Eclipse Edge Sword
de: Eklipsenkante
it: Spada dell'eclisse
ja: 日蝕の刃
ru: Лезвие затмения
uk: Лезо затемнення

source: Blade of Eternity Sword
de: Klinge der Ewigkeit
it: Lama dell'eternità
ja: 不滅の剣
ru: Клинок вечности
uk: Клинок вічності

source: Dragons Fury Sword
de: Drachenwut
it: Furia del drago
ja: ドラゴンの猛威
ru: Ярость дракона
uk: Лють дракона

source: Enchanted Sword
de: Verzaubertes Schwert
it: Spada incantata
ja: 魔法の剣
ru: Зачарованный меч
uk: Зачарований меч

source: Shadow Slayer Sword
de: Schattenschlächter
it: Omicida delle ombre
ja: シャドー・スレイヤー
ru: Убийца теней
uk: Убивця тіней

source: Staff of Illusions
de: Stab der Illusionen
it: Bastone delle illusioni
ja: 幻影の杖
ru: Посох иллюзий
uk: Посох ілюзій

source: Arcane Rod Staff
de: Arkanenrut
it: Bastone arcano
ja: 魔法の竿
ru: Волшебный жезл
uk: Чарівний жезл

source: Nightmare Scepter Staff
de: Albtraumzepter
it: Scettro degli incubi
ja: 悪夢の杖
ru: Скипетр кошмара
uk: Скіпетр жаху

source: Twilight Wand Staff
de: Zauberstab der Dämmerung
it: Bacchetta crepuscolare
ja: 黄昏の杖
ru: Сумеречная палочка
uk: Сутінкова паличка

source: Dark Reaver Axe
de: Dunkler Schnitter
it: Predatore oscuro
ja: ダークリーバー
ru: Темный хищник
uk: Темний хижак

source: Enchanted Axe
de: Verzauberte Axt
it: Ascia incantata
ja: 魔法の斧
ru: Зачарованная секира
uk: Зачарована сокира

source: Dragons Cleaver Axe
de: Drachenhackbeil
it: Ascia del drago
ja: ドラゴンのクリーバー
ru: Драконий секач
uk: Драконів сікач

source: Shadow Axe
de: Schattenaxt
it: Ascia delle ombre
ja: 影の斧
ru: Сумеречный топор
uk: Сутінкова сокира

source: Grim Reaper Axe
de: Sensenmann
it: Ascia del mietitore
ja: 死神の斧
ru: Суровый жнец
uk: Суворий жнець

source: Enchanted Maul Axe
de: Verzauberter Vorschlaghammer
it: Accetta incantata
ja: 魔法のモール
ru: Зачарованный рубака
uk: Зачарований рубака

source: Dragons Hammer Axe
de: Drachenhammer
it: Martello del drago
ja: ドラゴンのハンマー
ru: Драконий молот
uk: Драконячий молот

source: Nightfall Hammer Axe
de: Nachtanbruch-Hammer
it: Martello dell'imbrunire
ja: 夕闇のハンマー
ru: Сумеречный молот
uk: Сутінковий молот

source: Spear of the Fallen
de: Speer der Gefallenen
it: Lancia dei caduti
ja: 堕ちた者の槍
ru: Копье падшего
uk: Спис занепалого

source: Enchanted Pike Spear
de: Verzauberter Hecht
it: Spuntone incantato
ja: 魔法のパイク
ru: Зачарованная пика
uk: Зачарована піка

source: Dark Lance Spear
de: Dunkle Lanze
it: Lancia oscura
ja: ダークランス
ru: Темное копье
uk: Темний спис

source: Dragons Spear Spear
de: Drachenspeer
it: Lancia del drago
ja: ドラゴンの槍
ru: Копье дракона
uk: Спис дракона

source: Shadow Javelin Spear
de: Schattenspeer
it: Giavellotto ombroso
ja: シャドウジャベリン
ru: Копье теней
uk: Спис тіней

source: Twilight Tunic
de: Dämmerungstunika
it: Tunica crespuscolare
ja: 黄昏のチュニック
ru: Туника затмения
uk: Туніка затемнення

source: Enchanted Tunic
de: Verzauberte Tunika
it: Tunica incantata
ja: 魔法のチュニック
ru: Зачарованная туника
uk: Зачарована туніка

source: Shadow Tunic
de: Schattentunika
it: Tunica ombrosa
ja: 闇のチュニック
ru: Туника теней
uk: Туніка тіней

source: Dragons Tunic
de: Drachentunika
it: Tunica del drago
ja: ドラゴンのチュニック
ru: Туника дракона
uk: Туніка дракона

source: Nightfall Tunic
de: Nachtanbruch-Tunika
it: Tunica dell'imbrunire
ja: 夕闇のチュニック
ru: Туника заката
uk: Туніка затінку

source: Robe of the Arcane
de: Robe des Arkanen
it: Toga dell'arcano
ja: 秘術のローブ
ru: Мантия заклинателя
uk: Мантія заклинателя

source: Shadow Robe
de: Schattenrobe
it: Toga ombrosa
ja: 闇のローブ
ru: Плащ теней
uk: Плащ тіней

source: Enchanted Robe
de: Verzauberte Robe
it: Toga incantata
ja: 魔法のローブ
ru: Заговоренный плащ
uk: Заговорений плащ

source: Twilight Robe
de: Nachtanbruch-Robe
it: Toga crespuscolare
ja: 黄昏のローブ
ru: Плащ затмения
uk: Плащ затемнення

source: Dragon's Robe
de: Drachenrobe
it: Toga del drago
ja: ドラゴンのローブ
ru: Плащ дракона
uk: Плащ дракона

source: Armor of the Ancients
de: Rüstung der Alten
it: Corazza degli antichi
ja: 古代人の鎧
ru: Броня древних
uk: Броня древніх

source: Dark Plate
de: Dunkle Platte
it: Lastra oscura
ja: ダーク・プレート
ru: Кираса теней
uk: Кіраса тіней

source: Enchanted Armor
de: Verzauberte Rüstung
it: Corazza incantata
ja: 魔法の鎧
ru: Зачарованная броня
uk: Зачарована броня

source: Dragon's Plate
de: Drachenplatte
it: Lastra del drago
ja: ドラゴンのプレート
ru: Кираса дракона
uk: Кіраса дракона

source: Shadow Armor
de: Schattenrüstung
it: Corazza ombrosa
ja: 闇の鎧
ru: Броня теней
uk: Броня тіней

source: Bloodthorn Dagger
de: Blutdorn-Dolch
it: Pugnale insanguinato
ja: 血茨のダガー
ru: Кинжал из терновника
uk: Кинджал із терну

source: Venomous Whisper Dagger
de: Giftiges Flüstern
it: Sussurratore velenoso
ja: 毒の囁き
ru: Ядовитый шепот
uk: Отруйний шепіт

source: Gravekeepers Fang Dagger
de: Fangzahn des Grabwächters
it: Zanna del guardiano tombale
ja: 墓守の牙
ru: Клык могильщика
uk: Ікло могильника

source: Whispering Venom Dagger
de: Flüsterndes Gift
it: Veleno sussurrante
ja: 毒の囁き
ru: Плеск отравы
uk: Плескіт отрути

source: Soulshard Stinger Dagger
de: Seelensplitterstachel
it: Aculeo senz'anima
ja: ソウルシャード・スティンガー
ru: Кинжал-душегуб
uk: Кинджал-душогуб

source: Necrotic Edge Sword
de: Nekrotische Kante
it: Spada necrotica
ja: 死霊のエッジ
ru: Некротический клинок
uk: Некротичний клинок

source: Haunted Blade Sword
de: Geisterklinge
it: Spada stregata
ja: 憑りつかれた剣
ru: Призрачный клинок
uk: Примарний клинок

source: Wraithfire Sword
de: Geisterfeuer-Schwert
it: Lama infuocata
ja: レイスファイア・ソード
ru: Меч огненного духа
uk: Меч вогняного духу

source: Soulreaver Sword
de: Seelenreißer
it: Spada senz'anima
ja: ソウルリーバー
ru: Душегуб
uk: Душогуб

source: Phantoms Wrath Sword
de: Phantoms Zorn
it: Collera fantasma
ja: ファントムの怒り
ru: Гнев призрака
uk: Гнів примари

source: Voidcaller Staff
de: Leerenrufer-Stab
it: Bastone vacuo
ja: ヴォイドコーラー
ru: Посох призывателя пустоты
uk: Посох закликача порожнечі

source: Staff of Withering Staff
de: Stab des Verwelkens
it: Bastone raggelante
ja: 枯死の杖
ru: Посох увядания
uk: Посох занепаду

source: Netherbane Rod Staff
de: Netherbann-Rute
it: Asta del tormento
ja: ネザーベイン・ロッド
ru: Жезл адского проклятия
uk: Жезл пекельного прокляття

source: Plaguebringers Scepter Staff
de: Zepter des Seuchenbringers
it: Scettro della piaga
ja: ペストブリンガーのセプター
ru: Скипетр чумоносца
uk: Скіпетр чумоносця

source: Spectral Wisp Staff
de: Spektrales Irrlicht
it: Bastone spettrale
ja: スペクトラル ウィスプ
ru: Спектральный просвет
uk: Спектральний просвіт

source: Doombringer Axe
de: Verhängnisbringer-Axt
it: Ascia dell'avversità
ja: ドゥームブリンガーアックス
ru: Секира роковой участи
uk: Сокира фатальної долі

source: Bloodreaver Axe
de: Blutreißer
it: Ascia di sangue
ja: ブラッドリーバー
ru: Кровный жнец
uk: Кровний жнець

source: Nightfall Cleaver Axe
de: Nachtanbruch-Hackbeil
it: Ascia dell'imbrunire
ja: ナイトフォールクリーバー
ru: Клевец заката
uk: Клевець сутінків

source: Voidrend Axe
de: Leerenreißer-Axt
it: Ascia vacua
ja: ヴォイドレンダアックス
ru: Топор разрыва бездны
uk: Сокира розриву безодні

source: Soulcrusher Axe
de: Seelenbrecher
it: Frantumatore d'anime
ja: ソウルクラッシャー
ru: Сокрушитель душ
uk: Нищівник душ

source: Grimshatter Hammer
de: Grimmzertrümmerer
it: Martello tetro
ja: グリムシャッターアックス
ru: Мрачный крушитель
uk: Похмурий руйнівник

source: Plaguebringers Maul Hammer
de: Vorschlaghammer des Seuchenbringers
it: Accetta della piaga
ja: ペストブリンガーのモール
ru: Булава чумоносца
uk: Булава чумоносця

source: Necrotic Hammer
de: Nekrotischer Hammer
it: Martello necrotico
ja: ネクロティックアックス
ru: Некротический молот
uk: Некротичний молот

source: Dreadforge Maul Hammer
de: Vorschlaghammer der Schreckensschmiede
it: Accetta angosciante
ja: ドレッドフォージのモール
ru: Кувалда Кузницы ужаса
uk: Кувалда Кузні жаху

source: Wraithcrush Hammer
de: Geisterbrecher
it: Martello spettrale
ja: レイスクラッシュアックス
ru: Молот сокрушителя душ
uk: Молот нищівника душ

source: Harbingers Spear
de: Speer des Vorboten
it: Lancia del messaggero
ja: ハービンジャーの槍
ru: Копье предвестника
uk: Спис провісника

source: Voidpiercer Spear
de: Leerenstecher
it: Perforatore vacuo
ja: ヴォイドピアサー
ru: Пронзатель пустоты
uk: Пронизувач порожнечі

source: Soulshard Pike Spear
de: Seelensplitter-Hecht
it: Spuntone delle anime scheggiate
ja: ソウルシャードパイク
ru: Пика осколка души
uk: Піка уламка душі

source: Plaguebringers Lance
de: Lanze des Seuchenbringers
it: Lancia della piaga
ja: ペストブリンガーのランス
ru: Копье чумоносца
uk: Спис чумоносця

source: Gravekeepers Javelin Spear
de: Grabwächters Speer
it: Giavellotto del guardiano tombale
ja: 墓守のジャベリン
ru: Дротик могильщика
uk: Дротик могильника

source: Necromancers Shroud
de: Leichentuch des Nekromanten
it: Velo del necromante
ja: ネクロマンサーのシャラウド
ru: Саван некроманта
uk: Саван некроманта

source: Plaguebearers Tunic
de: Tunika des Seuchenbringers
it: Tunica dell'untore
ja: ペストベアラーのチュニック
ru: Туника чумоносца
uk: Туніка чумоносця

source: Specters Garb
de: Gespenstergewand
it: Aspetto spettrale
ja: スペクターの衣装
ru: Призрачная одежда
uk: Примарний одяг

source: Voidwoven Tunic
de: Leergewebte Tunika
it: Tunica vacua
ja: ヴォイドウーブンのチュニック
ru: Туника пустоты
uk: Туніка порожнечі

source: Gravekeepers Vestment
de: Gewand des Grabwächters
it: Veste del guardiano tombale
ja: 墓守の衣
ru: Облачение могильщика
uk: Вбрання могильника

source: Necrotic Shroud
de: Nekrotisches Leichentuch
it: Velo necrotico
ja: 死霊のシャラウド
ru: Некротический саван
uk: Некротичний саван

source: Plaguebearers Robe
de: Robe des Seuchenbringers
it: Veste dell'untore
ja: ペストベアラーのローブ
ru: Мантия чумоносца
uk: Мантія чумоносця

source: Voidwoven Robe
de: Leeregewebte Robe
it: Veste vacua
ja: ヴォイドウーブンのローブ
ru: Пустотная мантия
uk: Пустотна мантія

source: Gravekeeper's Mantle
de: Mantel des Grabwächters
it: Mantello del guardiano tombale
ja: 墓守のマント
ru: Мантия могильщика
uk: Мантія могильника

source: Necrotic Plate
de: Nekrotische Platte
it: Lastra necrotica
ja: 死霊のシャラウド
ru: Некротические латы
uk: Некротичні лати

source: Dreadforge Armor
de: Rüstung der Schreckensschmiede
it: Corazza angoscinate
ja: ドレッドフォージアーマー
ru: Броня Кузницы ужаса
uk: Броня Кузні жаху

source: Plaguebearers Plate
de: Platte des Seuchenbringers
it: Lastra dell'untore
ja: ペストベアラーのプレート
ru: Латы чумоносца
uk: Лати чумоносця

source: Voidsteel Plate
de: Leerestahl-Platte
it: Lastra vacua d'acciaio
ja: ヴォイドスチールプレート
ru: Броня из пустотной стали
uk: Броня з пустотної сталі

source: Gravekeepers Armor
de: Grabwächter-Rüstung
it: Corazza del guardiano tombale
ja: 墓守のアーマー
ru: Доспехи могильщика
uk: Обладунки могильника

source: Robe of Shadows
de: Robe der Schatten
it: Veste delle ombre
ja: 影のローブ
ru: Мантия теней
uk: Мантія тіней

source: Twilight Armor
de: Dämmerungsrüstung
it: Corazza crepuscolare
ja: トワイライトアーマー
ru: Сумеречные доспехи
uk: Сутінкові обладунки

source: Void Tunic
de: Tunika der Leere
it: Tunica vacua
ja: ヴォイドチュニック
ru: Туника пустоты
uk: Туніка порожнечі

source: Nightfall Robe
de: Nachtanbruch-Robe
it: Veste dell'imbrunire
ja: 夕闇のローブ
ru: Мантия сумерек
uk: Мантія сутінків

source: Eclipse Armor
de: Eklipsenrüstung
it: Corazza dell'eclisse
ja: 日蝕のアーマー
ru: Доспехи затмения
uk: Обладунки затьмарення

source: Phantom Tunic
de: Phantom-Tunika
it: Tunica fantasma
ja: ファントムチュニック
ru: Призрачная туника
uk: Примарна туніка

source: Radiant Robe
de: Strahlende Robe
it: Veste radiante
ja: 輝きのローブ
ru: Сияющая мантия
uk: Сяючий халат

source: Solar Armor
de: Solarrüstung
it: Corazza solare
ja: 太陽のアーマー
ru: Солнечный доспех
uk: Сонячний обладунок

source: Aurora Tunic
de: Aurora-Tunika
it: Tunica dell'aurora
ja: オーロラチュニック
ru: Туника полярного сияния
uk: Туніка полярного сяйва

source: Luminous Robe
de: Leuchtende Robe
it: Veste luminosa
ja: 光のローブ
ru: Светящаяся мантия
uk: Сяюча мантія

source: Celestial Armor
de: Himmlische Rüstung
it: Corazza celestiale
ja: 天空のアーマー
ru: Небесные доспехи
uk: Небесні обладунки

source: Glorious Tunic
de: Prachtvolle Tunika
it: Tunica gloriosa
ja: 栄光のチュニック
ru: Туника славы
uk: Туніка слави

source: Verdant Robe
de: Grüne Robe
it: Veste verdeggiante
ja: 緑のローブ
ru: Лиственная мантия
uk: Листяна мантія

source: Stoneplate Armor
de: Steinplattenrüstung
it: Corazza di pietra
ja: ストーンプレートアーマー
ru: Доспехи из каменных пластин
uk: Обладунки з кам'яних пластин

source: Terra Tunic
de: Terra Tunika
it: Tunica di terra
ja: テラチュニック
ru: Туника единения с землей
uk: Туніка єднання із землею

source: Moss Robe
de: Moosrobe
it: Veste muschiosa
ja: 苔のローブ
ru: Плащ из мха
uk: Плащ із моху

source: Granite Armor
de: Granitrüstung
it: Corazza granitica
ja: 花崗岩のアーマー
ru: Гранитная броня
uk: Гранітна броня

source: Rooted Tunic
de: Verwurzelte Tunika
it: Tunica di radici
ja: ルーテッドチュニック
ru: Туника кореньев
uk: Туніка коренів

source: Gale Robe
de: Sturmrobe
it: Veste burrascosa
ja: 嵐のローブ
ru: Штормовая мантия
uk: Штормовий халат

source: Skyguard Armor
de: Himmelswächter-Rüstung
it: Corazza del guardiano celeste
ja: スカイガードアーマー
ru: Доспехи стража небес
uk: Обладунки вартового небес

source: Breeze Tunic
de: Brise-Tunika
it: Tunica di brezza
ja: 風のチュニック
ru: Туника бриза
uk: Туніка бриза

source: Zephyr Robe
de: Zephir-Robe
it: Veste di zaffiro
ja: ゼファーのローブ
ru: Мантия легкого ветерка
uk: Мантія легкого вітерця

source: Storm Armor
de: Sturmrüstung
it: Corazza tempestosa
ja: 嵐のアーマー
ru: Штормовая броня
uk: Штормова броня

source: Cloud Tunic
de: Wolkentunika
it: Tunica di nuvole
ja: 雲のチュニック
ru: Облачная туника
uk: Хмарна туніка

source: Tidal Robe
de: Gezeitenrobe
it: Veste delle maree
ja: 潮のローブ
ru: Мантия приливов
uk: Мантія приливів

source: Coral Armor
de: Korallenrüstung
it: Corazza di corallo
ja: サンゴのアーマー
ru: Коралловые доспехи
uk: Коралові обладунки

source: Wave Tunic
de: Wellentunika
it: Tunica ondosa
ja: 波のチュニック
ru: Туника волны
uk: Туніка хвилі

source: Oceanic Robe
de: Ozeanische Robe
it: Veste oceanica
ja: 海のローブ
ru: Океаническая мантия
uk: Океанічна мантія

source: Aquatic Armor
de: Aquatische Rüstung
it: Corazza acquatica
ja: 水のアーマー
ru: Акваброня
uk: Акваброня

source: Stream Tunic
de: Stromtunika
it: Tunica dei ruscelli
ja: ストリームチュニック
ru: Туника потока
uk: Туніка потоку

source: Inferno Robe
it: Veste infernale
ja: インフェルノローブ
ru: Мантия инферно
uk: Мантія інферно

source: Blaze Armor
de: Brandrüstung
it: Corazza fiammeggiante
ja: ブレイズアーマー
ru: Броня зарева
uk: Броня заграви

source: Ember Tunic
de: Glut-Tunika
it: Tunica delle braci
ja: エンバーのチュニック
ru: Тлеющая туника
uk: Тліюча туніка

source: Flame Robe
de: Flammenrobe
it: Veste fiammante
ja: 炎のチュニック
ru: Пылающая мантия
uk: Палаюча мантія

source: Molten Armor
de: Geschmolzene Rüstung
it: Corazza colata
ja: 溶岩のアーマー
ru: Расплавленный доспех
uk: Розплавлений обладунок

source: Scorch Tunic
de: Sengende Tunika
it: Tunica bruciacchiata
ja: 焦げたチュニック
ru: Обожженная туника
uk: Обпалена туніка

source: Instant Dark Twin
de: Instanter Dunkler Zwilling
it: Gemello oscuro istantaneo
ja: インスタントダークツイン
ru: Мгновенный темный двойник
uk: Миттєвий темний двійник

source: Instant Dark Twin-desc
de: Beschwört einen Dunklen Zwilling, der an der Seite des Soldaten mit schmutzigem Gesicht kämpft. Zum Aktivieren einen Angriff abfeuern.
it: Evoca un gemello oscuro per combattere a fianco del soldato dalla faccia scura. Spara per attivare.
ja: 汚れ顔の兵士と一緒に戦うダークツインを召喚する 発動するには攻撃を行う
ru: Призывает темного близнеца, который будет сражаться на вашей стороне. Чтобы активировать, произведите атаку.
uk: Викликає темного близнюка, який битиметься на вашому боці. Щоб активувати, зробіть атаку.

source: Gatekeepers Bionic Arm
de: Bionischer Arm des Torwächters
it: Braccio bionico del guardiano
ja: ゲートキーパーのバイオニックアーム
ru: Бионическая рука привратника

source: Crimson Knights Axe
de: Axt des Purpurritters
it: Ascia del cavaliere cremisi
ja: クリムゾンナイトの斧
ru: Топор багряного рыцаря
uk: Сокира багряного лицаря

source: Onyx Knights Cleaver Axe
de: Hackbeil des Onyxritters
it: Mannaia del cavaliere onice
ja: オニックスナイトのクリーバー
ru: Клевец ониксового рыцаря
uk: Клевець оніксового лицаря

source: Ruby Pawns Dagger
de: Schneide des Rubinbauers
it: Lama della pedina rubino
ja: ルビーポーンのダガー
ru: Клинок рубиновой пешки
uk: Клинок рубінового пішака

source: Sapphire Pawns Dagger
de: Klinge des Saphirbauers
it: Lama della pedina zaffiro
ja: サファイアポーンのダガー
ru: Клинок сапфировой пешки
uk: Клинок сапфірового пішака

source: Ruby Rooks Maul
de: Vorschlaghammer des Rubinturms
it: Accetta del corvo rubino
ja: ルビールークのモール
ru: Молот рубиновой ладьи
uk: Молот рубінової тури

source: Sapphire Rooks Hammer
de: Vorschlaghammer des Saphirturms
it: Martello del corvo zaffiro
ja: サファイアルークのハンマー
ru: Молот сапфировой ладьи
uk: Молот сапфірової тури

source: Ruby Queens Spear
de: Speer der Rubindame
it: Lancia della regina rubino
ja: ルビーのクイーンの槍
ru: Копье рубиновой королевы
uk: Спис рубінової королеви

source: Onyx Queens Lance
de: Lanze der Onyxdame
it: Lancia della regina onice
ja: オニックスのクイーンのランス
ru: Копье ониксовой королевы
uk: Спис оніксової королеви

source: Ruby Bishops Staff
de: Stab des Rubinläufers
it: Bastone del vescovo rubino
ja: ルビービショップの杖
ru: Посох рубинового слона
uk: Посох рубінового слона

source: Onyx Bishops Rod
de: Rute des Onyxläufers
it: Verga del vescovo onice
ja: オニックスのビショップの竿
ru: Жезл ониксового слона
uk: Жезл оніксового слона

source: Sovereigns Ruby Sword
de: Rubinklinge des Herrschers
it: Lama rubino del sovrano
ja: ソブリンのルビーの剣
ru: Меч рубинового короля
uk: Меч рубінового короля

source: Sovereigns Onyx Sword
de: Onyxklinge des Herrschers
it: Spada onice del sovrano
ja: ソブリンのオニックスの剣
ru: Меч ониксового короля
uk: Меч оніксового короля

source: Instant Gust
de: Instanter Windstoß
it: Raffica istantanea
ja: インスタントガスト
ru: Порыв ветра
uk: Порив вітру

source: Instant Gust-desc
de: Stößt Feinde mit einem kräftigen Windstoß bei jedem Angriff zurück.
it: Allontana i nemici con una potente raffica per ogni attacco.
ja: 強力な風を発生させて敵を押し戻す 発動には攻撃を行う
ru: При каждой вашей атаке отталкивает врагов назад мощным порывом ветра.
uk: При кожній вашій атаці відштовхує ворогів назад потужним поривом вітру.

source: Nightshade
de: Nachtschatten
it: Ombra notturna
ja: ナイトシェード
ru: Призрачный олень
uk: Примарний олень

source: spectral-desc
de: Beschwört eine geisterhafte Kreatur.
it: Evoca una creatura spettrale.
ja: 霊体の生物を召喚する
ru: Призывает призрачное существо.
uk: Викликає примарну істоту.

source: Tidecaller Ring
de: Gezeitenrufer
it: Evoca-maree
ja: 潮呼び
ru: Укротитель приливов
uk: Приборкувач припливів

source: Fangbone Bulwark Armlet
de: Reißzahnbollwerk
it: Zanne d'ossa difensive
ja: 牙骨の防衛腕輪
ru: Клыкастый бастион
uk: Ікластий бастіон
