Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/items.strings
Languages: de, it, ja, ru, uk

source: Heartcrusher
de: Herzensbrecher
it: Frantuma-cuore
ja: ハートクラッシャー
ru: Разбиватель Сердец
uk: Руйнівник сердець

source: Skeletal Hammer
de: Skeletthammer
it: Martello scheletrico
ja: スケルタルハンマー
ru: Молот Скелета
uk: Кістяний розтрощувач

source: Shooting Star
de: Sternschnuppe
it: Stella cadente
ja: シューティングスター
ru: Падающая Звезда
uk: Падаюча зірка

source: Ferocious Scepter
de: Wildes Zepter
it: Scettro feroce
ja: 猛りの笏
ru: Свирепый Скипетр
uk: Нещадний скіпетр

source: War-Forged Smasher
de: Kriegsgeschmiedeter Smasher
it: Frantumatore da guerra
ja: ウォースマッシャー
ru: Воинственный Крушитель
uk: Штурмовий дробитель

source: Wrathful Warmace
de: Zornige Kriegskeule
it: Mazza ferrata furiosa
ja: 憤怒の戦槌
ru: Булава Ярости
uk: Булава гніву

source: Eternal Rest
de: Ewige Ruhe
it: Riposo eterno
ja: エターナルレスト
ru: Вечный Покой
uk: Вічний спокій

source: Blood-Forged Scepter
de: Blutgeschmiedetes Zepter
it: Scettro sanguigno
ja: ブラッドセプター
ru: Кровожадный Скипетр
uk: Скіпетр кривавої сталі

source: Sentinel Battlehammer
de: Kriegshammer des Wächters
it: Martello da battaglia della sentinella
ja: 衛兵の戦槌
ru: Боевой Молот Стражника
uk: Бойовий молот вартового

source: Scepter of the Wicked
de: Zepter der Bösen
it: Scettro del maligno
ja: 邪悪の笏
ru: Нечестивый Скипетр
uk: Скіпетр нечестивого

source: Blade of the Wicked
de: Klinge der Bösen
it: Lama del maligno
ja: 邪悪の剣
ru: Нечестивый Клинок
uk: Клинок нечестивого

source: Staff of the Wicked
de: Stab der Bösen
it: Bastone del maligno
ja: 邪悪の杖
ru: Нечестивый Посох
uk: Посох нечестивого

source: Destroyer of the Corrupted
de: Zerstörer der Verderbten
it: Distruttore dei corrotti
ja: 堕落の破壊者
ru: Истребитель Порчи
uk: Викорінювач пороків

source: Death Stalker
de: Todesstalker
it: Persecutore della morte
ja: デスストーカー
ru: Смертельный Охотник
uk: Смертельний мисливець

source: Ominous Reaper
de: Unheilvoller Schnitter
it: Falciatrice nefasta
ja: メナスリーパー
ru: Зловещий Жнец
uk: Зловісний жнець

source: Battlescythe of Retribution
de: Kampfsense der Vergeltung
it: Falce del castigo
ja: 報復の戦鎌
ru: Коса Возмездия
uk: Бойова коса відплати

source: Whisper Of Light
de: Flüstern des Lichts
it: Sussurratore della luce
ja: ライトウィスパー
ru: Шёпот Света
uk: Шепіт світла

source: Whisper Of Death
de: Flüstern des Todes
it: Sussurratore della morte
ja: デスウィスパー
ru: Шёпот Смерти
uk: Шепіт смерті

source: Whisper Of Life
de: Flüstern des Lebens
it: Sussurratore della vita
ja: ライフウィスパー
ru: Шёпот Жизни
uk: Шепіт життя

source: Whisper Of Fire
de: Flüstern des Feuers
it: Sussurratore del fuoco
ja: ファイアウィスパー
ru: Шёпот Пламени
uk: Шепіт полум'я

source: Vanquisher
de: Bezwinger
it: Eliminatore
ja: ヴァンキッシュ
ru: Покоритель
uk: Завойовник

source: Nemesis
it: Nemesi
ja: ネメシス
ru: Мститель
uk: Месник

source: Due Diligence
it: Adeguata valutazione
ja: デューデリジェンス
ru: Надсмотрщик
uk: Наглядач

source: Skeletal Reaver
de: Skelettplünderer
it: Recuperatore di scheletri
ja: スケルタルリーバー
ru: Костяной Похититель
uk: Кістяний розбійник

source: Hope's End
de: Das Ende der Hoffnung
it: Fine della speranza
ja: エンドオブホープ
ru: Конец Надежд
uk: Руйнівник надій

source: Enchanted Slicer
de: Verzauberter Schneider
it: Affettatore incantato
ja: エンチャントスライサー
ru: Зачарованный Резак
uk: Зачарований різак

source: Gutslasher
de: Darmschnitter
it: Budellatore
ja: ガットスラッシャー
ru: Измельчитель
uk: Череворіз

source: Stormcaller
de: Sturmbeschwörer
it: Evocatore di tempeste
ja: アラシヨビ
ru: Буревестник
uk: Повелитель бурі

source: Cataclysm Swiftblade
de: Schnellklinge des Kataklysmus
it: Coltello tempestivo del cataclisma
ja: 大波の速太刀
ru: Скорый Клинок Катаклизма
uk: Швидкий клинок катаклізму

source: Loyal Slasher Shortsword
de: Treue Kurzschwertschnitter
it: Piccola spada dell'aggressore leale
ja: ロイヤルスラッシャー
ru: Короткий Меч Верного Теска
uk: Вірний гладіус

source: Blood Shortblade
de: Kurzklinge des Blutes
it: Piccola lama di sangue
ja: 血染めの短剣
ru: Короткий Клинок Крови
uk: Кривавий тесак

source: Blood Swiftblade
de: Schnellklinge des Blutes
it: Coltello tempestivo di sangue
ja: 血染めの速太刀
ru: Скорый Клинок Крови
uk: Кривавий швидкий клинок

source: Night's Fall
de: Einbruch der Nacht
it: Caduta della notte
ja: ナイトフォール
ru: Ночной Охотник
uk: Нічний мисливець

source: Terror Crusader
de: Kreuzritter des Terrors
it: Crociato del terrore
ja: テラークルセイダー
ru: Грозный Крестоносец
uk: Хрестоносець жаху

source: Skyfall Crusader
de: Kreuzritter des Himmelssturzes
it: Crociato della caduta celeste
ja: スカイフォールクルセイダー
ru: Небесный Крестоносец
uk: Хрестоносець судного дня

source: Swiftblade of Lament
de: Schnellklinge der Klage
it: Lama tempestiva del lamento
ja: 嘆きの短剣
ru: Скорый Клинок Жалости
uk: Швидкий клинок благання

source: Oathkeeper's Skewer
de: Schwurbewahrers Spieß
it: Spiedo del bestemmiatore
ja: 忠誠の剣
ru: Шпага Присягателя
uk: Жало зберігача присяги

source: Unholy Storm
de: Unheiliger Sturm
it: Tempesta scellerata
ja: ケガレアラシ
ru: Нечестивый Шторм
uk: Нечестивий шторм

source: Moonlit Razor
de: Mondbeschienenes Rasiermesser
it: Rasoio lunare
ja: 月明かりの刃
ru: Лунный Сбриватель
uk: Місячна бритва

source: Sunlit Razor
de: Sonnenbeschienenes Rasiermesser
it: Rasoio solare
ja: 日照りの刃
ru: Солнечный Сбриватель
uk: Сонячна бритва

source: Proud Sabre
de: Stolzer Säbel
it: Sciabola dell'orgoglio
ja: プラウドセイバー
ru: Сабля Гордости
uk: Шабля гордості

source: Final Achievement
de: Finaler Erfolg
it: Obiettivo finale
ja: 最終成績
ru: Финальное Достижение
uk: Фінальне досягнення

source: Blackest Heart
de: Schwärzestes Herz
it: Cuore oscuro
ja: 漆黒の心
ru: Чёрное Сердце
uk: Чорне серце

source: Haunted Slicer
de: Spukschnitter
it: Affilatore maledetto
ja: ホーンテッドスライサー
ru: Призрачный Резак
uk: Проклятий різак

source: Moonshadow
de: Mondschatten
it: Chiaro di luna
ja: 月影
ru: Лунная Тень
uk: Місячна тінь

source: Creepy Crawler
de: Gruseliges Kriechtier
it: Ragno rognoso
ja: クリーピークロウラー
ru: Жуткий Ползун
uk: Жахливий повзун

source: whisper-fire-desc
de: Beschwört einen feuerelementaren Begleiter.
it: Evoca un compagno elementale di fuoco.
ja: 火属性の味方を召喚する
ru: Призывает огненного элементаля.
uk: Закликає вогняного елементаля.

source: vina-desc
de: Beschwört eine Lichtfee.
it: Evoca una fata di luce.
ja: 光の妖精を召喚する
ru: Призывает светлую фею.
uk: Закликає світлу фею.

source: creepy-crawler-desc
de: Beschwört einen schrecklichen Begleiter.
it: Evoca un compagno orrendo.
ja: 恐ろしい味方を召喚する
ru: Призывает ужасающее существо.
uk: Закликає жахливу істоту.

source: skull-desc
de: Beschwört einen Geisterschädel.
it: Evoca un teschio fantasma.
ja: 骨の姿をした幽霊を召喚する
ru: Призывает призрачный череп.
uk: Закликає примарного скелета.

source: Plate of Frozen Voices
de: Platte der gefrorenen Stimmen
it: Piatto delle voci ghiacciate
ja: 凍てる声の鎧
ru: Доспех Замерших Голосов
uk: Броня застиглих голосів

source: Tunic of Frozen Voices
de: Tunika der gefrorenen Stimmen
it: Tunica delle voci ghiacciate
ja: 凍てる声のチュニック
ru: Туника Замерших Голосов
uk: Туніка застиглих голосів

source: Robe of Frozen Voices
de: Robe der gefrorenen Stimmen
it: Vestaglia delle voci ghiacciate
ja: 凍てる声のローブ
ru: Мантия Замерших Голосов
uk: Мантія застиглих голосів

source: Vest of Frozen Voices
de: Weste der gefrorenen Stimmen
it: Gilè delle voci ghiacciate
ja: 凍てる声のベスト
ru: Одеяние Замерших Голосов
uk: Вбрання застиглих голосів

source: Vest of Kings
de: Weste der Könige
it: Gilè dei Re
ja: キングベスト
ru: Одеяние Королей
uk: Вбрання королів

source: Plate of Timeless Trials
de: Platte der endlosen Proben
it: Piatto delle prove senza tempo
ja: 果てなき試練の鎧
ru: Доспех Вневременного Испытания
uk: Броня вічного випробування

source: Tunic of Timeless Trials
de: Tunika der endlosen Proben
it: Tunica delle prove senza tempo
ja: 果てなき試練のチュニック
ru: Туника Вневременного Испытания
uk: Туніка вічного випробування

source: Robe of Timeless Trials
de: Robe der endlosen Proben
it: Vestaglia delle prove senza tempo
ja: 果てなき試練のローブ
ru: Мантия Вневременного Испытания
uk: Мантія вічного випробування

source: Vest of Timeless Trials
de: Weste der endlosen Proben
it: Gilè delle prove senza tempo
ja: 果てなき試練のベスト
ru: Одеяние Вневременного Испытания
uk: Вбрання вічного випробування

source: Bandits Armor of Trust
de: Banditenrüstung des Vertrauens
it: Armatura di fiducia del bandito
ja: 忠尽くす賊の鎧
ru: Бандитская Броня Доверия
uk: Розбійницька броня довіри

source: Armor of Condemned Glory
de: Rüstung des verurteilten Ruhms
it: Armatura della gloria condannata
ja: 消された栄光の鎧
ru: Броня Утраченной Славы
uk: Броня втраченої слави

source: Plate of Blessed Glory
de: Platte des gesegneten Ruhms
it: Piatto della gloria beata
ja: 祝福されし栄光の胴当て
ru: Доспех Священной Славы
uk: Обладунок священної слави

source: Vest of Blessed Glory
de: Weste des gesegneten Ruhms
it: Gilè della gloria beata
ja: 祝福されし栄光のベスト
ru: Одеяние Священной Славы
uk: Вбрання священної слави

source: Armor of Blessed Glory
de: Rüstung des gesegneten Ruhms
it: Armatura della gloria beata
ja: 祝福されし栄光の鎧
ru: Броня Священной Славы
uk: Броня священної слави

source: Tunic of Blessed Glory
de: Tunika des gesegneten Ruhms
it: Tunica della gloria beata
ja: 祝福されし栄光のチュニック
ru: Туника Священной Славы
uk: Туніка священної слави

source: Armor of Eternal Warlords
de: Rüstung der ewigen Kriegsherren
it: Armatura degli eterni signori della guerra
ja: 朽ちぬ将軍の鎧
ru: Броня Вечных Полководцев
uk: Броня прадавніх полководців

source: Vest of Eternal Warlords
de: Weste der ewigen Kriegsherren
it: Gilè degli eterni signori della guerra
ja: 朽ちぬ将軍のベスト
ru: Одеяние Вечных Полководцев
uk: Вбрання прадавніх полководців

source: Robe of Eternal Warlords
de: Robe der ewigen Kriegsherren
it: Vestaglia degli eterni signori della guerra
ja: 朽ちぬ将軍のローブ
ru: Мантия Вечных Полководцев
uk: Мантія прадавніх полководців

source: Tunic of Eternal Warlords
de: Tunika der ewigen Kriegsherren
it: Tunica degli eterni signori della guerra
ja: 朽ちぬ将軍のチュニック
ru: Туника Вечных Полководцев
uk: Туніка прадавніх полководців

source: Legacy of Might
de: Erbe der Macht
it: Eredità della potenza
ja: レガシーオブマイト
ru: Наследие Могущества
uk: Спадщина могутності

source: Deflector of the Holy
de: Deflektor des Heiligen
it: Deflettore della santità
ja: ホーリーデフレクター
ru: Святой Отражатель
uk: Священий дефлектор

source: Vanquisher Wool Robe
de: Bezwingerswollenrobe
it: Eliminatore della vestaglia di lana
ja: 勝者のウールローブ
ru: Шерстяная Мантия Покорителя
uk: Вовняна мантія завойовника

source: Armor of Distant Visions
de: Rüstung entfernter Visionen
it: Armatura delle visioni distanti
ja: 遠見のローブ
ru: Броня Далёких Видений
uk: Броня далеких візій

source: Peacekeepers Chestguard
de: Brustwächter des Friedenswächters
it: Corsetto del pacificatore
ja: 調停者の胴鎧
ru: Нагрудник Миротворца
uk: Нагрудник миротворця

source: Tunic of the Fallen
de: Tunika der Gefallenen
it: Tunica del caduto
ja: 堕ちた者のチュニック
ru: Туника Падшего
uk: Туніка грішника

source: Reach of Necromancy
de: Reichweite der Nekromantie
it: Raggio della negromanzia
ja: 霊術の魔手
ru: Глас Некромантии
uk: Глас мертвих

source: Tunic of Silent Wars
de: Tunika der stillen Kriege
it: Tunica delle guerre silenziose
ja: 静戦のチュニック
ru: Туника Безмолвных Войн
uk: Туніка мовчазної війни

source: Robe of Fallen Wars
de: Robe der gefallenen Kriege
it: Vestaglia delle guerre silenziose
ja: 堕戦のローブ
ru: Мантия Проигранных Войн
uk: Мантія програних воєн

source: Birth of the Plague
de: Geburt der Pest
it: Nascita della piaga
ja: 厄災を生むもの
ru: Рождение Чумы
uk: Народження чуми

source: Legacy of Enchantments
de: Erbe der Verzauberungen
it: Eredità degli incantesimi
ja: エンチャントレガシー
ru: Наследие Зачарования
uk: Спадщина чар

source: Plate of Hellish Illusions
de: Platte der höllischen Illusionen
it: Piatto delle illusioni infernali
ja: 忌まわしき幻想の胴当て
ru: Доспех Адских Иллюзий
uk: Обладунок пекельних ілюзій

source: Tunic of Hellish Illusions
de: Tunika der höllischen Illusionen
it: Tunica delle illusioni infernali
ja: 忌まわしき幻想のチュニック
ru: Туника Адских Иллюзий
uk: Туніка пекельних ілюзій

source: Armor of Hellish Illusions
de: Rüstung der höllischen Illusionen
it: Armatura delle illusioni infernali
ja: 忌まわしき幻想の鎧
ru: Броня Адских Иллюзий
uk: Броня пекельних ілюзій

source: Warden of Thieves
de: Aufseher der Diebe
it: Guardiano dei ladri
ja: 盗みの達人
ru: Блюститель Воров
uk: Страж злодіїв

source: Vest of Faded Memories
de: Weste der verblassten Erinnerungen
it: Gliè delle memorie sbiadite
ja: 霞む記憶のベスト
ru: Одеяние Ушедших Воспоминаний
uk: Вбрання згасаючих спогадів

source: Tunic of Faded Memories
de: Tunika der verblassten Erinnerungen
it: Tunica delle memorie sbiadite
ja: 霞む記憶のチュニック
ru: Туника Ушедших Воспоминаний
uk: Туніка згасаючих спогадів

source: Plate of Lifestealing
de: Platte des Lebensraubs
it: Piatto della vita rubata
ja: 奪命の胸当て
ru: Доспех Вампиризма
uk: Обладунок вампіризму

source: Tunic of Lifestealing
de: Tunika des Lebensraubs
it: Tunica della vita rubata
ja: 奪命のチュニック
ru: Туника Вампиризма
uk: Туніка вампіризму

source: Linen Demonic Nights
de: Leinendemonische Nächte
it: Notti demoniache di lino
ja: 魔夜の衣
ru: Одеяние Демонической Ночи
uk: Вбрання демонічної ночі

source: Plate of Ominous Comrades
de: Platte der ominösen Kameraden
it: Piatto dei compagni nefasti
ja: 不穏な戦友の胴当て
ru: Доспех Зловещих Товарищей
uk: Обладунок зловісних товаришів

source: Vest of Ominous Comrades
de: Weste der ominösen Kameraden
it: Gilè dei compagni nefasti
ja: 不穏な戦友のベスト
ru: Одеяние Зловещих Товарищей
uk: Вбрання зловісних товаришів

source: Tunic of Ominous Comrades
de: Weste der ominösen Gaukler
it: Gilè dei buffoni nefasti
ja: 不吉な道化師のベスト
ru: Жилет Зловещих Шутов
uk: Жилет Зловісних Блазнів

source: Plate of Shifting Sands
de: Platte der veränderlichen Sände
it: Piatto delle sabbie mobili
ja: 流砂の胴当て
ru: Доспех Зыбучих Песков
uk: Обладунок сипучих пісків

source: Vest of Shifting Sands
de: Weste der veränderlichen Sände
it: Gilè delle sabbie mobili
ja: 流砂のベスト
ru: Одеяние Зыбучих Песков
uk: Вбрання сипучих пісків

source: Tunic of Shifting Sands
de: Tunika der veränderlichen Sände
it: Tunica delle sabbie mobili
ja: 流砂のチュニック
ru: Туника Зыбучих Песков
uk: Туніка сипучих пісків

source: Tunic of Twisted Illusions
de: Tunika der verdrehten Illusionen
it: Tunica delle illusioni agitate
ja: 歪幻のチュニック
ru: Туника Путанных Иллюзий
uk: Туніка плутаних ілюзій

source: Vest of Twisted Illusions
de: Weste der verdrehten Illusionen
it: Gilè delle illusioni agitate
ja: 歪幻のベスト
ru: Одеяние Путанных Иллюзий
uk: Вбрання плутаних ілюзій

source: Plate of Twisted Illusions
de: Platte der verdrehten Illusionen
it: Piatto delle illusioni agitate
ja: 歪幻の胴当て
ru: Доспех Путанных Иллюзий
uk: Обладунок плутаних ілюзій

source: Wraps of Damned Souls
de: Umhänge der verdammten Seelen
it: Scialli delle anime dannate
ja: 呪魂の外套
ru: Палантин Проклятых Душ
uk: Палантин проклятих душ

source: Tunic of the Protector
de: Tunika des Beschützers
it: Tunica del protettore
ja: 守護者のチュニック
ru: Туника Защитника
uk: Туніка покровителя

source: Cataclysmic Tunic
de: Kataklysmische Tunika
it: Tunica devastante
ja: 破滅のチュニック
ru: Туника Катаклизма
uk: Туніка катаклізму

source: Cataclysmic Plate
de: Kataklysmische Platte
it: Piatto devastante
ja: 破滅の胴当て
ru: Доспех Катаклизма
uk: Обладунок катаклізму

source: Cataclysmic Vest
de: Kataklysmische Weste
it: Gilè devastante
ja: 破滅のベスト
ru: Одеяние Катаклизма
uk: Вбрання катаклізму

source: Thundersoul Vest
de: Seelendonner Weste
it: Gilè dell'anima del tuono
ja: 雷魂のベスト
ru: Громоподобное Одеяние
uk: Громоподібне вбрання

source: Thundersoul Tunic
de: Seelendonner Tunika
it: Tunica dell'anima del tuono
ja: 雷魂のチュニック
ru: Громоподобная Туника
uk: Громоподібна туніка

source: Thundersoul Plate
de: Seelendonner Platte
it: Piatto dell'anima del tuono
ja: 雷魂の胴当て
ru: Громоподобный Доспех
uk: Громоподібний обладунок

source: Vest of Holy Protection
de: Weste des heiligen Schutzes
it: Gilè della protezione divina
ja: 聖なる加護のベスト
ru: Одеяние Священной Опеки
uk: Вбрання священної опіки

source: Plate of Holy Protection
de: Platte des heiligen Schutzes
it: Piatto della protezione divina
ja: 聖なる加護の胴当て
ru: Доспех Священной Опеки
uk: Обладунок священної опіки

source: Tunic of Holy Protection
de: Tunika des heiligen Schutzes
it: Tunica della protezione divina
ja: 聖なる加護のチュニック
ru: Туника Священной Опеки
uk: Туніка священної опіки

source: Armor of Shattered Freedom
de: Rüstung der zerbrochenen Freiheit
it: Armatura della libertà frantumata
ja: 砕かれた自由の鎧
ru: Броня Разрушенной Свободы
uk: Броня зруйнованої свободи

source: Tunic of Arcane Magic
de: Tunika der arkanen Magie
it: Tunica della magia arcana
ja: 秘術のチュニック
ru: Туника Рунной Магии
uk: Туніка рунної магії

source: Plate of Arcane Magic
de: Platte der arkanen Magie
it: Piatto della magia arcana
ja: 秘術の胴当て
ru: Доспех Рунной Магии
uk: Обладунок рунної магії

source: Armor of Arcane Magic
de: Rüstung der arkanen Magie
it: Armatura della magia arcana
ja: 秘術の鎧
ru: Броня Рунной Магии
uk: Броня рунної магії

source: Tunic of Phantoms Keeper
de: Tunika der Phantomenbewahrer
it: Tunica del custode dei fantasmi
ja: 覚めぬ幻のチュニック
ru: Туника Хранителя Фантомов
uk: Туніка зберігача фантазмів

source: Vest of Phantoms Keeper
de: Weste der Phantomenbewahrer
it: Gilè del custode dei fantasmi
ja: 覚めぬ幻のベスト
ru: Одеяние Хранителя Фантомов
uk: Вбрання зберігача фантазмів

source: Plate of Phantoms Keeper
de: Platte der Phantomenbewahrer
it: Piatto del custode dei fantasmi
ja: 覚めぬ幻の胴当て
ru: Доспех Хранителя Фантомов
uk: Обладунок зберігача фантазмів

source: Tunic of Distant Ancestors
de: Tunika entfernter Vorfahren
it: Tunica degli antenati distanti
ja: 遠祖のチュニック
ru: Туника Дальних Предков
uk: Туніка далеких предків

source: Robe of Distant Ancestors
de: Robe entfernter Vorfahren
it: Vestaglia degli antenati distanti
ja: 遠祖のローブ
ru: Мантия Дальних Предков
uk: Мантія далеких предків

source: Plate of Distant Ancestors
de: Platte entfernter Vorfahren
it: Piatto degli antenati distanti
ja: 遠祖の胴当て
ru: Доспех Дальних Предков
uk: Обладунок далеких предків

source: Tunic of Ending Nights
de: Tunika der endenden Nächte
it: Tunica delle notti finite
ja: 夜明けのチュニック
ru: Туника Окончания Ночи
uk: Туніка кінця ночі

source: Vest of Ending Nights
de: Weste der endenden Nächte
it: Gilè delle notti finite
ja: 夜明けのベスト
ru: Одеяние Окончания Ночи
uk: Вбрання кінця ночі

source: Plate of Ending Nights
de: Platte der endenden Nächte
it: Piatto delle notti finite
ja: 夜明けの胴当て
ru: Доспех Окончания Ночи
uk: Обладунок кінця ночі

source: Tunic of Divine Torment
de: Tunika der göttlichen Qual
it: Tunica del tormento divino
ja: 神罰のチュニック
ru: Туника Божественных Мук
uk: Туніка божествених мук

source: Vest of Divine Torment
de: Weste der göttlichen Qual
it: Gilè del tormento divino
ja: 神罰のベスト
ru: Одеяние Божественных Мук
uk: Вбрання божествених мук

source: Plate of Divine Torment
de: Platte der göttlichen Qual
it: Piatto del tormento divino
ja: 神罰の胴当て
ru: Доспех Божественных Мук
uk: Обладунок божествених мук

source: Blessing of Shadows
de: Segen der Schatten
it: Benedizione delle ombre
ja: 闇の恵み
ru: Благословение Теней
uk: Благословення тіней

source: Steward of Titans
de: Flugbegleiter der Titanen
it: Assistente dei titani
ja: タイタンスチュワード
ru: Проводник Титанов
uk: Намісник титанів

source: Robe of Imminent Fires
de: Robe der bevorstehenden Feuer
it: Vestaglia dei fuochi imminenti
ja: 迫る炎のローブ
ru: Мантия Неотвратимых Огней
uk: Мантія невідворотного вогню

source: Plate of Imminent Fires
de: Platte der bevorstehenden Feuer
it: Piatto dei fuochi imminenti
ja: 迫る炎の胴当て
ru: Доспех Неотвратимых Огней
uk: Обладунок невідворотного вогню

source: Vest of Imminent Fires
de: Weste der bevorstehenden Feuer
it: Gilè dei fuochi imminenti
ja: 迫る炎のベスト
ru: Одеяние Неотвратимых Огней
uk: Вбрання невідворотного вогню

source: Convergence
de: Konvergenz
it: Convergenza
ja: コンバージェンス
ru: Слияние
uk: Злиття

source: Ghostwalker
de: Geistenwanderer
it: Camminatore fantasma
ja: ゴーストウォーカー
ru: Призрачный Ходок
uk: Примарний ходок

source: Ancient Warden
de: Antiker Wächter
it: Antico guardiano
ja: エンシェントウォーデン
ru: Древний Блюститель
uk: Стародавній наглядач

source: Voice of Reason
de: Stimme der Vernunft
it: Voce della ragione
ja: 道理の声
ru: Голос Разума
uk: Голос розуму

source: Storm
de: Sturm
it: Tempesta
ja: ストーム
ru: Шторм
uk: Шторм

source: Deaths Deflection
de: Todesdeflexion
it: Deviazione della morte
ja: デスデフレクト
ru: Отражение Смерти
uk: Відображення смерті

source: Ragnarok
de: Ragnarök
ja: ラグナロク
ru: Рагнарёк
uk: Рагнарок

source: Nightfall
de: Dämmerung
it: Crepuscolo
ja: 夕闇
ru: Сумерки
uk: Сутінки

source: Vindicator
de: Verteidiger
it: Difensore
ja: ヴィンディケーター
ru: Воздаятель
uk: Поборник

source: Path of Exile
de: Weg des Exils
it: Cammino d'esilio
ja: パスオブエグザイル
ru: Путь Изгнания
uk: Шлях вигнання

source: Path of Exile Plus
de: Weg des Exils+
it: Cammino d'esilio+
ja: パスオブエグザイル+
ru: Путь Изгнания+
uk: Шлях вигнання+

source: Calamity
de: Kalamität
it: Calamità
ja: カラミティ
ru: Бедствие
uk: Катастрофа

source: Steward of Hope
de: Flugbegleiter der Hoffnung
it: Assistente della speranza
ja: 希望抱く者
ru: Проводник Надежды
uk: Провідник надії

source: Peacekeeper
de: Friedenswächter
it: Pacificatore
ja: ピースキーパー
ru: Миротворец
uk: Миротворець

source: Champions Barricade
de: Barrikade des Champions
it: Barriera del campione
ja: 王者の壁
ru: Ограда Чемпионов
uk: Блок чемпіона

source: Glory of the Light
de: Ruhm des Lichts
it: Gloria delle luce
ja: 栄光の光
ru: Слава Света
uk: Тріумф світла

source: Voice of the Covenant
de: Stimme des Bundes
it: Voce dell'alleanza
ja: 誓いの声
ru: Голос Завета
uk: Заповіт

source: Vindicator Guardian
de: Verteidiger Wächter
it: Guardiano difensore
ja: 潔白のガーディアン
ru: Страж Воздаяния
uk: Каратель

source: Undead Ashwood
de: Untoter Eschenholz
it: Cenere dei non morti
ja: アンデッドアッシュ
ru: Нечистая Сила
uk: Нечиста сила

source: Legacy of the Oracle
de: Erbe des Orakels
it: Eredità dell'oracolo
ja: 導きの遺産
ru: Наследие Оракула
uk: Спадщина віщуна

source: Bastion of the Undying
de: Bastion der Unsterblichen
it: Roccaforte dell'immortale
ja: 不死の砦
ru: Бастион Бессмертного
uk: Бастіон безсмертного

source: Wit of Ancient Power
de: Vestand der alten Macht
it: Spirito del potere antico
ja: 古技の知恵
ru: Сила Древнего Разума
uk: Стародавній розум

source: Combustion
de: Verbrennung
it: Combustione
ja: コンバスチョン
ru: Воспламенение
uk: Займання

source: Interrogator
de: Vernehmer
it: Interrogatore
ja: インテロゲーター
ru: Дознаватель
uk: Дізнавач

source: Vengeance Armament
de: Rachenbewaffnung
it: Armamento della vendetta
ja: 復讐の力
ru: Вооружение Возмездия
uk: Знаряддя помсти

source: Reach of Nightmares
de: Reichweite der Albträume
it: Raggio degli incubi
ja: 広がる悪夢
ru: Глас Ночных Кошмаров
uk: Глас нічних кошмарів

source: Whisper of Conquered Worlds
de: Flüstern der eroberten Welten
it: Sussurratore dei mondi conquistati
ja: 奪われし世界の声
ru: Шёпот Порабощённых Миров
uk: Шепіт поневолених світів

source: Barricade of Redemption
de: Barrikade der Erlösung
it: Barriera della redenzione
ja: 償いの壁
ru: Ограда Искупления
uk: Рятівний блок

source: Kings Spectre Tunic
de: Königs Gespenstentunika
it: Tunica spettrale del re
ja: 王霊のチュニック
ru: Туника Призрака Короля
uk: Туніка привиду короля

source: poisonous-item-desc
de: Verursacht zusätzlichen Giftschaden.
it: Infligge danni veleno extra.
ja: 毒による追加ダメージを与える
ru: Наносит дополнительный урон ядом.
uk: Завдає додаткових пошкоджень отрутою.

source: Mooncleaver
de: Mondhackbeil
it: Mannaia lunare
ja: 月裂き
ru: Серповидный топор
uk: Серповидна сокира

source: Barbaric Ravager
de: Barbarischer Verwüster
it: Saccheggiatore barbaro
ja: 慈悲なき破壊斧
ru: Варварский опустошитель
uk: Варварський спустошувач

source: Golden Crescent
de: Goldener Halbmond
it: Mezzaluna dorata
ja: 金色の弦月
ru: Золотой полумесяц
uk: Золотий півмісяць

source: Forsaken Edge
de: Verlassene Schneide
it: Ciglio desolato
ja: 忘れられし刃
ru: Потерянное лезвие
uk: Утрачене лезо

source: Ivory Greataxe
de: Elfenbein-Großaxt
it: Gigantesca asse d'avorio
ja: 象牙の大斧
ru: Секира из слоновой кости
uk: Сокира зі слонової кістки
