Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/items.strings
Languages: de, it, ja, ru, uk

source: Dummy Item
ja: ダミーアイテム
ru: Шаблонный Предмет!

source: Dummy Armor
ja: ダミーの防具
ru: Шаблонная Броня!

source: Dummy Weapon
ja: ダミーの武器
ru: Шаблонное Оружие!

source: Dummy Ring
ja: ダミーの指輪
ru: Шаблонное Кольцо!

source: rune-description
de: Kann zu erdbasierten Gegenständen geschmiedet werden, um deren Kraft zu erhöhen. Der Amboss befindet sich im Laden.
it: Può essere forgiata in oggetti di terra per aumentare il loro potere. L'incudine è nel negozio.
ja: 地属性アイテムの錬成に用い、力を高める 鍛冶場はショップから利用可能
ru: Улучшает снаряжение с Элементом Земли при помощи Наковальни, которая находится в Магазине.
uk: Можна вкувати в предмети з елементом землі, щоб збільшити їх силу. Ковадло розташоване в магазині.

source: iron-key-description
de: Kann verwendet werden, um gewöhnliche Truhen zu öffnen.
it: Può essere usata per aprire i forzieri standard.
ja: 通常のチェストを開けることができる
ru: Используется для открытия обычных сундуков.
uk: Відчиняє звичайні скрині.

source: golden-key-description
de: Kann zum Öffnen gelber Türen verwendet werden.
it: Può essere usata per aprire le porte gialle.
ja: 黄色の扉を開けることができる
ru: Используется для открытия золотых дверей.
uk: Відчиняє жовті двері.

source: blood-key-description
de: Kann zum Öffnen der speziellen roten Türen verwendet werden.
it: Può essere usata per aprire le porte rosse speciali.
ja: 赤色の特別な扉を開けることができる
ru: Используется для открытия кровавых дверей.
uk: Відчиняє особливі червоні двері.

source: air-rune-description
de: Kann zu luftbasierten Gegenständen geschmiedet werden, um deren Kraft zu erhöhen. Der Amboss befindet sich im Laden.
it: Può essere forgiata in oggetti d'aria per aumentare il loro potere. L'incudine è nel negozio.
ja: 風属性アイテムの錬成に用い、力を高める 鍛冶場はショップから利用可能
ru: Улучшает снаряжение с Элементом Воздуха при помощи Наковальни, которая находится в Магазине.
uk: Можна вкувати в предмети з елементом повітря, щоб збільшити їх силу. Ковадло розташоване в магазині.

source: fire-rune-description
de: Kann zu feuerbasierten Gegenständen geschmiedet werden, um deren Kraft zu erhöhen. Der Amboss befindet sich im Laden.
it: Può essere forgiata in oggetti di fuoco per aumentare il loro potere. L'incudine è nel negozio.
ja: 火属性アイテムの錬成に用い、力を高める 鍛冶場はショップから利用可能
ru: Улучшает снаряжение с Элементом Огня при помощи Наковальни, которая находится в Магазине.
uk: Можна вкувати в предмети з елементом вогню, щоб збільшити їх силу. Ковадло розташоване в магазині.

source: light-rune-description
de: Kann zu lichtbasierten Gegenständen geschmiedet werden, um deren Kraft zu erhöhen. Der Amboss befindet sich im Laden.
it: Può essere forgiata in oggetti di luce per aumentare il loro potere. L'incudine è nel negozio.
ja: 光属性アイテムの錬成に用い、力を高める 鍛冶場はショップから利用可能
ru: Улучшает снаряжение с Элементом Света при помощи Наковальни, которая находится в Магазине.
uk: Можна вкувати в предмети з елементом світла, щоб збільшити їх силу. Ковадло розташоване в магазині.

source: purple-rune-description
de: Kann in dunkle Gegenstände geschmiedet werden, um deren Kraft zu erhöhen. Der Amboss befindet sich im Laden.
it: Può essere forgiata in oggetti d'oscurità per aumentare il loro potere. L'incudine è nel negozio.
ja: 闇属性アイテムの錬成に用い、力を高める 鍛冶場はショップから利用可能
ru: Улучшает снаряжение с Элементом Тьмы при помощи Наковальни, которая находится в Магазине.
uk: Можна вкувати в предмети з елементом темряви, щоб збільшити їх силу. Ковадло розташоване в магазині.

source: against-insects
de: Effektiv gegen Spinnen.
it: Efficace contro ragni.
ja: スパイダーに対して有効
ru: Это оружие эффективно против пауков.
uk: Ефективний проти павуків.

source: Supersonic Ring
de: Ultraschallring
it: Anello supersonico
ja: 超音速の指輪
ru: Сверхзвуковое Кольцо
uk: Надзвукове Кільце

source: Recruit Sword
de: Rekrutenschwert
it: Spada da recluta
ja: 新兵の剣
ru: Меч Новобранца
uk: Меч Новобранця

source: Fire Sword
de: Feuerschwert
it: Spada di Fuoco
ja: ファイアソード
ru: Огненный Меч
uk: Вогняний Меч

source: Steel Blade
de: Stahlklinge
it: Lama d'acciaio
ja: 鋼の剣
ru: Стальной Меч
uk: Сталевий Меч

source: Nobel Sword
de: Adligenschwert
it: Spada nobile
ja: 立派な剣
ru: Георгиевский Меч
uk: Вишуканий Меч

source: Pirate Sword
de: Piratenschwert
it: Spada pirata
ja: 海賊の剣
ru: Пиратская Сабля
uk: Меч Пірата

source: Darkskull Sword
de: Nachtschädel-Schwert
it: Spada teschioscuro
ja: ダークスカルソード
ru: Меч Тёмного Черепа
uk: Меч Темного Черепа

source: Fire Staff
de: Feuerstab
it: Bastone di Fuoco
ja: 炎の杖
ru: Посох Огня
uk: Посох Вогню

source: Nature Staff
de: Naturstab
it: Bastone della natura
ja: 大自然の杖
ru: Посох Силы Природы
uk: Посох Сили Природи

source: Staff of Darkness
de: Stab der Dunkelheit
it: Bastone d'Oscurità
ja: ダークスタッフ
ru: Посох Тьмы
uk: Посох Темряви

source: Iron Dagger
de: Eisendolch
it: Pugnale di ferro
ja: 鉄の短剣
ru: Железный Кинжал
uk: Залізний Кинджал

source: Iron Dagger Plus
de: Eisendolch+
it: Pugnale di ferro+
ja: 鉄の短剣+
ru: Железный Кинжал+
uk: Залізний Кинджал+

source: Fire Dagger
de: Feuerdolch
it: Pugnale di Fuoco
ja: ファイアダガー
ru: Огненный Кинжал
uk: Вогняний Кинджал

source: Chef Knife
de: Küchenmesser
it: Coltello da chef
ja: シェフナイフ
ru: Нож Мясника
uk: Обробний Ніж

source: Silver Axe
de: Silberaxt
it: Ascia d'argento
ja: 銀の斧
ru: Серебряный Топор
uk: Срібна Сокира

source: Axe of Fire
de: Axt der Flamme
it: Ascia di Fuoco
ja: 炎の斧
ru: Топор Пламени
uk: Сокира Полум'я

source: Silver Mace
de: Silberkeule
it: Mazza d'argento
ja: シルバーメイス
ru: Серебряная Булава
uk: Срібна Булава

source: Iron Mace
de: Eisenkeule
it: Mazza di ferro
ja: アイアンメイス
ru: Железная Булава
uk: Залізна Булава

source: Master Sword
de: Masterschwert
it: Spada suprema
ja: 主の剣
ru: Меч Мастера
uk: Меч Майстра

source: Minion Vest
de: Vasallenweste
it: Tunica da servo
ja: ミニオンベスト
ru: Одеяние Миньона
uk: Одяг Міньйона

source: Machete
ja: マチェーテ
ru: Мачете
uk: Мачете

source: Wooden Hammer
de: Holzhammer
it: Martello di legno
ja: 木槌
ru: Деревянный Молот
uk: Дерев'яний Молот

source: Warhammer
de: Kriegshammer
it: Martello da guerra
ja: 戦槌
ru: Боевой Молот
uk: Бойовий Молот

source: Bone Chopper
de: Knochenteiler
it: Spezzaossa
ja: ボーンチョッパー
ru: Дробитель Костей
uk: Дробитель Кісток

source: Leaf Sword
de: Blattschwert
it: Spadafoglia
ja: リーフソード
ru: Остролист
uk: Гладіус

source: Vorpal Sword
de: Vorpalklinge
it: Spada bigralace
ja: ヴォーパルソード
ru: Вострый Меч
uk: Стрижаючий Меч

source: Kunai
ja: クナイ
ru: Кунай
uk: Кунай

source: Oxymo's Staff
de: Oxymos Stab
it: Bastone di Oxymo
ja: オクシモの杖
ru: Посох Оксимо
uk: Посох Оксимо

source: Club
de: Knüppel
it: Clava
ja: 棒
ru: Дубина
uk: Дубина

source: Potion
de: Trank
it: Pozione
ja: 回復薬
ru: Лечебное Зелье
uk: Зілля

source: Elite Brass Set
de: Elite-Kupferset
it: Armatura d'ottone élite
ja: エリート真鍮セット
ru: Бронзовый Комплект
uk: Бронзовий Комплект

source: Brass Set
de: Kupferset
it: Armatura d'ottone
ja: 真鍮セット
ru: Медный Комплект
uk: Мідний Комплект

source: Nature Mage Vest
de: Naturmagier-Weste
it: Tun. mago della natura
ja: ネイチャーメイジベスト
ru: Одеяние Мага Природы
uk: Одяг Мага Природи

source: Fire Mage Vest
de: Feuermagier-Weste
it: Tun. da mago di Fuoco
ja: 火炎のメイジベスト
ru: Одеяние Огненного Мага
uk: Одяг Мага Вогню

source: Ifrit's Disciple Robe
de: Ifritjünger-Robe
it: Tun. discepolo di Ifrit
ja: イフリート信奉者のローブ
ru: Мантия Ифрита-ученика
uk: Мантія Іфрита-учня

source: Soldier Set
de: Soldatenset
it: Armatura da soldato
ja: ソルジャーセット
ru: Комплект Солдата
uk: Комплект Солдата

source: Elite Soldier Set
de: Elite-Soldatenset
it: Arm. da soldato élite
ja: エリートソルジャーセット
ru: Элитный Комплект Солдата
uk: Елітний Комплект Солдата

source: Zombie Set
it: Armatura da zombi
ja: ゾンビセット
ru: Комплект Зомби
uk: Комплект Зомбі

source: Recruit Set
de: Rekrutenset
it: Armatura da recluta
ja: 新兵セット
ru: Комплект Новобранца
uk: Комплект Новобранця

source: Cleric Vest
de: Klerikergewand
it: Tunica da chierico
ja: 聖職者のベスト
ru: Одеяние Клирика
uk: Одяг Клірика

source: Druid Vest
de: Druidengewand
it: Tunica da druido
ja: ドルイドのベスト
ru: Одеяние Друида
uk: Одяг Друїда

source: Warlock Vest
de: Hexergewand
it: Tunica da Stregone
ja: ウォーロックのベスト
ru: Одеяние Чернокнижника
uk: Убрання Чорнокнижника

source: Jumpman Suit
de: Jumpman-Anzug
it: Completo da Jumpman
ja: ジャンプマンスーツ
ru: Костюм Джампмэна
uk: Костюм Джампмена

source: Jumpman-Suit-desc
de: Erlaubt dir hohe Sprünge, hat aber geringe Verteidigung. Nicht für den Kampf geeignet.
it: Ti permette di saltare molto in alto, ma ha una difesa piuttosto bassa. Non adatta al combattimento.
ja: ジャンプ力が飛躍的に向上するかわりに防御力が下がる 戦闘には不向き
ru: Позволяет очень высоко прыгать, но имеет слабую защиту. Не подходит для битв.
uk: Дозволяє дуже високо стрибати, але має слабкий захист. Не підходить для битв.

source: Plague Fighter Suit
de: Seuchendoktor-Anzug
it: Completo da guaritore
ja: プレイグファイタースーツ
ru: Костюм Победителя Чумы
uk: Костюм Переможця Чуми

source: Ranger Set
de: Jägerset
it: Armatura da ranger
ja: レンジャーセット
ru: Комплект Рейнджера
uk: Комплект Рейнджера

source: Elite Obsidian Set
it: Arm. d'ossidiana élite
ja: エリート黒曜セット
ru: Улучш. Обсидиановый Комплект
uk: Адамантієвий Комплект

source: Obsidian Set
it: Armatura d'ossidiana
ja: 黒曜セット
ru: Обсидиановый Комплект
uk: Обсидіановий Комплект

source: Hero's Set
de: Heldenset
it: Armatura dell'eroe
ja: ヒーローセット
ru: Комплект Героя
uk: Комплект Героя

source: Hero's Set+
de: Heldenset+
it: Armatura dell'eroe+
ja: ヒーローセット+
ru: Комплект Героя+
uk: Комплект Героя+

source: Umbranian Vest
de: Umbrisches Gewand
it: Tunica delle ombre
ja: アンブラベスト
ru: Одеяние Затмения
uk: Одяг Затемнення

source: Faldang's Vest
de: Faldangs Gewand
it: Tunica di Faldang
ja: ファルダンのベスト
ru: Одеяние Фальданга
uk: Одяг Фальданга

source: Gadarast's Staff
de: Gadarasts Stab
it: Bastone di Gadarast
ja: ガダラストの杖
ru: Посох Гадара
uk: Посох Гадара

source: Light Staff
de: Lichtstab
it: Bastone di Luce
ja: 光の杖
ru: Посох Света
uk: Посох Світла

source: Poisoned Dagger
de: Vergifteter Dolch
it: Pugnale avvelenato
ja: ポイズンダガー
ru: Отравленный Кинжал
uk: Отруєний Кинджал

source: Umbranian Short Sword
de: Umbrisches Kurzschwert
it: Spadino delle ombre
ja: アンブラの短剣
ru: Меч Затмения
uk: Короткий Меч Затемнення

source: Ring of Agility
de: Ring der Agilität
it: Anello dell'agilità
ja: アジリティリング
ru: Кольцо Проворства
uk: Кільце Спритності

source: Shaman Ring
de: Schamanenring
it: Anello da sciamano
ja: シャーマンリング
ru: Кольцо Шамана
uk: Кільце Шамана

source: Thunder Hammer
de: Donnerhammer
it: Marteltuono
ja: 雷鳴の槌
ru: Штормовой Молот
uk: Штормовий Молот

source: Dark Mace
de: Dunkelkeule
it: Mazza oscura
ja: ダークメイス
ru: Булава Тьмы
uk: Булава Темряви

source: Lightning Axe
de: Blitzaxt
it: Ascia fulmine
ja: 稲妻の斧
ru: Топор Молний
uk: Сокира Блискавок

source: Umbranian Cutter
de: Umbrischer Schnitter
it: Tagliaombre
ja: アンブラカッター
ru: Тесак Затмения
uk: Тесак Затемнення

source: Fireskull Sword
de: Feuerschädel-Schwert
it: Spada teschiofuoco
ja: ファイアスカルソード
ru: Меч Огненного Черепа
uk: Меч Вогняного Черепа

source: Wooden Hawaiian
de: Hölzerne Schlappen
it: Hawaiana di legno
ja: ウッドハワイアン
ru: Деревянная Калоша
uk: Дерев'яна Калоша

source: Narya
ja: ナルヤ
ru: Нарья
uk: Нарь'я

source: Nazguh Ring
it: Anello di Nazguh
ja: ナズガーの指輪
ru: Кольцо Назгула
uk: Кільце Назгула

source: Ring of Protection
de: Ring des Schutzes
it: Anello protettivo
ja: 守りの指輪
ru: Кольцо Защиты
uk: Кільце Захисту

source: Umbranian Tanker
de: Umbrisches Bollwerk
it: Elmo delle ombre
ja: アンブラタンカー
ru: Броня Затмения
uk: Броня Затемнення

source: Umbranian Long Sword
de: Umbrisches Langschwert
it: Spadone delle ombre
ja: アンブラの長剣
ru: Истинный Меч Затмения
uk: Довгий Меч Затемнення

source: Cleric Ring
de: Klerikerring
it: Anello da chierico
ja: 聖職者の指輪
ru: Кольцо Клирика
uk: Кільце Клірика

source: Green Rune
de: Erdrune
it: Runa verde
ja: 緑のルーン
ru: Зелёная Руна
uk: Зелена Руна

source: High Elf Robe
de: Hochelfenrobe
it: Tunica da sommo elfo
ja: ハイエルフのローブ
ru: Мантия Высшего Эльфа
uk: Мантія Вищого Ельфа

source: Iron Key
de: Eisenschlüssel
it: Chiave di ferro
ja: 鉄の鍵
ru: Железный Ключ
uk: Залізний ключ

source: Golden Key
de: Goldschlüssel
it: Chiave d'oro
ja: 金の鍵
ru: Золотой Ключ
uk: Золотий ключ

source: Blood Key
de: Blutschlüssel
it: Chiave di sangue
ja: 血塗られた鍵
ru: Кровавый Ключ
uk: Кривавий ключ

source: Death Scythe
de: Todessense
it: Falce mortale
ja: デスサイズ
ru: Коса Смерти
uk: Коса Смерті

source: Death Scythe+
de: Todessense+
it: Falce mortale+
ja: デスサイズ+
ru: Коса Смерти+
uk: Коса Смерті+

source: Spider Crusher
de: Spinnenstampfer
it: Schiacciaragni
ja: スパイダークラッシュ
ru: Крушитель Пауков
uk: Крушитель Павуків

source: Rune of Wind
de: Windrune
it: Runa di vento
ja: 風のルーン
ru: Летучая Руна
uk: Руна Повітря

source: Swordsman's Ring
de: Schwertkämpfer-Ring
it: Anello da spadaccino
ja: 剣士の指輪
ru: Кольцо Мечника
uk: Кільце Мечника

source: Burning Rune
de: Feuerrune
it: Runa rovente
ja: 燃え盛るルーン
ru: Пылающая Руна
uk: Палаюча Руна

source: Anti-hero's Set
de: Antiheldenset
it: Arm. dell'antieroe
ja: アンチヒーローセット
ru: Костюм Убийцы Героев
uk: Костюм Вбивці Героїв

source: Anti-hero's Set B
de: Antiheldenset
it: Arm. dell'antieroe
ja: アンチヒーローセット
ru: Капитанский Костюм Убийцы Героев
uk: Костюм Вбивці Героїв

source: Monk's Tunic
de: Mönchstunika
it: Saio da monaco
ja: 修道士のチュニック
ru: Туника Монаха
uk: Туніка Монаха

source: Shiny Rune
de: Lichtrune
it: Runa lucente
ja: 輝くルーン
ru: Сияющая Руна
uk: Сяйна Руна

source: Bionic Hammer
de: Bionischer Hammer
it: Martello bionico
ja: バイオハンマー
ru: Бионный Молот
uk: Біонний Молот

source: Crow Set
de: Krähenset
it: Armatura da corvo
ja: クロウセット
ru: Комплект Ворона
uk: Комплект Ворона

source: Greenmoon Vest
de: Grünmond-Gewand
it: Tun. della luna verde
ja: グリーンムーンベスト
ru: Одеяние Зелёной Луны
uk: Убрання Зеленої Луни

source: Purple Rune
de: Dunkelrune
it: Runa viola
ja: 紫のルーン
ru: Фиолетовая Руна
uk: Фіолетова Руна

source: Dragon Vest
de: Drachengewand
it: Tunica da drago
ja: ドラゴンベスト
ru: Одеяние Дракона
uk: Одяг Дракона

source: Epic Fire Staff
de: Epischer Feuerstab
it: Bast. di Fuoco epico
ja: 雄大な炎の杖
ru: Эпический Посох Огня
uk: Епічний Посох Вогню

source: Sword of Light
de: Schwert des Lichts
it: Spada di Luce
ja: 光の剣
ru: Меч Света
uk: Меч Світла

source: Dragonskull Staff
de: Drachenschädel-Stab
it: Bastone teschiodrago
ja: ドラゴンスカルスタッフ
ru: Посох Черепа Дракона
uk: Посох Черепа Дракона

source: Dragonskull Staff+
de: Drachenschädel-Stab+
it: Bastone teschiodrago+
ja: ドラゴンスカルスタッフ+
ru: Посох Черепа Дракона+
uk: Посох Черепа Дракона+

source: Penumbra Suit
de: Penumbra-Anzug
it: Completo penombra
ja: 半影の衣
ru: Сумрачное Одеяние
uk: Вбрання Сутінку

source: Penumbra Suit+
de: Penumbra-Anzug+
it: Completo penombra+
ja: 半影の衣+
ru: Сумрачное Одеяние+
uk: Вбрання Сутінку+

source: Dragon Eye Ring
de: Drachenaugen-Ring
it: Anello occhio di drago
ja: 竜眼の指輪
ru: Кольцо с Глазом Дракона
uk: Кільце з Оком Дракона

source: Insect Crusher
de: Insektenvernichter
it: Schiacciainsetti
ja: インセクトクラッシャー
ru: Крушитель Насекомых
uk: Гроза Комах

source: Hippie Dragon Staff
de: Hippiedrachen-Stab
it: Bast. da drago hippy
ja: ヒッピードラゴンスタッフ
ru: Драконий Посох Хиппи
uk: Посох Хіпі

source: Hippie Dragon Staff+
de: Hippiedrachen-Stab+
it: Bast. da drago hippy+
ja: ヒッピードラゴンスタッフ+
ru: Драконий Посох Хиппи+
uk: Посох Хіпі+

source: Sword of 1000 Lies
de: Schwert der 1000 Lügen
it: Spada delle 1000 bugie
ja: 千の矛盾をつく剣
ru: Меч Тысячи Неправд
uk: Меч Тисячі Неправд

source: Spellmaster's Ring
de: Meistermagier-Ring
it: Anello incantato
ja: 呪術名人の指輪
ru: Кольцо Заклинателя
uk: Кільце Заклинателя

source: Improved Jumpman Suit
de: Verbesserter Springeranzug
it: Compl. da Jumpman élite
ja: 改良型ジャンプマンスーツ
ru: Улучшенный Костюм Джампмэна
uk: Покращ. костюм Джампмена

source: Throat Cutter
de: Kehlenschlitzer
it: Tagliagole
ja: ノドキリ
ru: Перерезатель Глоток
uk: Горлоріз

source: Warlock's Ring
de: Ring des Hexers
it: Anello dello Stregone
ja: ウォーロックの指輪
ru: Кольцо Чернокнижника
uk: Кільце Чорнокнижника

source: High Cleric Tunic
de: Hochkleriker-Tunika
it: Tun. da sommo chierico
ja: 聖職者の高級チュニック
ru: Туника Высшего Клирика
uk: Туніка Вищого Клірика

source: Dagger of Sand
de: Dolch der Sande
it: Pugnale di sabbia
ja: 砂牙
ru: Кинжал Песка
uk: Кинджал Піску

source: Moonkeeper Set
de: Mondwächter-Set
it: Arm. da custode lunare
ja: ムーンキーパーセット
ru: Броня Шамана Природы
uk: Броня Хранителя Місяця

source: Undine's Dagger
de: Undines Dolch
it: Pugnale di Ondina
ja: アンダインの短剣
ru: Кинжал Русалки
uk: Кинджал Русалки

source: Liquid Rune
de: Wasserrune
it: Runa liquida
ja: 水のルーン
ru: Текучая Руна
uk: Текуча Руна

source: liquid-rune-description
de: Kann zu wasserbasierten Gegenständen geschmiedet werden, um deren Kraft zu erhöhen. Der Amboss befindet sich im Laden.
it: Può essere forgiata in oggetti d'acqua per aumentare il loro potere. L'incudine è nel negozio.
ja: 水属性アイテムの錬成に用い、力を高める 鍛冶場はショップから利用可能
ru: Улучшает снаряжение с Элементом Воды при помощи Наковальни, которая находится в Магазине.
uk: Можна вкувати в предмети з елементом води, щоб збільшити їх силу. Ковадло розташоване в магазині.

source: Bacoon Set
it: Armatura di Bacoon
ja: バクーンセット
ru: Комплект Бакуна
uk: Комплект Бакуна

source: Bacoon Set+
it: Armatura di Bacoon+
ja: バクーンセット+
ru: Комплект Бакуна+
uk: Комплект Бакуна+

source: Deathdoctor Set
de: Todesdoktor-Set
it: Arm. dott. della morte
ja: デスドクターセット
ru: Комплект Доктора Смерть
uk: Комплект Доктора Смерть

source: Ifrit's Dagger
de: Ifrits Dolch
it: Pugnale di Ifrit
ja: イフリートの短剣
ru: Кинжал Ифрита
uk: Кинджал Іфрита

source: Dragon Orb Staff
de: Drachensphären-Stab
it: Bast. sfera del drago
ja: 竜玉の杖
ru: Посох Сферы Дракона
uk: Посох Сфери Дракона

source: Magicsaber
de: Magieschwert
it: Sciabola laser
ja: マジックセイバー
ru: Светомагический Меч
uk: Світломагічний Меч

source: Nenya
ja: ネンヤ
ru: Ненья
uk: Нень'я

source: Blue Wizard Suit
de: Blauer Zaubereranzug
it: Completo da mago blu
ja: 青魔導士の衣
ru: Одеяние Синего Колдуна
uk: Синій Костюм Чаклуна

source: Ice Claw
de: Eisklaue
it: Artiglio di ghiaccio
ja: アイスクロウ
ru: Ледяной Коготь
uk: Льодяний Кіготь

source: Dark Dagger
de: Schwartzdolch
it: Pugnale d'Oscurità
ja: ダークダガー
ru: Кинжал Тьмы
uk: Кинджал Темряви

source: Dark Dagger+
de: Schwartzdolch+
it: Pugnale d'Oscurità+
ja: ダークダガー+
ru: Кинжал Тьмы+
uk: Кинджал Темряви+

source: Water Staff
de: Wasserstab
it: Bastone d'acqua
ja: 水の杖
ru: Посох Воды
uk: Посох Води

source: Special Dragon Vest
de: Spezial-Drachenweste
it: Tun. da drago speciale
ja: スペシャルドラゴンベスト
ru: Особое Одеяние Дракона
uk: Особливе Вбрання Дракона

source: Special Dragon Vest B
de: Special Dragon Vest
it: Special Dragon Vest
ja: スペシャルドラゴンベスト
ru: Особое Одеяние Дракона Б
uk: Особливе Вбрання Дракона

source: Scarlet Key
de: Scharlachroter Schlüssel
it: Chiave scarlatta
ja: 緋色の鍵
ru: Багряный Ключ
uk: Багряний Ключ

source: Vinas Egg
de: Vinas Ei
it: Uovo di Vina
ja: ヴィナの卵
ru: Яйцо Винэ
uk: Яйце Віне

source: Vina
ja: ヴィナ
ru: Винэ
uk: Віне

source: Lunar Map
de: Mondkarte
it: Mappa lunare
ja: 月の地図
ru: Лунная Карта
uk: Місячна мапа

source: White Pearl Ring
de: Weißer Perlenring
it: Anello perla bianca
ja: ホワイトパールリング
ru: Жемчужное Кольцо
uk: Перлове Кільце

source: Steelblow Ring
de: Stahlstoß-Ring
it: Anello soffio d'acciaio
ja: 鋼撃の指輪
ru: Кольцо Стального Удара
uk: Кільце Сталевого Удару

source: Steelblow Armor
de: Stahlstoß-Rüstung
it: Armat. soffio d'acciaio
ja: 鋼撃の鎧
ru: Броня Стального Удара
uk: Броня Сталевого Удару

source: Steelblow Armor+
de: Stahlstoß-Rüstung+
it: Armat. soffio d'acciaio+
ja: 鋼撃の鎧+
ru: Броня Стального Удара+
uk: Броня Сталевого Удару+

source: Dragon Orb Ring
de: Drachenorb-Ring
it: Anello sfera del drago
ja: 竜玉の指輪
ru: Кольцо Сферы Дракона
uk: Кільце Сфери Дракона

source: Witchdoctor Ring
de: Hexendoktor-Ring
it: Anello da sciamano
ja: ウィッチドクターリング
ru: Кольцо Чумного Доктора
uk: Кільце Чаклуна

source: Golden Dragon Staff
de: Goldener Drachenstab
it: Bastone drago d'oro
ja: 黄金竜の杖
ru: Посох Золотого Дракона
uk: Посох Золотого Дракона

source: Golden Dragon Staff+
de: Goldener Drachenstab+
it: Bastone drago d'oro+
ja: 黄金竜の杖+
ru: Посох Золотого Дракона+
uk: Посох Золотого Дракона+

source: Special Crow Set
de: Spezielles Krähenset
it: Armatura corvo speciale
ja: スペシャルクロウセット
ru: Особый Комплект Ворона
uk: Особливий Комплект Ворона

source: Special Anti-hero Set
de: Spezielles Antiheldenset
it: Arm. antieroe speciale
ja: スペシャルアンチヒーローセット
ru: Костюм Убийцы Чемпионов
uk: Костюм Грози Чемпіонів

source: Special Greenmoon Vest
de: Spezielle Grünmond-Weste
it: Tun. luna verde speciale
ja: スペシャルグリーンムーンベスト
ru: Одеяние Изумрудной Луны
uk: Убрання Смарагдового Місяця

source: Gayan
ja: ガヤン
ru: Легендарный Гаян
uk: Гаян

source: Inquisidor
ja: インクウィジドール
ru: Инквизитор
uk: Інквізитор

source: Champion Set
it: Armatura campione
ja: チャンピオンセット
ru: Комплект Чемпиона
uk: Комплект Чемпіона

source: Fire Lord Set
de: Feuerherr-Set
it: Arm. signore del Fuoco
ja: ファイアロードセット
ru: Комплект Огненного Лорда
uk: Комплект Лорда Вогню

source: Hydrolian Set
de: Hydrolisches Set
it: Armatura hydroliana
ja: ハイドロリアンセット
ru: Комплект Водяного
uk: Комплект Водяного

source: Light Champion Set
de: Champion des Lichts Set
it: Arm. campione di Luce
ja: ピカピカチャンピオンセット
ru: Световой Комплект Чемпиона
uk: Особливий Комплект Світла

source: Dark Lord Set
de: Dunkler Lord Set
it: Arm. signore oscuro
ja: ダークロードセット
ru: Комплект Тёмного Лорда
uk: Комплект Темного Лорда

source: Dark Lord Set+
de: Dunkler Lord Set+
it: Arm. signore oscuro+
ja: ダークロードセット+
ru: Комплект Тёмного Лорда+
uk: Комплект Темного Лорда+

source: Gayan Set
it: Armatura Gayan
ja: ガヤンセット
ru: Комплект Гаяна
uk: Комплект Гаяна

source: lunar-map-desc
de: Enthält geheime Anweisungen, um eine uralte Macht heraufzubeschwören.
it: Contiene istruzioni nascoste che risvegliano un antico potere.
ja: 古代の力を呼び覚ますための、隠された方法が描かれている
ru: Содержит тайные сведения для вызова древних сил.
uk: Містить таємні знання для виклику древніх сил.

source: scarlet-key-desc
de: Öffnet die unzerstörbare scharlachrote Kiste.
it: Apre il magico e indistruttibile forziere scarlatto.
ja: 魔法がかけられた不滅の緋色チェストを開けることができる
ru: Отпирает неразрушимый магический Багряный Сундук.
uk: Відмикає незруйновну магічну багряну скриню.

source: Firestorm Armor
de: Feuersturm-Rüstung
it: Arm. tempesta del Fuoco
ja: 炎風の鎧
ru: Броня Огненного Смерча
uk: Броня Вогняного Смерчу

source: Firestorm Armor+
de: Feuersturm-Rüstung+
it: Arm. tempesta del Fuoco+
ja: 炎風の鎧+
ru: Броня Огненного Смерча+
uk: Броня Вогняного Смерчу+

source: Air Striker
de: Luftschläger
it: Lama dell'Aria
ja: エアストライカー
ru: Воздушный Крушитель
uk: Повітряний Крушитель

source: Bankers Coat
de: Bankiersmantel
it: Giacca da banchiere
ja: 銀行番のコート
ru: Плащ Банкира
uk: Плащ Банкіра

source: Bankers Coat+
de: Bankiersmantel+
it: Giacca da banchiere+
ja: 銀行番のコート+
ru: Плащ Банкира+
uk: Плащ Банкіра+

source: Light Dagger
de: Lichtdolch
it: Pugnale di Luce
ja: 光の短剣
ru: Кинжал Света
uk: Кинджал Світла

source: Fire Pierce
de: Feuerstecher
it: Squarcio di fuoco
ja: ファイアスピア
ru: Огненный Шип
uk: Вогняний Шип

source: Gayan Spear
de: Gayan-Speer
it: Lancia Gayan
ja: ガヤンの槍
ru: Копьё Гаяна
uk: Спис Гаяна

source: Azatoth
ja: アザトス
ru: Перун
uk: Перун

source: Osun
ja: オスン
ru: Семаргл
uk: Семаргл

source: Yansahn
ja: ヤンサン
ru: Хорс
uk: Хорс

source: Freyr
ja: フレイヤ
ru: Велес
uk: Велес

source: Special Dragon Vest C
de: Gorgonenhaut
it: Pelle di Gorgone
ja: ゴルゴンスキン
ru: Кожа Горгоны
uk: Шкіра Горгони

source: Obsidian Spear
de: Obsidianspeer
it: Lancia d'ossidiana
ja: 黒曜槍
ru: Обсидиановое Копьё
uk: Обсидіановий спис

source: Spider Axe
de: Spinnenaxt
it: Aracnoascia
ja: スパイダーアックス
ru: Топор Паука
uk: Сокира Павука

source: Spider Spear
de: Spinnenspeer
it: Aracnolancia
ja: スパイダースピア
ru: Копьё Паука
uk: Спис Павука

source: Gorgon Axe
de: Gorgonenaxt
it: Ascia di Gorgone
ja: ゴルゴンの斧
ru: Секира Горгоны
uk: Сокира Горгони

source: Gorgon Spear
de: Gorgonenspeer
it: Lancia di Gorgone
ja: ゴルゴンの槍
ru: Жало Горгоны
uk: Жало Горгони

source: Cthulhu Axe
de: Cthulhu-Axt
it: Ascia di Cthulhu
ja: クトゥルフの斧
ru: Секира Ктулху
uk: Сокира Ктулху
