Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/items.strings
Languages: de, it, ja, ru, uk

source: Cthulhu Spear
de: Cthulhu-Speer
it: Lancia di Cthulhu
ja: クトゥルフの槍
ru: Шип Ктулху
uk: Шип Ктулху

source: Spider Exoskeleton
de: Spinnen-Exoskelett
it: Esoscheletro di ragno
ja: スパイダーシェル
ru: Экзоскелет Паука
uk: Екзоскелет Павука

source: Liquid Assassin
de: Flüssiger Assassinenanzug
it: Compl. sicario liquido
ja: リキッドアサシン
ru: Водяной Убийца
uk: Безбарвний Костюм Вбивці

source: Purple Assassin
de: Lila Assassinenanzug
it: Compl. sicario viola
ja: パープルアサシン
ru: Пурпурный Убийца
uk: Пурпурний Костюм Вбивці

source: Jungle Assassin
de: Dschungel-Assassinenanzug
it: Compl. sicario giungla
ja: ジャングルアサシン
ru: Камуфляжный Убийца
uk: Камуфляжний Костюм Вбивці

source: Elite Assassin
de: Elite-Assassinenanzug
it: Compl. sicario élite
ja: エリートアサシンスーツ
ru: Элитный Убийца
uk: Елітний Костюм Вбивці

source: Gorgon Dagger
de: Gorgonendolch
it: Pugnale di Gorgone
ja: ゴルゴンの短剣
ru: Кинжал Горгоны
uk: Кинджал Горгони

source: Time Patroller
de: Zeitwächteranzug
it: Compl. tutore del tempo
ja: タイムパトローラースーツ
ru: Комплект Патрульного Времени
uk: Костюм Патруля Часу

source: Portal Mage Vest
de: Portalmagierweste
it: Tun. mago del portale
ja: ポータルメイジベスト
ru: Одеяние Властителя Порталов
uk: Одяг Хранителя Порталу

source: All Seeing Axe
de: Allsehende Axt
it: Ascia onniveggente
ja: 見通す斧
ru: Всевидящий Топор
uk: Всевидюча Сокира

source: Falcon Ring
de: Falkenring
it: Anello del falco
ja: ファルコンリング
ru: Соколиное Кольцо
uk: Соколине Кільце

source: Cursed Amethyst Ring
de: Verfluchter Amethystenring
it: Anello ametista maled.
ja: カースアメシスト
ru: Проклятое Кольцо Аметиста
uk: Аметистове Кільце

source: Verdant Ring
de: Pflanzenring
it: Anello verdeggiante
ja: 草木の指輪
ru: Изумрудное Кольцо
uk: Смарагдове Кільце

source: Volcano Ring
de: Vulkanring
it: Anello vulcano
ja: ボルケーノリング
ru: Магмовое Кольцо
uk: Магмове Кільце

source: Ring of Light
de: Ring des Lichts
it: Anello della luce
ja: 光の指輪
ru: Кольцо Света
uk: Кільце Світла

source: Sea Wave Ring
de: Meereswellenring
it: Anello onda marina
ja: 波風の指輪
ru: Океаническое Кольцо
uk: Океанічне Кільце

source: Dragon Fang Ring
de: Drachenzahnring
it: Anello zanna di drago
ja: 竜牙の指輪
ru: Кольцо Клыка Дракона
uk: Кільце Ікла Дракона

source: Monster Fang Ring
de: Monsterhauerring
it: Anello zanna di mostro
ja: モンスターファング
ru: Кольцо Когтя Монстра
uk: Кільце Кігтя Монстра

source: All Seeing Ring
de: Allsehender Ring
it: Anello onniveggente
ja: 見通す指輪
ru: Всевидящее Кольцо
uk: Всевидяче Кільце

source: Blood Ring
de: Blutring
it: Anello del sangue
ja: ブラッドリング
ru: Кровавое Кольцо
uk: Криваве Кільце

source: Blue Ring
de: Blauer Ring
it: Anello blu
ja: 青の指輪
ru: Голубое Кольцо
uk: Блакитне Кільце

source: Verdant Hammer
de: Pflanzenhammer
it: Martello verdeggiante
ja: 草木の槌
ru: Изумрудный Молот
uk: Смарагдовий Молот

source: Falcon Hammer
de: Falkenhammer
it: Martello del falco
ja: ファルコンハンマー
ru: Соколиный Молот
uk: Соколиний Молот

source: Hammer of Light
de: Hammer des Lichts
it: Martello della luce
ja: 光の槌
ru: Молот Света
uk: Молот Світла

source: Mojaras Hammer
it: Martello di Mojara
ja: モジャーラのハンマー
ru: Молот Моджары
uk: Молот Моджари

source: Volcano Hammer
de: Vulkanhammer
it: Martello vulcano
ja: ボルケーノハンマー
ru: Магмовый Молот
uk: Магмовий Молот

source: Liquid Hammer
de: Flüssiger Hammer
it: Martello liquido
ja: 水のハンマー
ru: Водяной Молот
uk: Водяний Молот

source: Arcane Rune
de: Arkanenrune
it: Runa arcana
ja: アーケインルーン
ru: Руна Тайн
uk: Таємна Руна

source: arcane-rune-description
de: Aktiviert sofort das Spezialtalent.
it: Attiva all'istante l'abilità speciale.
ja: スペシャルアビリティを即時発動できる
ru: Мгновенно активирует Особый Навык класса.
uk: Миттєво активує спеціальне уміння.

source: Water Essence
de: Wasseressenz
it: Essenza d'acqua
ja: 水のエッセンス
ru: Текучая Сущность
uk: Водна сутність

source: Obscure Essence
de: Dunkle Essenz
it: Essenza oscura
ja: 暗闇のエッセンス
ru: Смутная Сущность
uk: Темна сутність

source: Shiny Essence
de: Leuchtende Essenz
it: Essenza luminosa
ja: 光のエッセンス
ru: Сияющая Сущность
uk: Сяйна сутність

source: Life Essence
de: Lebensessenz
it: Essenza di vita
ja: 大地のエッセンス
ru: Живая Сущность
uk: Життєва сутність

source: Fire Essence
de: Feueressenz
it: Essenza di fuoco
ja: 火のエッセンス
ru: Пылающая Сущность
uk: Палаюча сутність

source: Air Essence
de: Luftessenz
it: Essenza d'aria
ja: 風のエッセンス
ru: Летучая Сущность
uk: Летюча сутність

source: essence-description
de: Assigns a magical element into a neutral equipment.
it: Assegna un elemento magico a un equipaggiamento neutrale.
ja: 無属性の装備に魔法属性を付与する
ru: Присваивает нейтральному снаряжению магический Элемент.
uk: Присвоює нейтральному спорядженню магічний елемент.

source: essence-rand-description
de: Assigns a random magical element into a neutral equipment.
it: Assegna un elemento magico casuale a un equipaggiamento neutrale.
ja: 無属性の装備にいずれかの魔法属性を付与する
ru: Присваивает нейтральному снаряжению случайный магический Элемент.
uk: Присвоює нейтральному спорядженню випадковий магічний елемент.

source: water-essence-desc
de: Verwandelt ein neutrales Ausrüstungsteil zu Wasser.
it: Trasforma un equipaggiamento neutrale nell'elemento d'acqua.
ja: 無属性の装備を水属性に変える
ru: Наделяет нейтральное снаряжение Элементом Воды при помощи Наковальни.
uk: Наділяє нейтральне спорядження елементом води.

source: obscure-essence-desc
de: Verwandelt ein neutrales Ausrüstungsteil zu Dunkelheit.
it: Trasforma un equipaggiamento neutrale nell'elemento d'oscurità.
ja: 無属性の装備を闇属性に変える
ru: Наделяет нейтральное снаряжение Элементом Тьмы при помощи Наковальни.
uk: Наділяє нейтральне спорядження елементом темряви.

source: shiny-essence-desc
de: Verwandelt ein neutrales Ausrüstungsteil zu Licht.
it: Trasforma un equipaggiamento neutrale nell'elemento di luce.
ja: 無属性の装備を光属性に変える
ru: Наделяет нейтральное снаряжение Элементом Света при помощи Наковальни.
uk: Наділяє нейтральне спорядження елементом світла.

source: life-essence-desc
de: Verwandelt ein neutrales Ausrüstungsteil zu Erde.
it: Trasforma un equipaggiamento neutrale nell'elemento di terra.
ja: 無属性の装備を地属性に変える
ru: Наделяет нейтральное снаряжение Элементом Земли при помощи Наковальни.
uk: Наділяє нейтральне спорядження елементом землі.

source: fire-essence-desc
de: Verwandelt ein neutrales Ausrüstungsteil zu Feuer.
it: Trasforma un equipaggiamento neutrale nell'elemento di fuoco.
ja: 無属性の装備を火属性に変える
ru: Наделяет нейтральное снаряжение Элементом Огня при помощи Наковальни.
uk: Наділяє нейтральне спорядження елементом вогню.

source: air-essence-desc
de: Verwandelt ein neutrales Ausrüstungsteil zu Luft.
it: Trasforma un equipaggiamento neutrale nell'elemento d'aria.
ja: 無属性の装備を風属性に変える
ru: Наделяет нейтральное снаряжение Элементом Воздуха при помощи Наковальни.
uk: Наділяє нейтральне спорядження елементом повітря.

source: epicHammerDescription
de: Hohe Zerstörungskraft.
it: Ingente forza distruttiva.
ja: 破壊力バツグン
ru: Это оружие обладает огромной разрушительной силой.
uk: Величезна руйнівна сила.

source: potion-desc
de: Stellt Gesundheit bis zu einem Herz wieder her.
it: Recupera salute fino a un pezzo di cuore.
ja: 体力をハート1個分回復する
ru: Это Зелье восстанавливает здоровье на одно сердце.
uk: Відновлює здоров'я на одне серце.

source: lunar-map-desc2
de: Ein legendäres Artefakt, auch als Zeitkompass bekannt.
it: Artefatto leggendario, meglio conosciuto come La bussola del tempo.
ja: 伝説の遺物には「時の羅針盤」の記録も残されている
ru: Легендарный артефакт, также известный как Компас Времени.
uk: Легендарний артефакт, також відомий як Компас часу.

source: Light Spellmaster Suit
de: Licht-Zaubermeisteranzug
it: Tuta maestro di luce
ja: 光の呪術名人スーツ
ru: Костюм Заклинателя Света
uk: Костюм майстра світла

source: Light Piercer
de: Lichtstecher
it: Perforatrice di luce
ja: 光の鋭剣
ru: Световой Пронзатель
uk: Світловий пронизувач

source: pierce-weapon-std-desc
de: Diese Waffe kann Barrieren und Feinde durchbohren.
it: Quest'arma riesce a perforare barriere e nemici.
ja: この武器で攻撃すれば、どんな物も敵も貫ける
ru: Это оружие пронзает барьеры и врагов.
uk: Ця зброя пронизує бар'єри й ворогів.

source: Light Needle
de: Lichtnadel
it: Ago di luce
ja: ホーリーニードル
ru: Световая Игла
uk: Світлова голка

source: Flaming Cutter
de: Flammenschneide
it: Tagliatore fiammante
ja: フレイムカッター
ru: Пламенный Резак
uk: Вогняний різак

source: Death Dagger
de: Todesdolch
it: Pugnale mortale
ja: デスダガー
ru: Кинжал Смерти
uk: Кинджал смерті

source: Gayan Steel
de: Gayanstahl
it: Acciaio di Gayan
ja: ガヤンの鋼
ru: Сталь Гаяна
uk: Сталь Гаяна

source: Flood Ring
de: Flutenring
it: Anello dell'alluvione
ja: 大水の指輪
ru: Кольцо Потопа
uk: Кільце потопу

source: Necromancer Vest
de: Nekromantenweste
it: Abito del negromante
ja: ネクロマンサーベスト
ru: Одеяние Некроманта
uk: Убрання некроманта

source: Jungle Master
de: Dschungelmeister
it: Maestro della giungla
ja: ジャングルマスター
ru: Хозяин Джунглей
uk: Головний єгер

source: Blue Spellmaster
de: Blauer Zaubermeister
it: Maestro degli incantesimi blu
ja: 青の呪術名人
ru: Синий Чародей
uk: Синій маг

source: Unknown Item
de: Unbekannter Gegenstand
it: Oggetto sconosciuto
ja: 謎のアイテム
ru: Неизвестный Предмет!
uk: Невідомий предмет

source: Unknown Weapon
de: Unbekannte Waffe
it: Arma sconosciuta
ja: 謎の武器
ru: Неизвестное Оружие!
uk: Невідома зброя

source: Unknown Armor
de: Unbekannte Rüstung
it: Armatura sconosciuta
ja: 謎の防具
ru: Неизвестная Броня!
uk: Невідома броня

source: Unknown Artifact
de: Unbekanntes Artefakt
it: Manufatto sconosciuto
ja: 謎の遺物
ru: Неизвестный Артефакт!
uk: Невідомий артефакт

source: unknown-item-desc
de: Dieser Gegenstand ist nicht verfügbar. Stelle sicher, dass du die neueste Version des Spiels verwendest und prüfe deine Internetverbindung.
it: Questo oggetto non è disponibile. Assicurati di stare usando l'ultima versione del gioco e verifica la tua connessione Internet.
ja: 利用できないアイテムです ゲームが最新バージョンになっているか、インターネット接続は正常に行われているかをご確認ください
ru: Снаряжение недоступно. Убедитесь, что у Вас установлена последняя версия игры и перезайдите в учётную запись.
uk: Цей предмет недоступний. Переконайтеся, що у вас встановлена остання версія гри, й перевірте інтернет-з'єднання.

source: Steel Dagger
de: Stahldolch
it: Pugnale d'acciaio
ja: 鋼の短剣
ru: Стальной Кинжал
uk: Сталевий кинджал

source: Cthulhu Staff
de: Cthulhu-Stab
it: Bastone di Cthulhu
ja: クトゥルフの杖
ru: Посох Ктулху
uk: Посох Ктулху

source: Steel Axe
de: Stahlaxt
it: Ascia d'acciaio
ja: 鋼の斧
ru: Стальной Топор
uk: Сталева сокира

source: Ancient Stone Staff
de: Alter Steinstab
it: Bastone di pietra antico
ja: 古代の石杖
ru: Древний Каменный Посох
uk: Стародавній скам'янілий посох

source: Dark Piercer
de: Dunkler Stichel
it: Perforatrice oscura
ja: 闇の鋭剣
ru: Тёмный Пронзатель
uk: Темний пронизувач

source: Fire Glass Piercer
de: Feuerglasdorn
it: Perforatrice di fuoco e ghiaccio
ja: 火玻璃の鋭剣
ru: Раскалённый Пронзатель
uk: Пронизувач із лавового каменя

source: Air Piercer
de: Luftstecher
it: Perforatrice d'aria
ja: 風の鋭剣
ru: Воздушный Пронзатель
uk: Повітряний пронизувач

source: Metal Piercer
de: Metallstichel
it: Perforatrice di metallo
ja: 合金の鋭剣
ru: Стальной Пронзатель
uk: Металевий пронизувач

source: Glass Blade
de: Glasklinge
it: Lama di vetro
ja: ガラスブレード
ru: Стеклянный Клинок
uk: Скляне лезо

source: Bit Axe
de: Bitaxt
it: Ascia retro
ja: ビットアックス
ru: 8-мибитный Топор
uk: Піксель-сокира

source: Bit Dagger
de: Bitdolch
it: Pugnale retro
ja: ビットダガー
ru: 8-мибитный Кинжал
uk: Піксель-кинджал

source: Bit Staff
de: Bitstab
it: Bastone retro
ja: ビットスタッフ
ru: 8-мибитный Посох
uk: Піксель-посох

source: Bit Sword
de: Bitschwert
it: Spada retro
ja: ビットソード
ru: 8-мибитный Меч
uk: Піксель-меч

source: Epic Bit Sword
de: Episches Bitschwert
it: Spada retro epica
ja: エピックビットソード
ru: Эпический 8-мибитный Меч
uk: Епічний піксель-меч

source: Bit Mace
de: Bitmorgenstern
it: Mazza ferrata retro
ja: ビットメイス
ru: 8-мибитная Булава
uk: Піксель-булава

source: Bit Spear
de: Bitspeer
it: Lancia retro
ja: ビットスピア
ru: 8-мибитное Копьё
uk: Піксель-спис

source: Bone Axe
de: Knochenaxt
it: Ascia d'osso
ja: ボーンアックス
ru: Костяной Топор
uk: Костяна сокира

source: Dragon Tooth Dagger
de: Drachenzahndolch
it: Pugnale di dente di drago
ja: 竜歯の短剣
ru: Кинжал Зуба Дракона
uk: Кинджал із зуба дракона

source: Dual Dragon Fang
de: Doppeldrachenzahn
it: Zanna di drago doppia
ja: 竜の双牙
ru: Двойной Клык Дракона
uk: Подвійне ікло дракона

source: Bone Mace
de: Knochenmorgenstern
it: Mazza ferrata d'osso
ja: ボーンメイス
ru: Костяная Булава
uk: Костяна булава

source: Bone Ring
de: Knochenring
it: Anello d'osso
ja: ボーンリング
ru: Костяное Кольцо
uk: Костяне кільце

source: Bone Spear
de: Knochenspeer
it: Lancia retro d'osso
ja: ボーンスピア
ru: Костяное Копьё
uk: Костяний спис

source: Dead Vulture
de: Totgeierstab
it: Bastone d'avvoltoio morto
ja: 死鷲の杖
ru: Посох Мёртвого Ястреба
uk: Посох мертвого яструба

source: Spinal Sword
de: Wirbelsäulenschwert
it: Spada spinale
ja: スパインソード
ru: Хребтовый Меч
uk: Хребтовий меч

source: Bone Blade
de: Knochenklinge
it: Lama d'osso
ja: ボーンブレード
ru: Костяной Клинок
uk: Костяний меч

source: Toxic Axe
de: Giftaxt
it: Ascia tossica
ja: トキシックアックス
ru: Токсичный Топор
uk: Токсична сокира

source: Toxic Dual Dagger
de: Giftiger Doppeldolch
it: Doppio pugnale tossico
ja: トキシックデュアル
ru: Двойной Токсичный Кинжал
uk: Токсичний подвійний кинджал

source: Venomous Dagger
de: Giftdolch
it: Pugnale avvelenato
ja: ヴェノムダガー
ru: Ядовитый Кинжал
uk: Отруйний кинджал

source: Toxic Hammer
de: Gifthammer
it: Martello tossico
ja: トキシックハンマー
ru: Токсичный Молот
uk: Токсичний молот

source: Venomous Ring
de: Giftring
it: Anello avvelenato
ja: ヴェノムリング
ru: Ядовитое Кольцо
uk: Отруйне кільце

source: Poisoned Spear
de: Vergifteter Speer
it: Lancia avvelenata
ja: ポイズンスピア
ru: Отравленное Копьё
uk: Отруйний спис

source: Toxic Staff
de: Giftstab
it: Bastone tossico
ja: トキシックスタッフ
ru: Токсичный Посох
uk: Токсичний посох

source: Poisoned Sword
de: Vergiftetes Schwert
it: Spada avvelenata
ja: ポイズンソード
ru: Отравленный Меч
uk: Отруйний меч

source: Poisoned Blade
de: Vergiftete Klinge
it: Lama avvelenata
ja: ポイズンブレード
ru: Отравленный Клинок
uk: Отруйний клинок

source: Fire Moonkeeper Set
de: Feuermondwächterset
it: Set del guardiano della luna di fuoco
ja: 火のムーンキーパーセット
ru: Броня Огненного Шамана
uk: Вогняний комплект Хранителя

source: Arcane Mage Suit
de: Obskures Magierkostüm
it: Abito del mago arcano
ja: 神秘の魔法使いスーツ
ru: Одеяние Рунного Мага
uk: Убрання рунного мага

source: Swamp Ranger Suit
de: Sumpfhüterkostüm
it: Abito del ranger della palude
ja: スワンプレンジャースーツ
ru: Костюм Болотного Рейнджера
uk: Костюм болотного рейнджера

source: Desert Rogue Suit
de: Wüstenschurkenkostüm
it: Abito del malvivente del deserto
ja: サンドローグスーツ
ru: Комплект Песчаного Разбойника
uk: Костюм розбійника з пустелі

source: Broom Staff
de: Besenstab
it: Bastone della scopa.
ja: 箒の杖
ru: Волшебная Метла
uk: Помело відьми

source: Witch Dress
de: Hexenkleid
it: Vestito della strega.
ja: ウィッチドレス
ru: Платье Ведьмы
uk: Плаття відьми

source: Purple Witch Dress
de: Violettes Hexenkleid
it: Vestito della strega viola.
ja: 紫のウィッチスーツ
ru: Пурпурное Платье Ведьмы
uk: Пурпурне плаття відьми

source: Green Witch Dress
de: Grünes Hexenkleid
it: Vestito della strega verde.
ja: 緑のウィッチスーツ
ru: Зелёное Платье Ведьмы
uk: Зелене плаття відьми

source: Red Witch Dress
de: Rotes Hexenkleid
it: Vestito della strega rosso.
ja: 赤のウィッチスーツ
ru: Красное Платье Ведьмы
uk: Червона плаття відьми

source: White Witch Dress
de: Weißes Hexenkleid
it: Vestito della strega bianco.
ja: 白のウィッチスーツ
ru: Белое Платье Ведьмы
uk: Біле плаття відьми

source: Blue Witch Dress
de: Blaues Hexenkleid
it: Vestito della strega blu.
ja: 青のウィッチスーツ
ru: Синее Платье Ведьмы
uk: Синє плаття відьми

source: Swamp Witch Dress
de: Sumpfhexenkleid
it: Vestito della strega della palude.
ja: 沼沢のウィッチスーツ
ru: Платье Болотной Ведьмы
uk: Плаття болотної відьми

source: Forest Witch Dress
de: Waldhexenkleid
it: Vestito della strega della foresta.
ja: 森のウィッチスーツ
ru: Платье Дремучей Ведьмы
uk: Плаття лісової відьми

source: Fire Witch Dress
de: Feuerhexenkleid
it: Vestito della strega del fuoco.
ja: 火のウィッチスーツ
ru: Платье Ведьмы Огня
uk: Плаття вогняної відьми

source: Black Witch Dress
de: Schwarzes Hexenkleid
it: Vestito della strega nero.
ja: 黒のウィッチスーツ
ru: Тёмное Платье Ведьмы
uk: Чорне плаття відьми

source: Yellow Witch Dress
de: Gelbes Hexenkleid
it: Vestito della strega giallo.
ja: 黄色のウィッチスーツ
ru: Жёлтое Платье Ведьмы
uk: Жовте плаття відьми

source: Lighting Witch Dress
de: Blitzhexenkleid
it: Vestito della strega della luminosità.
ja: ライティングウィッチスーツ
ru: Платье Ведьмы Молний
uk: Плаття відьми блискавок

source: Light Witch Dress
de: Lichthexenkleid
it: Vestito della strega della luce.
ja: 光のウィッチスーツ
ru: Платье Ведьмы Света
uk: Плаття відьми світла

source: Wind Witch Dress
de: Windhexenkleid
it: Vestito della strega del vento.
ja: 風のウィッチスーツ
ru: Платье Ведьмы Ветра
uk: Плаття відьми вітру

source: Desert Witch Dress
de: Wüstenhexenkleid
it: Vestito della strega del deserto.
ja: 砂のウィッチスーツ
ru: Платье Ведьмы Пустынь
uk: Плаття відьми пустелі

source: Gorgon Blade
de: Gorgonenklinge
it: Lama della Gorgone.
ja: ゴルゴンブレード
ru: Клинок Горгоны
uk: Клинок Горгони

source: Cthulhu Blade
de: Cthulhu-Klinge
it: Lama di Cthulhu.
ja: クトゥルフの刃
ru: Меч Ктулху
uk: Клинок Ктулху

source: Cthulhu Dagger
de: Cthulhu-Dolch
it: Pugnale di Cthulhu.
ja: クトゥルフの短剣
ru: Кинжал Ктулху
uk: Кинджал Ктулху

source: Bone Hammer
de: Knochenhammer
it: Martello d'ossa.
ja: ボーンハンマー
ru: Костяной Молот
uk: Кістяний молот

source: Toxic Mace
de: Giftkeule
it: Mazza ferrata tossica.
ja: トキシックメイス
ru: Токсичная Булава
uk: Токсична булава

source: Iron Widow
de: Eiserne Witwe
it: Vedova di ferro
ja: アイアンウィドウ
ru: Стальная Вдова
uk: Залізна вдова

source: Cait
it: Gait
ja: ケット
ru: Кот Баюн
uk: Кіт Баюн

source: Camazotz
ja: カマソッツ
ru: Камазотц
uk: Камазотц

source: Cuteulhu
de: Süßulhu
it: Carinulhu
ja: キュントゥルフ
ru: Мимитулху
uk: Мімітулху

source: Spektator
it: Osservatore
ja: スペクテイター
ru: Наблюдатель
uk: Шипоок

source: cait-desc
de: Beschwört eine geisterhafte Katze.
it: Evoca un gatto spettrale.
ja: 猫の幽霊を召喚する
ru: Призывает призрачного кота, любимца любой ведьмы.
uk: Викликає примарного кота.

source: cuteulhu-desc
de: Beschwört eine kosmische Einheit.
it: Evoca un'entità cosmica.
ja: この世のものと思えない生物を召喚する
ru: Призывает существо из космоса.
uk: Викликає космічну істоту.

source: spektator-desc
de: Beschwört eine schwebende Kugel aus Stacheln.
it: Evoca una sfera fluttuante di spuntoni.
ja: トゲだらけの浮遊球体を召喚する
ru: Призывает летающее создание с острыми шипами.
uk: Викликає левітуючу в повітрі шипасту кулю.

source: Cait B
de: Cait
it: Gait
ja: ケット
ru: Кейт
uk: Кіт Баюн

source: cait-desc-b
de: Beschwört eine geisterhafte Katze.
it: Evoca un gatto spettrale.
ja: 猫の幽霊を召喚する
ru: Призывает спектральную кошку. Как Вы её получили?
uk: Викликає примарного кота.

source: Bunny Suit
de: Hasenanzug
it: Vestito del coniglietto
ja: バニースーツ
ru: Костюм Кролика
uk: Костюм кролика

source: Bunny Ring
de: Hasenring
it: Anello del coniglietto
ja: バニーリング
ru: Кроличье Кольцо
uk: Кільце кролика

source: Bunny Sword
de: Hasenschwert
it: Spada del coniglietto
ja: バニーソード
ru: Кроличий Меч
uk: Меч кролика

source: Bunny Spear
de: Hasenspeer
it: Lancia del coniglietto
ja: バニースピア
ru: Кроличье Копьё
uk: Спис кролика

source: Worship Mantle
de: Verehrungsmantel
it: Mantello d'adorazione
ja: 信奉者の外套
ru: Мантия Почтения
uk: Мантія окультисти

source: Enchanted Mantle
de: Verzauberter Mantel
it: Mantello incantato
ja: 魔の外套
ru: Зачарованная Мантия
uk: Зачарована мантія

source: Annihilation Mantle
de: Vernichtungsmantel
it: Mantello d'annientamento
ja: 滅するマント
ru: Мантия Истребления
uk: Мантія винищення

source: Mantle of Fortune
de: Mantel des Glücks
it: Mantello della fortuna
ja: 幸運のマント
ru: Мантия Удачи
uk: Мантія щасливчика

source: Judgement Jewel
de: Urteilsjuwel
it: Gioiello del giudizio
ja: 審判の宝石
ru: Камень Правосудия
uk: Судний камінь

source: Plate of Endless Powers
de: Platte der endlosen Kräfte
it: Piatto dei poteri infiniti
ja: 無尽の鎧
ru: Доспех Бесконечной Энергии
uk: Броня могутності

source: Armor of Haunted Kings
de: Rüstung der Spukkönige
it: Armatura dei Re spettrali
ja: 憑かれた王の鎧
ru: Броня Призрачных Королей
uk: Обладунок проклятого

source: Tunic of the Relentless
de: Tunika der Unerbittlichen
it: Tunica inarrestabile
ja: 無慈悲のチュニック
ru: Туника Неумолимого
uk: Мундир непохитності

source: Warden of Demons
de: Aufseher der Dämonen
it: Guardiano dei demoni
ja: デーモンの番人
ru: Блюститель Демонов
uk: Вартовий демонів

source: Robe of Eternal Light
de: Robe des ewigen Lichts
it: Toga della luce eterna
ja: 絶えぬ光のローブ
ru: Мантия Вечного Света
uk: Убрання вічного світла

source: Robe of Eternal Fire
de: Robe des ewigen Feuers
it: Toga del fuoco eterno
ja: 絶えぬ火のローブ
ru: Мантия Вечного Огня
uk: Убрання вічного вогню

source: Robe of Eternal Life
de: Robe des ewigen Lebens
it: Toga della vita eterna
ja: 絶えぬ生命のローブ
ru: Мантия Вечной Жизни
uk: Убрання вічного життя

source: Robe of Eternal Darkness
de: Robe der ewigen Dunkelheit
it: Toga dell'oscurità eterna
ja: 絶えぬ闇のローブ
ru: Мантия Вечной Тьмы
uk: Убрання вічної темряви

source: Protector of the Oracle
de: Beschützer des Orakels
it: Protettore dell'oracolo
ja: 導きの守護者
ru: Защитник-Оракул
uk: Захист віщуна

source: Corrupted Cuirass
de: Verderbter Kürass
it: Corazza corrotta
ja: 堕落せし胴鎧
ru: Осквернённая Кираса
uk: Заражена кіраса

source: Tunic of Distant Fires
de: Tunika ferner Feuer
it: Tunica dei fuochi lontani
ja: 延焼のチュニック
ru: Туника Дальнего Огня
uk: Мундир далекого полум'я

source: Banished Cloth Vestment
de: Verbanntes Stoffgewand
it: Veste di stoffa bandita
ja: 破れ布の外衣
ru: Облачение Изгнанника
uk: Убрання вигнанця

source: Tunic of Doomed Magic
de: Tunika der verdammten Magie
it: Tunica della magia dannata
ja: 破滅魔法のチュニック
ru: Туника Обречённой Магии
uk: Мундир приреченого

source: Plate of Infinite Might
de: Platte der unendlichen Macht
it: Piatto della potenza infinita
ja: 力枯れぬ鎧
ru: Доспех Нескончаемого Могущества
uk: Броня безмежної сили

source: Tunic of Infinite Might
de: Tunika der unendlichen Macht
it: Tunica della potenza infinita
ja: 力枯れぬチュニック
ru: Туника Нескончаемого Могущества
uk: Мундир безмежної сили

source: Robe of Infinite Might
de: Robe der unendlichen Macht
it: Toga della potenza infinita
ja: 力枯れぬローブ
ru: Мантия Нескончаемого Могущества
uk: Убрання безмежної сили

source: Tunic of Faded Worlds
de: Tunika der verblassten Welten
it: Tunica dei mondi sbiaditi
ja: 色あせた世のチュニック
ru: Туника Ушедших Миров
uk: Мундир згаслого світу

source: Chestpiece of Carnage
de: Bruststück des Gemetzels
it: Corpetto della carneficina
ja: 殺りくの胸当て
ru: Нагрудник Мясоруба
uk: Нагрудник м'ясника

source: Tunic of Endless Justice
de: Tunika der endlosen Gerechtigkeit
it: Tunica della giustizia infinita
ja: 終わらぬ正義のチュニック
ru: Туника Бесконечного Правосудия
uk: Мундир правосуддя

source: Plate of Endless Justice
de: Platte der endlosen Gerechtigkeit
it: Piatto della giustizia infinita
ja: 終わらぬ正義の鎧
ru: Доспех Бесконечного Правосудия
uk: Броня правосуддя

source: Steel of Eternity
de: Stahl der Ewigkeit
it: Acciaio dell'eternità
ja: 不滅の鋼
ru: Сталь Вечности
uk: Сталь вічності

source: Necrolight
de: Nekrolicht
it: Necroluce
ja: ネクロライト
ru: Мертвосвет
uk: Некротичне світло

source: Dawnlight
de: Licht der Dämmerung
it: Albaluce
ja: ドーンライト
ru: Заресвет
uk: Світло зорі

source: Vengeance Cudgel
de: Rachenknüppel
it: Randello della vendetta
ja: 復讐の棍棒
ru: Палица Отмщения
uk: Палиця помсти

source: Darkbane
de: Dunkler Fluch
it: Tormento oscuro
ja: 闇の種
ru: Тёмнояд
uk: Темне прокляття

source: Firebane
de: Feuerfluch
it: Tormento di fuoco
ja: 火の種
ru: Огнеяд
uk: Вогняне прокляття

source: Windbane
de: Windfluch
it: Tormento di vento
ja: 風の種
ru: Ветрояд
uk: Повітряне прокляття

source: Seabane
de: Seefluch
it: Tormento di mare
ja: 水の種
ru: Водояд
uk: Морське прокляття

source: Sword of the Void
de: Schwert der Leere
it: Spada del vuoto
ja: 虚空の剣
ru: Меч Бездны
uk: Меч безодні

source: Spear of the Void
de: Speer der Leere
it: Lancia del vuoto
ja: 虚空の槍
ru: Копьё Бездны
uk: Спис безодні
