Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/skin-names.strings
Languages: de, fr, it, ja, pt, ru, tr, uk

# skin-mage18
source: Runeseer Apprentice
de: Runenseher-Lehrling
fr: Apprenti prophète runique
it: Apprendista veggente di rune
ja: ルーン見習い
pt: Aprendiz Rúnica
ru: Подмастерье чтеца рун
uk: Підмайстер читця рун

# skin-paladin18
source: Radiant Sentinel
de: Strahlender Wächter
fr: Sentinelle éclatante
it: Sentinella radiosa
ja: 輝ける守護者
pt: Sentinela Radiante
ru: Лучезарный страж
uk: Осяйний страж

# skin-priest18
source: Moon Oracle
de: Mondorakel
fr: Oracle de la lune
it: Oracolo lunare
ja: 月の神託者
pt: Oráculo da Lua
ru: Лунный оракул
uk: Місячний оракул

# skin-ranger18
source: Moonbraid Tracker
de: Mondzopf-Jäger
fr: Pisteur à la tresse lunaire
it: Seguace della luna intrecciata
ja: 月編み髪の追跡者
pt: Batedora Trança Lunar
ru: Луннокосый следопыт
uk: Місячнокосий слідопит

# skin-rogue18
source: Silent Ribbon
de: Stilles Band
fr: Ruban silencieux
it: Nastro silenzioso
ja: 無言のリボン
pt: Fita Silenciosa
ru: Лента безмолвия
uk: Стрічка безмовності

# skin-thief18
source: Shadowstep Lass
de: Schattenschritt-Mädchen
fr: Fille des ombres
it: Ragazza dai passi ombrosi
ja: 影歩きの娘
pt: Sombra Ladina
ru: Сумеречная поступь
uk: Сутінкова хода

# skin-warlock18
source: Whisperhorn Enchantress
de: Flüsterhorn-Zauberin
fr: Enchanteresse aux cornes murmurantes
it: Incantatrice dal corno sussurrante
ja: 囁き角の魔女
pt: Feiticeira Chifre Sussurrante
ru: Чаровница-шептунья
uk: Чарівниця-шептуха

# skin-warrior18
source: Bladestorm Huntress
de: Klingensturm-Jägerin
fr: Chasseresse de la tempête de lames
it: Cacciatrice dalla lama tempestosa
ja: 刃嵐の狩人
pt: Caçadora Tempestade de Lâminas
ru: Охотница шторма клинков
uk: Мисливиця урагану клинків

# skin-witchdoctor18
source: Mystic Chanter
de: Mystischer Sänger
fr: Choriste mystique
it: Cantore mistico
ja: 神秘の詠唱者
pt: Cantora Mística
ru: Шаман-мистик
uk: Шаман-містик

# skin-black-mage19
source: Twilight Witch
de: Zwielichthexe
pt: Bruxa do Crepúsculo

# skin-druid19
source: Scarfang
de: Narbenfang
pt: Presa da Cicatriz

# skin-elite-warrior19
source: Crowned Legionnaire
de: Gekrönter Legionär
pt: Legionário Coroado

# skin-high-mage19
source: Candle Enchantress
de: Kerzenzauberin
pt: Encantadora da Vela

# skin-mage19
source: Plumed Pyromancer
de: Gefiederter Pyromant
pt: Piromante Plumado

# skin-paladin19
source: Halo Warden
de: Lichtwächter
pt: Guardião do Halo

# skin-priest19
source: Horned Oracle
de: Gehorntes Orakel
pt: Oráculo Cornífero

# skin-ranger19
source: Mindlock Ranger
de: Gedankenschloss Ranger
pt: Patrulheiro Trancamente

# skin-rogue19
source: Deadly Darling
de: Tödliche Lieblinge
pt: Queridinha Mortal

# skin-thief19
source: Masked Trickster
de: Maskierter Betrüger
pt: Trapaceiro Mascarado

# skin-warlock19
source: Hellbound Hexer
de: Höllengebundener Hexer
pt: Bruxo Amaldiçoado

# skin-warrior19
source: Titanic Crown Breaker
de: Titanischer Kronenbrecher
pt: Partedor de Coroas Titânico

# skin-witchdoctor19
source: Spirit Vessel
de: Geistergefäß
pt: Vaso Espiritual

# skin-rogue4
source: Cait Ninja
fr: Ninja Cait
it: Ninja Gait
ja: ケットニンジャ
ru: Ниндзя Кайт
tr: Saf Ninja
uk: Ніндзя Кайт

# skin-warrior4
source: Kabuto
ja: ザ・カブト
ru: Кабуто
tr: Askeri Kask
uk: Кабуто
