Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/skin-names.strings
Languages: de, fr, it, ja, pt, ru, tr, uk

source: Outcast Mage Hood
de: Kapuze des ausgestoßenen Magiers
fr: Capuche du mage rejeté
it: Cappa del mago emarginato
ja: 浮浪メイジの頭巾
pt: Capuz do Mago Pária
ru: Капюшон отверженного мага
tr: Dışlanmış Büyücünün Başlığı
uk: Капюшон знедоленого мага

source: Renegade Mage Hood
de: Kapuze des abtrünnigen Magiers
fr: Capuche du mage renégat
it: Cappa del mago rinnegato
ja: 反逆メイジの頭巾
pt: Capuz do Mago Renegado
ru: Капюшон мага-предателя
tr: Hain Büyücünün Başlığı
uk: Капюшон мага-зрадника

source: Ancient Druid Mask
de: Alte Druidenmaske
fr: Masque du druide ancien
it: Maschera dell'antico druido
ja: 古きドルイドの面
pt: Máscara de Druida Ancestral
ru: Маска древнего друида
tr: Antik Druid Maskesi
uk: Маска стародавнього друїда

source: Relentless Druid Helm
de: Unerbittlicher Druidenhelm
fr: Casque du druide acharné
it: Elmo dell'inarrestabile druido
ja: 残忍なるドルイドの兜
pt: Elmo Druida Implacável
ru: Шлем безжалостного друида
tr: Acımasız Druid Miğferi
uk: Шолом безжалісного друїда

source: Dark Knight Helm
de: Helm des dunklen Ritters
fr: Casque du chevalier noir
it: Elmo del cavaliere nero
ja: ダークナイトの兜
pt: Elmo do Cavaleiro das Trevas
ru: Шлем тёмного рыцаря
tr: Kara Şovalye Miğferi
uk: Шолом темного лицаря

source: Renegade Knight Helm
de: Helm des abtrünnigen Ritters
fr: Casque du chevalier renégat
it: Elmo del cavaliere rinnegato
ja: 型破りナイトの兜
pt: Elmo de Cavaleiro Renegado
ru: Шлем бесчестного рыцаря
tr: Hain Şovalye Miğferi
uk: Шолом безчесного лицаря

source: Forest Mage Hat
de: Hut des Waldmagiers
fr: Chapeau du mage des forêts
it: Copricapo del mago della foresta
ja: 森のメイジハット
pt: Chapéu de Mago da Floresta
ru: Шляпа лесного волхва
tr: Orman Büyücüsü Şapkası
uk: Капелюх лісового волхва

source: Swamp Mage Hat
de: Hut des Sumpfmagiers
fr: Chapeau du mage des marais
it: Copricapo del mago della palude
ja: 沼地のメイジハット
pt: Chapéu de Mago do Pântano
ru: Шляпа трясинного волхва
tr: Bataklık Büyücüsü Şapkası
uk: Капелюх трясинного волхва

source: Desert Mage Hat
de: Hut des Wüstenmagiers
fr: Chapeau du mage du désert
it: Copricapo del mago del deserto
ja: 砂漠のメイジハット
pt: Chapéu de Mago do Deserto
ru: Шляпа пустынного волхва
tr: Çöl Büyücüsü Şapkası
uk: Капелюх пустельного волхва

source: Smoky Mage Hat
de: Rauchiger Magierhut
fr: Chapeau du mage des fumées
it: Copricapo del mago fumoso
ja: スモークメイジハット
pt: Chapéu de Mago Esfumaçado
ru: Шляпа туманного волхва
tr: Dumanlı Büyücü Şapkası
uk: Капелюх туманного волхва

source: Light Knight Helm
de: Helm des Lichtritters
fr: Casque léger de chevalier
it: Elmo del cavaliere della luce
ja: 光騎士の兜
pt: Elmo do Cavaleiro da Luz
ru: Шлем рыцаря света
tr: Işık Şovalyesi Miğferi
uk: Шолом лицаря світла

source: Justice Knight Helm
de: Gerechtigkeitsritter Helm
fr: Casque du chevalier de la justice
it: Elmo del cavaliere della giustizia
ja: 正義貫くナイトの兜
pt: Elmo do Cavaleiro da Justiça
ru: Шлем рыцаря правосудия
tr: Adalet Şovalyesi Miğferi
uk: Шолом лицаря правосуддя

source: White Bishop Mitra
de: Mitra des weißen Bischofs
fr: Mitre de l'évêque blanc
it: Mitra del vescovo bianco
ja: 司教の白頭巾
pt: Mitra do Bispo Alabastrino
ru: Колпак белого епископа
tr: Beyaz Piskopos Mitrası
uk: Ковпак білого єпископа

source: White Prophet Keffiyeh
de: Weiße Prophetenkufiya
fr: Keffieh du prophète blanc
it: Kefiah del profeta bianco
ja: 預言者の白カフィエ
pt: Keffiyeh do Profeta Alabastrino
ru: Арафатка белого пророка
tr: Beyaz Peygamber Keffiyesi
uk: Арафатка білого пророка

source: Deserter Ranger Helm
de: Helm des desertierenden Rangers
fr: Casque du Ranger déserteur
it: Elmo del ranger disertore
ja: 逃亡レンジャーの兜
pt: Elmo de Patrulheiro Desertor
ru: Шлем рейнджера-дезертира
tr: Kaçak Asker Korucu Miğferi
uk: Шолом рейнджера-дезертира

source: Outcast Ranger Helm
de: Helm des ausgestoßenen Rangers
fr: Casque du Ranger rejeté
it: Elmo del ranger emarginato
ja: はぐれレンジャーヘルム
pt: Elmo de Patrulheiro Pária
ru: Шлем рейнджера-изгнанника
tr: Dışlanmış Korucu Miğferi
uk: Шолом рейнджера-вигнанця

source: Fine Rogue Hat
de: Feiner Schurkenhut
fr: Chapeau du voyou raffiné
it: Copricapo del gran furfante
ja: 一人前ローグの帽子
pt: Chapéu do Ladino Fino
ru: Качественная шапка разбойника
tr: Kıyak Haydut Şapkası
uk: Якісна шапка розбійника

source: Galant Rogue Hat
de: Galanter Schurkenhut
fr: Chapeau du voyou galant
it: Copricapo del furfante galante
ja: ギャラントローグハット
pt: Chapéu do Ladino Galante
ru: Изящная шапка разбойника
tr: Cesur Haydut Şapkası
uk: Витончена шапка розбійника

source: Black Ninja Hood
de: Schwarze Ninja-Kapuze
fr: Capuche du ninja noir
it: Copricapo del ninja nero
ja: ブラックニンジャ
pt: Capuz do Ninja Soturno
ru: Капюшон чёрного ниндзи
tr: Kara Ninja Başlığı
uk: Капюшон чорного ніндзі

source: Desert Ninja Hood
de: Kapuze der Wüsten-Ninja
fr: Capuche du ninja du désert
it: Cappa del ninja del deserto
ja: 砂忍帽
pt: Capuz do Ninja do Deserto
ru: Капюшон пустынного ниндзи
tr: Çöl Ninjası Başlığı
uk: Капюшон пустельного ніндзі

source: Cursed Warlock Hood
de: Verfluchte Hexenmeister-Kapuze
fr: Capuche du sorcier maudit
it: Cappa dello stregone maledetto
ja: ウォーロックの呪帽
pt: Capuz do Bruxo Amaldiçoado
ru: Капюшон проклятого чернокнижника
tr: Lanetli Büyücü Başlığı
uk: Капюшон проклятого чаклуна

source: Monstrous Warlock Hood
de: Monströse Hexenmeister-Kapuze
fr: Capuche du sorcier monstrueux
it: Cappa dello stregone mostruoso
ja: 怪物ウォーロックの頭巾
pt: Capuz do Bruxo Monstruoso
ru: Капюшон ужасного чернокнижника
tr: Korkunç Büyücü Başlığı
uk: Капюшон жахливого чаклуна

source: Mighty Fighter Helm
de: Mächtiger Kämpferhelm
fr: Casque du puissant combattant
it: Elmo del potente combattente
ja: 強者の兜
pt: Elmo do Lutador Poderoso
ru: Шлем ратоборца
tr: Kutsal Dövüşçü Başlığı
uk: Шолом ратоборця

source: Gladiator Helm
de: Gladiatorenhelm
fr: Casque du gladiateur
it: Elmo del gladiatore
ja: 剣闘士の兜
pt: Elmo do Gladiador
ru: Шлем гладиатора
tr: Gladyatör Miğferi
uk: Шолом гладіатора

source: Arcane Witchdoctor Mask
de: Maske des arkanen Hexendoktors
fr: Masque de l'enchanteur des arcanes
it: Maschera dell'arcano sciamano
ja: ウィッチドクターの秘面
pt: Máscara de Feiticeiro Arcano
ru: Маска рунного колдуна
tr: Gizemli Cadı Doktor Maskesi
uk: Маска рунного чаклуна

source: Umbranian Doctor Mask
de: Umbrische Arztmaske
fr: Masque du docteur Umbranien
it: Maschera del medico umbranio
ja: アンブラドクターマスク
pt: Máscara de Médico Umbraniano
ru: Маска доктора Затмения
tr: Umbri Doktor Maskesi
uk: Маска доктора Затемнення

# skin-black-mage3
source: Red Orb hat
de: Roter Kugelhut
fr: Chapeau de l'orbe rouge
it: Cappello sferico rosso
ja: レッドオーブハット
pt: Chapéu da Orbe Vermelha
ru: Красная шляпа
tr: Kızıl Küre Şapkası
uk: Червоний капелюх

# skin-druid3
source: Maskarade nature sorceress
de: Maskerade-Naturzauberin
fr: Sorcière de la nature Maskarade
it: Maga della natura mascherata
ja: 仮面舞踏の魔術師
pt: Feiticeira mascarada da natureza
ru: Одеяние чародейки природы
tr: Doğal maskeli balo büyücüsü
uk: Вбрання чарівниці природи

# skin-elite-warrior3
source: Berserker helmet
de: Berserkerhelm
fr: Casque du Berserker
it: Elmo del berserker
ja: バーサーカーヘルム
pt: Capacete Berserker
ru: Шлем берсерка
tr: Vahşi Miğfer
uk: Шолом берсерка

# skin-high-mage3
source: High sorceress
de: Hohe Zauberin
fr: Haute sorcière
it: Strega potente
ja: 上級魔術師
pt: Alta feiticeira
ru: Верховная колдунья
tr: Yüce Büyücü
uk: Верховна чаклунка

# skin-mage3
source: Wildfire hat
de: Wildfire-Hut
fr: Chapeau du feu de forêt
it: Cappello selvaggio
ja: ファ・イヤーハット
pt: Chapéu selvagem ígneo
ru: Шляпа дикого пламени
tr: Orman yangını Şapkası
uk: Капелюх дикого полум'я

# skin-paladin3
source: Light Champion's helmet
de: Helm des Lichtchampions
fr: Casque du Champion de lumière
it: Elmo del campione della luce
ja: 輝く覇者の兜
pt: Capacete de Campeão da Luz
ru: Лёгкий шлем чемпиона
tr: Hafif Şampiyon Kaskı
uk: Легкий шолом чемпіона

# skin-priest3
source: High Priestess helm
de: Helm der Hohepriesterin
fr: Casque de la Haute prêtresse
it: Elmo della sacerdotessa potente
ja: 上級神官の兜
pt: Elmo da Alta Sacerdotisa
ru: Шлем верховной жрицы
tr: Yüksek Rahibe Miğferi
uk: Шолом верховної жриці

# skin-ranger3
source: Official bonete
de: Offizielle Bonete
fr: Bonnet officiel
it: Berretto dell'ufficiale
ja: オフィシャルボネ
pt: Bonete oficial
ru: Бонет
tr: Resmi Bere
uk: Бонет

# skin-rogue3
source: Crescent morion
de: Halbmondmorion
fr: Morion du croissant
it: Morione mezzaluna
ja: 三日月のモリオン
pt: Morion crescente
ru: Серповидный морион
tr: Hilal Kaskı
uk: Серповидний моріон

# skin-thief3
source: Rascal's hat
de: Rascals Hut
fr: Chapeau du gredin
it: Cappello del briccone
ja: ラスカルハット
pt: Chapéu do malandro
ru: Шляпа плута
tr: Serseri Şapkası
uk: Капелюх плута

# skin-warlock3
source: Demon Joker mask
de: Dämonische Joker-Maske
fr: Masque du Joker démoniaque
it: Maschera da burlone demoniaco
ja: デーモンジョーカー
pt: Máscara do Coringa Demônio
ru: Маска демона-шута
tr: Şeytani Şakacı şapkası
uk: Маска демона-шута

# skin-warrior3
source: Valkyrie helmet
de: Walkürenhelm
fr: Casque de Valkyrie
it: Elmo della valchiria
ja: ヴァルキュリアヘルム
pt: Capacete de Valquíria
ru: Шлем валькирии
tr: Valkür Kaskı
uk: Шолом валькірії

# skin-witchdoctor3
source: Owldoctor mask
de: Eulenarzt-Maske
fr: Masque du Docteur Hibou
it: Maschera del dottor gufo
ja: オウルドクターマスク
pt: Máscara Doutor Coruja
ru: Маска доктора-совы
tr: Baykuş Doktor Maskesi
uk: Маска лікаря-сови

# skin-black-mage4
source: Malicious Witch
de: Bösartige Hexe
fr: Méchante sorcière
it: Strega maliziosa
ja: イジワルウィッチ
pt: Bruxa malévola
ru: Злобная ведьма
tr: Kötü niyetli cadı
uk: Зла відьма

# skin-druid4
source: Shamanic mask
de: Schamanische Maske
fr: Masque chamanique
it: Maschera sciamanica
ja: シャーマンマスク
pt: Máscara xamânica
ru: Шаманская маска
tr: Şaman Maskesi
uk: Шаманська маска

# skin-elite-warrior4
source: Dark Warlord
de: Dunkler Kriegsherr
fr: Seigneur de guerre noir
it: Condottiero oscuro
ja: 闇の将軍
pt: Senhor da Guerra Sombrio
ru: Тёмный полководец
tr: Karanlık Savaşustası
uk: Темний полководець

# skin-high-mage4
source: Arcane High Mage
de: Arkaner Hochmagier
fr: Haut mage des arcanes
it: Mago potente arcano
ja: 神秘のハイメイジ
pt: Alto Mago Arcano
ru: Высший маг арканы
tr: Gizemli Aziz Büyücü
uk: Вищий маг аркани

# skin-mage4
source: Fire starter
fr: Allume-feu
it: Piromane
ja: ファイアスターター
pt: Iniciador de fogo
ru: Поджигатель
tr: Ateş getiren
uk: Підпалювач

# skin-paladin4
source: Archangel helmet
de: Helm des Erzengels
fr: Casque d'Archange
it: Elmo dell'arcangelo
ja: 大天使の兜
pt: Capacete de arcanjo
ru: Шлем архангела
tr: Başmelek asası
uk: Шолом архангела

# skin-priest4
source: Mitra of Silence
de: Mitra der Stille
fr: Mitre du silence
it: Mitra del silenzio
ja: 静寂の頭巾
pt: Mitra do Silêncio
ru: Митра безмолвия
tr: Sessizlik Mitrası
uk: Мітра німоті

# skin-ranger4
source: Helm of Silent Torment
de: Helm der stillen Qual
fr: Casque du supplice silencieux
it: Elmo della tormenta silenziosa
ja: 黙痛の兜
pt: Elmo do Tormento Silencioso
ru: Шлем молчаливых мучений
tr: Sessiz İşkencenin Kaskı
uk: Шолом мовчазних мук

# skin-thief4
source: Mercenary facemask
de: Söldner-Gesichtsmaske
fr: Masque du mercenaire
it: Maschera mercenaria
ja: 傭兵の面
pt: Máscara de mercenário
ru: Маска наёмника
tr: Paralı askerin yüz maskesi
uk: Маска найманця

# skin-warlock4
source: Horncrown
de: Hornkrone
fr: Couronne à cornes
it: Corona cornuta
ja: ホーンクラウン
pt: Coroa guampa
ru: Роговая корона
tr: Boynuzlu Taç
uk: Рогова корона

# skin-witchdoctor4
source: Witchdoctor coif
de: Hexendoktor-Haube
fr: Coiffe du sorcier
it: Cuffia del dottore stregato
ja: ウィッチドクターコイフ
pt: Touca de feiticeira
ru: Койф колдуна
tr: Cadıdoktorunun maskesi
uk: Койф чаклуна

# skin-black-mage5
source: Shadow Wrapped
de: Schattenwickel
fr: Enveloppe de ténèbres
it: Bende ombrose
ja: 闇に包まれし者
pt: Bandagens sombrias
ru: Мумия призрака
tr: Gölgeye Sarıl
uk: Мумія примари

# skin-druid5
source: Feral Fury
de: Wilde Wut
fr: Fureur sauvage
it: Furia morbidosa
ja: 貫かれた怒り
pt: Fúria Feral
ru: Ярость леса
tr: Vahşi Öfke
uk: Лють лісу

# skin-elite-warrior5
source: Ironclad Infantry
de: Gepanzerte Infanterie
fr: Infanterie blindée
it: Fanteria corazzata
ja: 甲鉄兵
pt: Infantaria Blindada
ru: Железнолобая пехота
tr: Zırhlı Piyade
uk: Залізолоба піхота

# skin-high-mage5
source: Emerald Sage
de: Smaragd-Weiser
fr: Sage d'émeraude
it: Saggezza verde
ja: 翠の賢人
pt: Sábio Esmeralda
ru: Изумрудный мудрец
tr: Zümrüt Bilge
uk: Смарагдовий мудрець

# skin-mage5
source: Blazing Bejeweled
de: Flammender Juwelier
fr: Parure de bijoux flamboyante
it: Turbante ingioiellato
ja: 輝石の頭巾
pt: Artífice das jóias flamejantes
ru: Пылающий рубин
tr: Yanan Mücevher
uk: Палаючий рубін

# skin-paladin5
source: Heavenly Herald
de: Himmelsbote
fr: Héraut céleste
it: Foriero celestiale
ja: ヘブンヘラルド
pt: Arauto Celestial
ru: Вестник небес
tr: İlahi Haberci
uk: Вісник небес

# skin-priest5
source: Interdimensional Inquisitor
de: Interdimensionaler Inquisitor
fr: Inquisiteur interdimensionnel
it: Inquisitore interdimensionale
ja: 超次元の探究者
pt: Inquisidor Interdimensional
ru: Потусторонний инквизитор
tr: Boyutlararası Engizitör
uk: Потойбічний інквізитор

# skin-ranger5
source: Broken Renegade
de: Gebrochener Abtrünniger
fr: Renégat brisé
it: Disertore distrutto
ja: 壊れかけの反逆者
pt: Renegado Partido
ru: Сломленный ренегат
tr: Kırık Hain
uk: Зломлений ренегат

# skin-rogue5
source: Crimson Corsair
de: Purpurer Korsar
fr: Corsaire pourpre
it: Corsaro cremisi
ja: 真紅の賊
pt: Corsário Carmesim
ru: Малиновый корсар
tr: Kızıl Korsan
uk: Малиновий корсар

# skin-thief5
source: Daring Daredevil
de: Kühner Draufgänger
fr: Casse-cou audacieux
it: Temerario temibile
ja: デア・デアデビル
pt: Temerário Bandoleiro
ru: Отважный сорвиголова
tr: Gözüpek Savaşçı
uk: Відважний відчайдух

# skin-warlock5
source: Tongued Tormentor
de: Zungenquäler
fr: Bourreau à la langue bien pendue
it: Linguaccia loca
ja: タングトーメント
pt: Voz do Castigo
ru: Рогатый мучитель
tr: Dilli İşkenceci
uk: Рогатий мучитель

# skin-warrior5
source: Scarlet Sentinel
de: Scharlachroter Wächter
fr: Sentinelle écarlate
it: Sentinella scarlatta
ja: 緋色の衛兵
pt: Sentinela Escarlate
ru: Алый страж
tr: Kızıl Gözcü
uk: Багряний страж

# skin-witchdoctor5
source: Macabre Medicine Man
de: Makaberer Medizinmann
fr: Médecin macabre
it: Medico macabro
ja: 猟奇の薬師
pt: Curandeiro Macabro
ru: Жуткий лекарь
tr: Ölümcül Şifacı
uk: Моторошний лікар

# skin-black-mage6
source: Haunted Marionette
de: Spukmarionette
it: Marionetta terrorizzata
ja: 憑依のマリオネット
pt: Marionete Assombrada
ru: Призрачная марионетка
tr: Lanetli Kukla
uk: Примарна маріонетка

# skin-druid6
source: Web-Weaving Witch
de: Netzwebende Hexe
it: Strega di ragnatele
ja: ウェブウィーブウィッチ
pt: Feiticeira Teia-Tecelã
ru: Ведьма в паутине
tr: Ağ Dokuyan Cadı
uk: Відьма в павутині

# skin-elite-warrior6
source: White Oni
de: Weißer Oni
it: Oni bianca
ja: 白鬼
pt: Oni Branco
ru: Белый Они
tr: Beyaz Şeytan
uk: Білий Оні

# skin-high-mage6
source: Rose Quartz Mage
de: Rosenquarz-Magier
it: Maga con quarzo rosa
ja: 紅水晶の魔術師
pt: Mago Quartzo-Rosa
ru: Мастер розового кварца
tr: Gül Kuvars Büyücüsü
uk: Майстер рожевого кварцу

# skin-mage6
source: Ignition Illusionist
de: Zündillusionist
it: Illusionista luminoso
ja: イグナイトイリュージョン
pt: Ilusionista da Ignição
ru: Иллюзионист-поджигатель
tr: Ateşleme İllüzyonisti
uk: Ілюзіоніст-підпалювач

# skin-paladin6
source: Handmaid's Redemption
de: Erlösung der Magd
it: Domestica redenta
ja: 小間使いの償い
pt: Redenção da Aia
ru: Искупление служанки
tr: Hizmetçinin Kefareti
uk: Спокута служниці

# skin-priest6
source: Shamanic Prophet
de: Schamanischer Prophet
it: Profeta sciamanico
ja: シャーマンの預言
pt: Profeta Xamânico
ru: Пророк-шаман
tr: Şamanik Kâhin
uk: Пророк-шаман

# skin-ranger6
source: Silver-Plated Scout
de: Versilberter Pfadfinder
it: Guardia placcata in argento
ja: 銀鎧の偵察兵
pt: Batedor de Prata
ru: Серебряный разведчик
tr: Gümüş Kaplanmış İzci
uk: Срібний розвідник

# skin-rogue6
source: Scarlet Cloaked Rogue
de: Scharlachrot verhüllter Schurke
it: Furfante dal cappuccio scarlatto
ja: 緋覆のローグ
pt: Ladino Escarlate Encapuzado
ru: Бродяга в алом плаще
tr: Kızıl Pelerinli Haydutu
uk: Волоцюга в червоному плащі

# skin-thief6
source: Flamingo Bandit
it: Bandito con piuma di fenicottero
ja: フラミンゴシーフ
pt: Bandido Flamingo
ru: Бандит-фламинго
tr: Flamingo Haydutu
uk: Бандит-фламінго

# skin-warlock6
source: Red-Horned Reaper
de: Rothörniger Schnitter
it: Mietitore unicorno
ja: 赤角の死神
pt: Ceifador das Astas Escarlates
ru: Краснорогий жнец
tr: Kızıl Boynuzlu Azrail
uk: Червонорогий жнець

# skin-warrior6
source: Yokai Warrior
de: Yokai-Krieger
it: Guerriero Yokai
ja: 妖戦士
pt: Guerreiro Yokai
ru: Воин йокай
tr: Yokai Savaşçısı
uk: Воїн йокай

# skin-witchdoctor6
source: Crowned Spirit Summoner
de: Gekrönter Geisterbeschwörer
it: Convocatore degli spiriti fasciato
ja: 冠魂の召喚士
pt: Invocador de Espíritos Coroado
ru: Коронованный призыватель духов
tr: Taçlı Ruh Çağırıcısı
uk: Коронований закликач духів

# skin-black-mage7
source: Scarlet Shroud Arcanist
de: Scharlachroter Schleier-Arkanist
fr: Arcaniste au voile écarlate
it: Velo scarlatto dell'arcano
ja: 紅屍衣の極人
pt: Arcanista da Mortalha Escarlate
ru: Арканист Алого савана
tr: Gizemli Kızıl Kefen
uk: Арканіст Пурпурового савану

# skin-druid7
source: Wildmane Primal Druid
de: Wildmähnen-Urdruide
fr: Druide primitif sauvage
it: Chioma selvaggia del druido
ja: プライマル・ワイルドルイド
pt: Druida Juba Selvagem
ru: Первобытный друид
tr: İlkel Druid'in Yaban Yelesi
uk: Первісний друїд

# skin-elite-warrior7
source: Brass Vanguard Centurion
de: Messing-Avantgarde-Zenturio
fr: Centurion d'avant-garde cuivré
it: Elmo d'ottone del centurione
ja: 黄銅色の衛兵隊長
pt: Centurião da Vanguarda de Bronze
ru: Медный центурион
tr: Öncü Yüzbaşı'nın Pirinç Kaskı
uk: Мідний центуріон

# skin-high-mage7
source: Amethyst Starfall Adept
de: Amethyst-Sternenfall-Adept
fr: Adepte de la chute des étoiles améthyste
it: Stella cadente d'ametista per esperti
ja: アメシスト色の星見人
pt: Adepta Estelacadente Ametista
ru: Адепт звездного дождя
tr: Usta'nın Yıldızlı Şapkası
uk: Адепт зоряного дощу

# skin-mage7
source: Sunfire Adept
de: Sonnenfeuer-Adept
fr: Adepte du feu solaire
it: Copricapo solare per esperti
ja: 陽光の恵み
pt: Adepto Fogo-Solar
ru: Адепт солнечного пламени
tr: Usta'nın Gün Ateşi Şapkası
uk: Адепт сонячного полум’я

# skin-paladin7
source: Sunforged Halo Knight
de: Sonnengeschmiedeter Halo-Ritter
fr: Chevalier à l'auréole forgée par le soleil
it: Aureola solare per cavalieri
ja: 陽輪の騎士
pt: Cavaleiro do Halo Solar
ru: Рыцарь солнечного ореола
tr: Şovalye'nin Güneşgörmüş Halesi
uk: Лицар сонячного ореолу

# skin-priest7
source: Golden Skull Oracle
de: Goldener Schädel-Orakel
fr: Oracle du crâne doré
it: Teschio dorato dell'oracolo
ja: 黄金どくろの神使
pt: Oráculo Caveira Dourada
ru: Оракул золотого черепа
tr: Kahin'in Altın Kafatası
uk: Оракул золотого черепа

# skin-ranger7
source: Argonaut Guardian
de: Argonautenwächter
fr: Gardien argonaute
it: Guardiano argonauta
ja: アルゴーの守護者
pt: Guardião Argonauta
ru: Страж Аргонавтов
tr: Argonot Koruyucu
uk: Страж Аргонавтів

# skin-rogue7
source: White Shroud Phantom
de: Weißes Schleierphantom
fr: Fantôme au voile blanc
it: Velo bianco spettrale
ja: 白布のファントム
pt: Fantasma da Mortalha Branca
ru: Призрак в белом саване
tr: Hayaletin Beyaz Örtüsü
uk: Привид у білому савані

# skin-thief7
source: Joker Pickpocket
de: Joker-Taschendieb
fr: Pickpocket Joker
it: Maschera del giullare ladruncolo
ja: ジョーカーシーフ
pt: Trombadinha fanfarrão
ru: Шут-карманник
tr: Yankesici Şakacı Şapkası
uk: Блазень-мийник

# skin-warlock7
source: Abyssal Triclops Warlock
de: Abgründiger Triclops-Hexenmeister
fr: Sorcier abyssal à 3 yeux
it: Stregone degli abissi
ja: 深淵のトライクロプス
pt: Bruxo Triclope Abissal
ru: Трехглазый адский чернокнижник
tr: Karabüyücü'nün Üçgözlü Uçurum Şapkası
uk: Трьохокий пекельний чорнокнижник

# skin-warrior7
source: Skeletal Spike Soldier
de: Skelett-Stachelsoldat
fr: Soldat squelettique à crête
it: Spuntoni scheletrici del soldato
ja: 棘骨の兵士
pt: Soldado Esqueleto-Afiado
ru: Шипастый воин-скелет
tr: Asker'in Dikenli Kafatası
uk: Шипастий воїн-скелет

# skin-witchdoctor7
source: Golden Laurel Healer
de: Goldener Lorbeer-Heiler
fr: Guérisseur au laurier doré
it: Alloro dorato del guaritore
ja: 金月桂の癒者
pt: Curandeiro Louro Dourado
ru: Целитель золотого лавра
tr: Şifacı'nın Altın Defnesi
uk: Цілитель золотого лавра

# skin-black-mage8
source: Abyssal Cultist Cowl
de: Abgründige Kultisten-Kapuze
fr: Capuchon du fidèle abyssal
it: Scaldacollo del seguace abissale
ja: 底知れぬ信者のカウル
pt: Capuz do Cultista Abissal
ru: Капюшон адского культиста
tr: Dipsiz Tarikatçı Kavuğu
uk: Каптур пекельного культиста

# skin-druid8
source: Harvest Guardian
de: Erntewächter
fr: Gardien des moissons
it: Guardiano del raccolto
ja: 豊穣の守り人
pt: Guardião da Colheita
ru: Хранитель урожая
tr: Hasat Muhafızı
uk: Хранитель урожаю

# skin-elite-warrior8
source: Crowned Warlord Mane
de: Gekrönte Kriegsherrenmähne
fr: Crinière de Seigneur de guerre couronné
it: Criniera del condottiero incoronato
ja: タテガミウォーロード
pt: Senhor da Guerra Coroado
ru: Венценосная грива воина
tr: Taçlı Savaş Lordu
uk: Вінценосна грива воїна

# skin-high-mage8
source: Astral Starburst Magus
de: Astraler Sternenexplosion-Magus
fr: Mage des étoiles astrales rayonnantes
it: Mago astrale stellare
ja: 星夜の魔術師
pt: Mago Estelar Astral
ru: Маг астральной вспышки
tr: Astral Yıldız Patlaması Kostümü
uk: Маг астрального спалаху

# skin-mage8
source: Pyro-Commander
de: Pyro-Kommandant
fr: Pyro-Commandant
it: Piro-comandante
ja: パイロコマンダー
pt: Piromestre
ru: Пирокомандор
tr: Ateş-Komutanı
uk: Пірокомандор

# skin-paladin8
source: Seraphim Sentinel Helm
de: Seraphim-Wachhelm
fr: Casque de Séraphin sentinelle
it: Elmo da sentinella serafica
ja: 熾天使の兜
pt: Elmo Sentinel-Seráfica
ru: Шлем охранителя Серафима
tr: Seraf Nöbetçi Miğferi
uk: Шолом охоронителя Серафима

# skin-priest8
source: Cerulean Crested Cleric
de: Himmelblau gekrönter Kleriker
fr: Clerc à la coiffe céruléenne
it: Ecclesiastico dalla cresta cerulea
ja: 空飾の聖帽
pt: Clérigo da Crista Cerúlea
ru: Клирик с сердоликовым крестом
tr: Papazın Gök Mavisi Şapkası
uk: Клірик із сердоліковим хрестом

# skin-ranger8
source: Dynasty Ranger
de: Dynastie-Ranger
fr: Ranger de la dynastie
it: Ranger dinastico
ja: ダイナスティ
pt: Guarda da Dinastia
ru: Потомственный рейнджер
tr: Hanedan Korucusu Şapkası
uk: Спадкоємний рейнджер

# skin-rogue8
source: Striped Stealth Rogue
de: Gestreifter Tarnschurke
fr: Bandit discret à rayures
it: Furfante furtivo
ja: ストライプステルス
pt: Ladino Listrado Furtivo
ru: Полосатый разбойник
tr: Gizli Çizgili Şapkası
uk: Смугастий розбійник

# skin-thief8
source: Sea Thief
de: Meeresdieb
fr: Voleur des mers
it: Ladro dei mari
ja: シー・シーフ
pt: Ladrão dos Mares
ru: Морской вор
tr: Denizlerin Hırsızı Şapkası
uk: Морський злодій

# skin-warlock8
source: Void Warlock
de: Leeren-Hexenmeister
fr: Seigneur de guerre du néant
it: Stregone invisibile
ja: 空隙の魔術師
pt: Bruxo do Vazio
ru: Маг пустоты
tr: Karabüyücü'nün Hiçlik Şapkası
uk: Маг пустоти

# skin-warrior8
source: Emerald Warrior
de: Smaragdkrieger
fr: Guerrier d'émeraude
it: Guerriero smeraldo
ja: 翠玉の戦士
pt: Guerreiro Esmeralda
ru: Изумрудный воин
tr: Zümrüt Şovalye Şapkası
uk: Смарагдовий воїн

# skin-witchdoctor8
source: Owl Elite Witchdoc
de: Eulen-Elite-Hexendoktor
fr: Sorcier-hibou d'élite
it: Stregone curatore
ja: 宵闇の魔術医
pt: Feiticeiro Elite da Coruja
ru: Колдун ордена Совы
tr: Büyücüdoktorun Baykuş Şapkası
uk: Чаклун ордену Сови

# skin-black-mage11
source: Noble Necro Topper
de: Edler Nekroaufsatz
fr: Haut-de-forme nécro du noble
it: Cilindro necrofilo
ja: 高貴なネクロトッパー
pt: Chapéu Necro da Nobreza
ru: Благородный некротоппер
tr: Onurlu Kara Büyücü Şapkası
uk: Шляхетний некротоппер

# skin-druid11
source: Lupine Howler Helm
de: Lupinenheuler-Helm
fr: Casque du loup hurlant
it: Elmo lupo urlatore
ja: 狼の遠吠えの兜
pt: Elmo Uivante Lúpino
ru: Шлем волчьего боба
tr: Vahşi Uluyan Miğferi
uk: Шолом вовчого боба
