Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/skin-names.strings
Languages: de, fr, it, ja, pt, ru, tr, uk

# skin-elite-warrior11
source: Crimson Horned Guard
de: Purpurgehörnter Wächter
fr: Protection pourpre à cornes
it: Sentinella cremisi cornuta
ja: 紅の角の護衛
pt: Guarda Chifrudo Carmesim
ru: Багрянорогий страж
tr: Kızıl Boynuzlu Kask
uk: Багрянорогий вартовий

# skin-high-mage11
source: Wicked Mage Hat
de: Böser Magierhut
fr: Chapeau du mage diabolique
it: Cappello magico
ja: 邪悪な魔法使いの帽子
pt: Chapéu do Mago Nefasto
ru: Шляпа злобного мага
tr: Hain Büyüü Şapkası
uk: Капелюх злого мага

# skin-mage11
source: Spectral Mage Shroud
de: Geisterhafter Magierumhang
fr: Voile du mage spectral
it: Occhiali magici
ja: 幽霊の魔法使いの衣
pt: Mortalha do Mago Espectral
ru: Саван призрачного мага
tr: Hayali Büyücü Kefeni
uk: Саван примарного чаклуна

# skin-paladin11
source: Glacial Knight Visor
de: Gletscherritter-Visier
fr: Visière du chevalier des glaces
it: Maschera cavaliere glaciale
ja: 氷の騎士の面
pt: Viseira do Cavaleiro Glacial
ru: Забрало ледяного рыцаря
tr: Buzul Şövalye Vizörü
uk: Забрало крижаного лицаря

# skin-priest11
source: Mystic Phantom Cowl
de: Mystische Phantomkapuze
fr: Capuchon du spectre mystique
it: Cappuccio fantasma mistico
ja: 神秘的な幻影のフード
pt: Capuz do Fantasma Místico
ru: Сутана таинственного фантома
tr: Mistik Hayalet Kukuletası
uk: Сутана загадкового фантома

# skin-ranger11
source: Enamored Spirit Bonnet
de: Verliebte Geistermütze
fr: Bonnet de l'esprit amoureux
it: Cappello spirito innamorato
ja: 愛された精霊の帽子
pt: Barrete do Espírito Apaixonado
ru: Шляпа очарованного духа
tr: Aşık Ruh Bonesi
uk: Капелюх зачарованого духа

# skin-rogue11
source: Fiendish Pink Horn Cap
de: Teuflischrosa Hornmütze
fr: Casquette à corne rose diabolique
it: Copricapo cornuto rosa
ja: 悪魔のピンクの角帽
pt: Capucho com Chifres Rosa Demoníaco
ru: Рогатый колпак злодея
tr: Şeytani Pembe Boynuz Şapkası
uk: Рогатий ковпак лиходія

# skin-thief11
source: Ghastly Grin Hood
de: Grässlich grinsende Kapuze
fr: Capuche du rictus effroyable
it: Cappuccio inquietante sorridente
ja: 不気味な笑顔のフード
pt: Capuz do Sorriso Espectral
ru: Капюшон мерзкого оскала
tr: Dehşet Sırıtan Kapüşonu
uk: Каптур огидного оскалу

# skin-warlock11
source: Savage Frost Maw
de: Wilder Frostschlund
fr: Gueule du givre brutal
it: Fauci selvagge
ja: 慈悲なき氷口
pt: Mandíbula do Gelo Selvagem
ru: Жуткая ледяная пасть
tr: Vahşi'nin Donuk Ağzı
uk: Моторошна крижана паща

# skin-warrior11
source: Cryptic Gem Visage
de: Kryptisches Edelsteinvisage
fr: Visage au joyau mystérieux
it: Maschera criptica adornata
ja: 謎めいた宝石の面
pt: Visage da Gema Críptica
ru: Самоцветный лик
tr: Şifreli Mücevher Yüzü
uk: Самоцвітний лик

# skin-witchdoctor11
source: Shamanic Steel Shroud
de: Schamanisches Stahltuch
fr: Voile en acier chamanique
it: Cuffia sciamanica
ja: シャーマニック・スチールシャラウド
pt: Mortalha de Aço Xamânico
ru: Стальной саван шамана
tr: Şamanik Çelik Kefen
uk: Сталевий саван шамана

# skin-black-mage12
source: Arcane Shade Hood
de: Arkane Schattenkapuze
fr: Capuche de l'ombre impénétrable
it: Cappuccio ombra arcana
ja: アルケイン・シェイドフード
pt: Capuz da Sombra Arcana
ru: Накидка мага теней
tr: Gizemli Gölge Başlığı
uk: Накидка мага тіней

# skin-druid12
source: Forest Spirit Hat
de: Waldgeist-Hut
fr: Chapeau de l'esprit de la forêt
it: Copricapo spirito della foresta
ja: 森の精霊の帽子
pt: Chapéu do Espírito da Floresta
ru: Шляпа лесного духа
tr: Orman Ruhu Şapkası
uk: Капелюх лісового духа

# skin-elite-warrior12
source: Dragon Heart War Helm
de: Drachenherz-Kriegshelm
fr: Casque de guerre du cœur de dragon
it: Elmo bellico cuore di drago
ja: ドラゴンハートの戦争の兜
pt: Elmo Coração de Dragão
ru: Боевой шлем драконоборца
tr: Ejder Yüreği Savaş Mipferi
uk: Бойовий шолом драконоборця

# skin-high-mage12
source: High Arcanist's Hat
de: Hut des Hohen Arkanisten
fr: Chapeau de Haut Arcaniste
it: Copricapo del sommo arcanista
ja: 高位アーケニストの帽子
pt: Chapéu do Alto Arcanista
ru: Шляпа высшего мага
tr: Yüce Gizemli'nin Şapkası
uk: Капелюх вищого мага

# skin-mage12
source: Pyromancer's Turban
de: Turban des Pyromanten
fr: Turban du Pyromage
it: Turbante del piromane
ja: 火炎使いのターバン
pt: Turbante do Piromante
ru: Тюрбан пироманта
tr: Ateş Büyücüsü'nün Sarığı
uk: Тюрбан піроманта

# skin-paladin12
source: Sanctified Beacon Helm
de: Geweihter Leuchtfeuerhelm
fr: Casque du guide sanctifié
it: Elmo della luce santificata
ja: 神聖なビーコンの兜
pt: Elmo do Farol Santificado
ru: Шлем священного маяка
tr: Kutsanmış Fener Miğferi
uk: Шолом священного маяка

# skin-priest12
source: Devout Guardian Hood
de: Kapuze des frommen Wächters
fr: Capuche du protecteur dévoué
it: Cappuccio del guardiano devoto
ja: 信心深い守護者のフード
pt: Capuz do Guardião Devoto
ru: Капюшон благочестивого хранителя
tr: Sadık Koruyucu Başlığı
uk: Капюшон благочестивого хранителя

# skin-ranger12
source: Shogun Ranger Helm
fr: Casque du Ranger du Shogun
it: Elmo del ranger shogun
ja: 将軍レンジャーの兜
pt: Elmo do Shogun
ru: Шлем рейнджера-сёгуна
tr: Başkomutan Bekçi'nin Miğferi
uk: Шолом рейнджера-сьогуна

# skin-rogue12
source: Phantom Assassin Mask
de: Maske des Phantomassassinen
fr: Masque de l'Assassin fantôme
it: Maschera del fantasma assassino
ja: 幻の暗殺者のマスク
pt: Máscara do Assassino Fantasma
ru: Маска призрачного убийцы
tr: Hayalet Suikastçi Maskesi
uk: Маска примарного вбивці

# skin-thief12
source: Silent Pilferer's Hat
de: Hut des stillen Langfingers
fr: Chapeau du Chapardeur silencieux
it: Copricapo del ladruncolo silenzioso
ja: 沈黙の盗賊の帽子
pt: Chapéu do Ladrão Silencioso
ru: Шляпа безмолвного пилигрима
tr: Sessiz Hırsız'ın Şapkası
uk: Капелюх безмовного пілігрима

# skin-warlock12
source: Dark Pact Helm
de: Helm des Dunklen Pakts
fr: Casque du pacte obscur
it: Elmo del patto oscuro
ja: 闇の契約の兜
pt: Elmo do Pacto Sombrio
ru: Шлем договора с тьмой
tr: Karanlık Yolun Miğferi
uk: Шолом договору з пітьмою

# skin-warrior12
source: Ironclad Defender Helm
de: Helm des eisernen Verteidigers
fr: Casque du Défenseur à toute épreuve
it: Elmo del difensore di ferro
ja: 鋼鉄の守護者の兜
pt: Elmo do Defensor de Ferro
ru: Шлем латного рыцаря
tr: Demirkaplı Koruyucu Miğferi
uk: Шолом латного лицаря

# skin-witchdoctor12
source: Spiritcaller Helm
de: Helm des Geistrufers
fr: Casque de l'Invocateur d'esprits
it: Elmo del visitatore spirituale
ja: 霊の召喚者の兜
pt: Elmo Chama-espíritos
ru: Шлем говорящего с духами
tr: Ruhçağıran Miğferi
uk: Шолом мовця з духами

# skin-black-mage13
source: Crystal Gaze Turban
de: Kristallblick-Turban
fr: Turban du regard de cristal
it: Turbante dall'occhio di cristallo
ja: 水晶占いのターバン
pt: Turbante do Olhar Cristalino
ru: Тюрбан прорицателя
tr: Kristal Bakışlı Türban
uk: Тюрбан віщуна

# skin-druid13
source: Feral Spirit's Visage
de: Antlitz des wilden Geistes
fr: Visage de l'esprit féral
it: Volto dello spirito selvaggio
ja: 野生の精霊の顔
pt: Visagem do Espírito Selvagem
ru: Явление дикого духа
tr: Vahşi Ruh Sureti
uk: Прояв дикого духу

# skin-elite-warrior13
source: Spirehorn Warhelm
de: Spirehorn-Kriegshelm
fr: Casque de guerre de la corne aiguisée
it: Elmo appuntito
ja: 尖角の戦兜
pt: Elmo do Chifre Espiral
ru: Шипастый вархельм
tr: Dikboynuz Savaşmiğferi
uk: Шипастий вархельм

# skin-high-mage13
source: Helm of the Arcane Sage
de: Helm des arkanen Weisen
fr: Casque du mage obscur
it: Elmo del saggio arcano
ja: アルケイン賢者の兜
pt: Elmo do Sábio Arcano
ru: Шлем мудреца-чародея
tr: Gizemli Bilge'nin Miğferi
uk: Шолом мудреця-чарівника

# skin-mage13
source: Helm of the Watchful Abyss
de: Helm des wachsamen Abgrunds
fr: Casque de l'abysse néfaste
it: Elmo dell'abisso dai 100 occhi
ja: 用心深い深淵の兜
pt: Elmo do Abismo Vigilante
ru: Шлем недремлющей бездны
tr: Çetin Uçurum Miğferi
uk: Шолом пильної безодні

# skin-paladin13
source: Helm of the Righteous Dragon
de: Helm des gerechten Drachen
fr: Casque du dragon vertueux
it: Elmo del drago virtuoso
ja: 正義の竜の兜
pt: Elmo do Dragão Justo
ru: Шлем праведного дракона
tr: Adil Ejderha Miğferi
uk: Шолом праведного дракона

# skin-priest13
source: Dragonclaw Hood
de: Drachenklauen-Kapuze
fr: Capuche de la griffe du dragon
it: Casco del drago mostruoso
ja: ドラゴンの爪の頭巾
pt: Capuz Garra de Dragão
ru: Капюшон драконьего когтя
tr: Ejderpençesi Başlığı
uk: Каптур драконячого кігтя

# skin-ranger13
source: Guardian of the Sun Helm
de: Wächter des Sonnenhelms
fr: Casque du gardien du soleil
it: Guardiano dell'elmo solare
ja: 太陽の守護者の兜
pt: Elmo do Guardião do Sol
ru: Шлем стража солнца
tr: Güneş Muhafızının Miğferi
uk: Шолом вартового сонця

# skin-rogue13
source: Whispering Vines Mask
de: Maske der flüsternden Ranken
fr: Masque des vignes murmurantes
it: Maschera delle radici sussurranti
ja: 囁き蔦のマスク
pt: Máscara das Vinhas Uivantes
ru: Маска шепчущей лозы
tr: Fısıldayan Sarmaşık Maskesi
uk: Маска шепотливої лози

# skin-thief13
source: Lunarflare Mask
de: Mondfackel-Maske
fr: Masque du flamboiement lunaire
it: Maschera bagliore lunare
ja: ルナフレアのマスク
pt: Máscara do Clarão Lunar
ru: Маска отблеска Луны
tr: Ay Parlaması Maskesi
uk: Маска відблиску Місяця

# skin-warlock13
source: Hood of the Deep One
de: Kapuze des Tiefen Wesens
fr: Capuche de Ceux des profondeurs
it: Copricapo delle tenebre
ja: 深淵の者の頭巾
pt: Capuz do Ser das Profundezas
ru: Капюшон обитателя глубин
tr: Derin Olanın Başlığı
uk: Каптур мешканця глибин

# skin-warrior13
source: Wings of Wrath
de: Flügel des Zorns
fr: Ailes de la colère
it: Ali della collera divina
ja: 憤怒の翼
pt: Asas da Ira
ru: Крылья гнева
tr: Gazap Kanatları
uk: Крила гніву

# skin-witchdoctor13
source: Ravenlord's Mask
de: Maske des Rabensherrn
fr: Masque du seigneur corbeau
it: Maschera del signore dei corvi
ja: カラスの王のマスク
pt: Máscara do Senhor dos Corvos
ru: Маска Кутха
tr: Kuzgun Lord'un Maskesi
uk: Маска Кутха

# skin-black-mage14
source: Spectral Knight Helm
de: Spektraler Ritterhelm
fr: Casque du Cavalier spectral
it: Elmo del cavaliere spettrale
ja: 幽霊の騎士の兜
pt: Elmo do Cavaleiro Espectral
ru: Шлем призрачного рыцаря
tr: Hayalet At Miğferi
uk: Шолом примарного лицаря

# skin-druid14
source: Knight of the Wild
de: Ritter der Wildnis
fr: Cavalier de la nature
it: Cavaliere selvaggio
ja: ワイルドナイツ
pt: Cavaleiro da Natureza
ru: Лесной богатырь
tr: Vahşi At Şövalyesi
uk: Лісовий богатир

# skin-elite-warrior14
source: Bulwark of the Rook
de: Bollwerk des Turms
fr: Rempart de la Tour
it: Baluardo del corvo
ja: ルークの防壁
pt: Baluarte da Torre
ru: Оплот новобранцев
tr: Kale'nin Siperi
uk: Оплот новобранців

# skin-high-mage14
source: Crown of the Arcane Queen
de: Krone der arkanen Dame
fr: Couronne de la Reine des arcanes
it: Corona della regina arcana
ja: アルケイン女王の王冠
pt: Coroa da Rainha Arcana
ru: Корона повелительницы магии
tr: Gizemli Vezir'in Tacı
uk: Корона володарки магії

# skin-mage14
source: Mystic Pawn's Hood
de: Kapuze des Mystischen Bauern
fr: Capuche du Pion mystique
it: Cappuccio della pedina mistica
ja: ミスティックポーンの頭巾
pt: Capuz do Peão Místico
ru: Капюшон мистической пешки
tr: Mistik Piyon'un Tacı
uk: Капюшон містичного пішака

# skin-paladin14
source: Bastion of the Rook
de: Bastion des Turms
fr: Bastion de la Tour
it: Roccaforte del corvo
ja: ルークの要塞
pt: Bastião da Torre
ru: Бастион новичков
tr: Kale'nin Koruması
uk: Бастіон новачків

# skin-priest14
source: Bishop's Sacred Veil
de: Heiliger Schleier des Läufers
fr: Voile sacré du Fou
it: Velo sacro del vescovo
ja: ビショップの神聖なベール
pt: Véu Sagrado do Bispo
ru: Священный покров епископа
tr: Fil'in Kutsal Peçesi
uk: Священний покров єпископа

# skin-ranger14
source: Helm of the Bold Pawn
de: Helm des mutigen Bauern
fr: Casque du Pion audacieux
it: Elmo della pedina audace
ja: ボールドポーンの兜
pt: Elmo do Peão Destemido
ru: Шлем смелой пешки
tr: Cesur Piyonun Miğferi
uk: Шолом сміливого пішака

# skin-rogue14
source: Crown of the Shadow King
de: Krone des Schattenkönigs
fr: Couronne du Roi des ténèbres
it: Corona del re delle ombre
ja: シャドウキングの王冠
pt: Coroa do Rei das Sombras
ru: Корона короля теней
tr: Gölge Şah'ın Tacı
uk: Корона короля тіней

# skin-thief14
source: Pawn's Maw Mask
de: Bauers Maulmaske
fr: Masque du Pion
it: Maschera delle fauci della pedina
ja: ポーンの大口マスク
pt: Máscara da Mandíbula do Peão
ru: Маска с пастью пешки
tr: Piyon'un Ağız Maskesi
uk: Маска з пащею пішака

# skin-warlock14
source: Cursed Bishop's Mask
de: Verfluchte Läufermaske
fr: Masque du Fou maudit
it: Maschera del vescovo maledetto
ja: ポーンの大口マスク
pt: Máscara do Bispo Amaldiçoado
ru: Проклятая маска епископа
tr: Lanetli Fil'in Maskesi
uk: Проклята маска єпископа

# skin-warrior14
source: Royal Warlord's Visage
de: Antlitz des königlichen Kriegsherrn
fr: Visage du seigneur de guerre royal
it: Viso del condottiero reale
ja: 王の戦士の顔
pt: Visagem do Senhor de Guerra Real
ru: Облик королевского военачальника
tr: Asil Savaş Lordu Maskesi
uk: Образ королівського воєначальника

# skin-witchdoctor14
source: Queen of the Cursed Vortex
de: Dame des verfluchten Wirbels
fr: Reine du vortex maudit
it: Regina del vortice maledetto
ja: 呪われし渦の女王
pt: Rainha do Vórtice Amaldiçoado
ru: Королева проклятого вихря
tr: Lanetli Girdabın Veziri
uk: Королева проклятого вихору

# skin-black-mage15
source: Darkcode Veil
de: Dunkelcode-Schleier
fr: Voile du code obscur
it: Velo oscuro
ja: ダークコードのベール
pt: Véu do Código Sombrio
ru: Вуаль кодекса тьмы
tr: Karanlık Kod Örtüsü
uk: Вуаль кодексу пітьми

# skin-druid15
source: Groveborn Protector
de: Haingeborener Beschützer
fr: Protecteur des bosquets
it: Protezione boscosa
ja: 森に生まれし守護者
pt: Protetor do Bosque Tecnológico
ru: Хранитель рощи
tr: Ormanlık Korucusu
uk: Охоронець гаю

# skin-elite-warrior15
source: Titanium Vanguard
de: Titanen-Vorhut
fr: Avant-garde de titane
it: Paladino titanico
ja: チタニウムの先駆者
pt: Vanguarda de Titânio
ru: Титановый авангард
tr: Titanyum Öncü Miğferi
uk: Титановий авангард

# skin-high-mage15
source: Neural Archmage Crest
de: Neuraler Erzmagier-Kamm
fr: Coiffe de l'Archimage neural
it: Cresta arcana neurale
ja: ニューラルアークメイジの紋章
pt: Coroa Neural do Arqui-Mago
ru: Кивер нейромага
tr: Sinirsel Baş Büyücü Arması
uk: Ківер нейромага

# skin-mage15
source: Neurocaster Helm
de: Helm des Neurozaubers
fr: Casque du Neuromage
it: Elmo neurale
ja: ニューロキャスターの兜
pt: Elmo do Neurocaster
ru: Шлем нейрочародея
tr: Sinirbüyücü Miğferi
uk: Шолом нейрочародія

# skin-paladin15
source: Shield of the Singularity
de: Schild der Singularität
fr: Bouclier de la singularité
it: Scudo della singolarità
ja: 特異点の盾
pt: Escudo da Singularidade
ru: Щит сингулярности
tr: Eşsizliğin Kalkanı
uk: Щит сингулярності

# skin-priest15
source: Holo-Saint's Mask
de: Holo-Heiligenmaske
fr: Masque du Holo-Saint
it: Maschera olosanta
ja: ホロ・セイントのマスク
pt: Máscara do Santo Holográfico
ru: Холо-маска святого
tr: Holo-Aziz'in Maskesi
uk: Холо-маска святого

# skin-ranger15
source: Holo-Hunter's Visor
de: Holo-Jäger-Visier
fr: Visière du Holo-Chasseur
it: Occhiali olocacciatore
ja: ホロ・ハンターのバイザー
pt: Visor do Caçador Holográfico
ru: Холо-визор охотника
tr: Holo-Avcı'nın Vizörü
uk: Холо-візор мисливця

# skin-rogue15
source: Shadow Saboteur Mask
de: Schattensaboteur-Maske
fr: Masque du Saboteur de l'ombre
it: Maschera del sabotatore ombroso
ja: 影の妨害者のマスク
pt: Máscara do Sabotador Sombrio
ru: Маска диверсанта
tr: Gölge Sabotajcı Maskesi
uk: Маска диверсанта

# skin-thief15
source: Shadow Circuit Mask
de: Schattenkreismaske
fr: Masque du Pisteur de l'ombre
it: Maschera del circuito ombroso
ja: シャドーサーキットのマスク
pt: Máscara do Circuito Sombrio
ru: Маска круга теней
tr: Gölge Devre Maskesi
uk: Маска кола тіней

# skin-warlock15
source: Daemon Binder's Crown
de: Dämonenbinder-Krone
fr: Couronne du Démonicide
it: Corona del raccoglitore demoniaco
ja: デーモンバインダーの王冠
pt: Coroa do Vinculador de Demônios
ru: Корона сковывателя демонов
tr: Şeytan Yakalayanın Tacı
uk: Корона сковувача демонів

# skin-warrior15
source: Depthwalker's Visor
de: Tiefenwanderer-Visier
fr: Visière du Marcheur des profondeurs
it: Occhiali del camminatore delle profondità
ja: 深海ウオーカーのバイザー
pt: Visor do Caminhante das Profundezas
ru: Шлем глубоководника
tr: Derin Gezgini'nin Vizörü
uk: Шолом глибоководника

# skin-witchdoctor15
source: Plague Circuit Mask
de: Pestkreis-Maske
fr: Masque du Pisteur d'épidémies
it: Maschera del circuito pestilenziale
ja: 疫病回路のマスク
pt: Máscara do Circuito da Peste
ru: Маска чумного круга
tr: Veba Devre Maskesi
uk: Маска чумного кола

# skin-black-mage16
source: Shadowfire Dragon Visage
de: Schattenfeuer-Drachenantlitz
fr: Visage du Dragon Shadowfire
it: Drago ombroso focoso
ja: 影火竜の面
pt: Visagem do Dragão das Sombras
ru: Шлем Сумеречного дракона
tr: Gölgeateşi Ejderinin Miğferi
uk: Шолом Сутінкового дракона

# skin-druid16
source: Crown of the Wild Wyrm
de: Krone des wilden Drachens
fr: Couronne du Wyrm sauvage
it: Corona del drago feroce
ja: 野生ウュルムの王冠
pt: Coroa do Dragão Selvagem
ru: Корона виверны
tr: Vahşi Ejderin Tacı
uk: Корона віверни

# skin-elite-warrior16
source: Draconic Warlord Helm
de: Drakonischer Kriegsherrenhelm
fr: Casque du Seigneur de guerre draconique
it: Elmo del condottiero dei draghi
ja: 竜牙の追跡者
pt: Elmo do Senhor da Guerra Dracônico
ru: Шлем драконьего полководца
tr: Ejderha Savaş Lordu Miğferi
uk: Шолом драконячого полководця

# skin-high-mage16
source: Crown of the Arcane Dragon
de: Krone des arkanen Drachens
fr: Couronne du Dragon des arcanes
it: Corona del drago arcano
ja: 沈黙ウュルムの兜
pt: Coroa do Dragão Arcano
ru: Корона магического дракона
tr: Gizemli Ejderhanın Tacı
uk: Корона чарівного дракона

# skin-mage16
source: Dragonflame Archmage
de: Drachenflammen-Erzmagier
fr: Archimage du feu du dragon
it: Fiamma del dragone magico arcaico
ja: 竜焰の大魔道士
pt: Arqui-Mago das Chamas Dracônicas
ru: Огнедышащий дракон
tr: Ejderateşi Başbüyücü Miğferi
uk: Вогнедишний дракон

# skin-paladin16
source: Helm of the Sacred Wyrm
de: Helm des heiligen Drachens
fr: Casque du Wyrm sacré
it: Elmo del drago sacro
ja: 聖なるウュルムの兜
pt: Elmo do Dragão Sagrado
ru: Шлем священного вирма
tr: Kutsal Ejderin Miğferi
uk: Шолом священного вірма

# skin-priest16
source: Sacred Wyrm's Halo
de: Heiligenschein des heiligen Drachens
fr: Auréole du Wyrm sacré
it: Aureola del drago sacro
ja: 聖なるウュルムのハロー
pt: Halo do Dragão Sagrado
ru: Ореол священного вирма
tr: Kutsal Ejderin Işık Halkası
uk: Ореол священного вірма

# skin-ranger16
source: Dragonfang Tracker
de: Drachenzahn-Jäger
fr: Pisteur du croc du dragon
it: Segugio del dente di drago
ja: 竜牙の追跡
pt: Perseguidor Presa-de-Dragão
ru: Ловец драконов
tr: Ejderpençesi Kafa Takipçisi
uk: Ловець драконів

# skin-rogue16
source: Helm of the Silent Wyrm
de: Helm of des stummen Drachens
fr: Casque du Wyrm silencieux
it: Elmo del drago silenzioso
ja: 沈黙ワームの兜
pt: Elmo do Dragão Silencioso
ru: Шлем амфетира
tr: Sessiz Ejderin Miğferi
uk: Шолом амфетира

# skin-thief16
source: Venomfang Hood
de: Giftzahn-Kapuze
fr: Capuche du croc venimeux
it: Cappuccio del dente velenoso
ja: 毒牙の頭巾
pt: Capuz Presa-Venenosa
ru: Капюшон дрейка
tr: Zehirdişi Miğferi
uk: Каптур Дрейка

# skin-warlock16
source: Infernal Dragon's Mask
de: Maske des Höllendrachen
fr: Masque du Dragon infernal
it: Maschera del drago infernale
ja: 地獄の竜のマスク
pt: Máscara do Dragão Infernal
ru: Маска инфернального дракона
tr: Cehennem Ejderhasının Miğferi
uk: Маска інфернального дракона

# skin-warrior16
source: Draconic Fury Helm
de: Helm der Drachenwut
fr: Casque de la fureur draconique
it: Elmo della furia del drago
ja: ドラコニック怒りの兜
pt: Elmo da Fúria Dracônica
ru: Шлем драконьей ярости
tr: Ejderha Öfkesi Miğferi
uk: Шолом драконячої люті

# skin-witchdoctor16
source: Plague Dragon's Visage
de: Antlitz des Seuchendrachen
fr: Visage du Dragon fléau
it: Maschera dell'epidemia del drago
ja: 疫病竜の面
pt: Visagem do Dragão da Peste
ru: Маска чумного линдворма
tr: Veba Ejderhasının Miğferi
uk: Маска чумного ліндворма

# skin-black-mage17
source: Visage of the Void Lich
de: Antlitz des Leeren-Lichs
fr: Visage de la Liche du néant
it: Maschera del vuoto
ja: 虚無リッチの仮面
pt: Face do Lich do Vazio
ru: Лик некроманта забвения
tr: Hiçlik Cesedi'nin Sureti
uk: Лик некроманта забуття

# skin-druid17
source: Helm of the Verdant Curse
de: Helm des Grünen Fluchs
fr: Casque du fléau verdoyant
it: Elmo maledizione lussureggiante
ja: 草木の呪いの兜
pt: Elmo da Maldição Verdejante
ru: Шлем проклятья природы
tr: Yeşim Laneti'nin Miğferi
uk: Шолом прокльону природи

# skin-elite-warrior17
source: Helm of the Bone Vanguard
de: Helm der Knochen-Vorhut
fr: Casque de l'avant-garde osseuse
it: Elmo paladino delle ossa
ja: 骨衛兵の兜
pt: Elmo da Vanguarda Óssea
ru: Шлем костяного стража
tr: Kemik Öncenin Miğferi
uk: Шолом кістяного вартового

# skin-high-mage17
source: Crown of the Spectral Archmage
de: Krone des spektralen Erzmagiers
fr: Couronne de l'Archimage spectral
it: Corona archimago spettrale
ja: 幻霊の大魔導冠
pt: Coroa do Arquimago Espectral
ru: Корона спектрального мага
tr: Hayali Başbüyücünün Tacı
uk: Корона спектрального чаклуна

# skin-mage17
source: Skullflame Sorcerer
de: Schädelflammen-Zauberer
fr: Sorcier au crâne de feu
it: Cranio in fiamme stregato
ja: 霜炎の魔術師
pt: Feiticeiro da Chama Esquelética
ru: Череп голубого пламени
tr: Alevli Kafatası Miğferi
uk: Череп блакитного полум'я

# skin-paladin17
source: Sanctified Skullplate
de: Geweihte Schädelplatte
fr: Tête de mort sanctifiée
it: Piatto teschio santificato
ja: 聖者のヘルム
pt: Elmo Sagrado da Caveira
ru: Освященный шлем-череп
tr: Kutsanmış Kafatası Plakası
uk: Освячений шолом-череп

# skin-priest17
source: Halo of the Bone Cleric
de: Heiligenschein des Knochenklerikers
fr: Auréole du clerc osseux
it: Aureola ecclesiastica d'ossa
ja: 骨僧の光輪
pt: Auréola do Clérigo Ósseo
ru: Венец костяного клирика
tr: Kemik Kafatası Halesi
uk: Вінець кістяного клірика

# skin-ranger17
source: Stalker of the Hollow Hunt
de: Jäger der Hohlenjagd
fr: Pisteur de cavités
it: Persecutore del vuoto
ja: 虚狩の影
pt: Caçador do Vazio Oco
ru: Сталкер дикой охоты
tr: Delik Takipçinin Avı
uk: Сталкер дикого полювання

# skin-rogue17
source: Shade of the Smiling Skull
de: Schatten des lächelnden Schädels
fr: Ombre du crâne souriant
it: Teschio sorridente ombroso
ja: 笑骸の影
pt: Sombra da Caveira Sorridente
ru: Тень улыбающегося черепа
tr: Sırıtan Gölgenin Kafatası
uk: Череп посмішки з тіні

# skin-thief17
source: Hood of the Grinning Phantom
de: Kapuze des grinsenden Phantoms
fr: Capuche du fantôme souriant
it: Cappuccio fantasma arcigno
ja: 笑幻の頭巾
pt: Capuz do Fantasma Risonho
ru: Капюшон ухмыляющегося призрака
tr: Sırıtan Hayaletin Başlığı
uk: Каптур усміхненої примари

# skin-warlock17
source: Mask of the Cursed Skull
de: Maske des verfluchten Schädels
fr: Masque du crâne maudit
it: Maschera teschio malefico
ja: 呪骸の仮面
pt: Máscara da Caveira Amaldiçoada
ru: Маска проклятого черепа
tr: Lanetli Kafatasının Maskesi
uk: Маска проклятого черепа

# skin-warrior17
source: Skullcrush Battlemask
de: Kampfmaske des Schädelbrechers
fr: Masque de combat du broyeur de crânes
it: Maschera teschio frantumato
ja: 砕頭の戦仮面
pt: Elmo Esmagador de Crânios
ru: Маска крушителя черепов
tr: Kafakıran Savaş Maskesi
uk: Маска розтрощувача черепів

# skin-witchdoctor17
source: Totemic Skullbearer
de: Totemischer Schädelträger
fr: Porteur de crâne totémique
it: Detentore teschio totemico
ja: 呪骨の祭司
pt: Portador do Crânio Totêmico
ru: Хранитель черепа-тотема
tr: Totemik Kafatası Taşıyıcısı
uk: Хранитель черепа-тотема

# skin-black-mage18
source: Twilight Witch
de: Dämmerungshexe
fr: Sorcière du crépuscule
it: Strega del crepuscolo
ja: トワイライト・ウィッチ
pt: Bruxa do Crepúsculo
ru: Ведьма полумрака
uk: Відьма мороку

# skin-druid18
source: Floral Grove Spirit
de: Blumenhaingeist
fr: Esprit du bosquet floral
it: Spirito del boschetto floreale
ja: 花森の精霊
pt: Espírito do Bosque Floral
ru: Дух цветочной рощи
uk: Дух квіткового гаю

# skin-elite-warrior18
source: Crowned Talon
de: Gekrönte Klaue
fr: Griffe couronnée
it: Artiglio incoronato
ja: 王冠の鉤爪
pt: Garra Coroada
ru: Когтистый венец
uk: Кігтистий вінець

# skin-high-mage18
source: Arcane Empress
de: Arkane Kaiserin
fr: Impératrice des arcanes
it: Imperatrice arcana
ja: 秘術の女帝
pt: Imperatriz Arcana
ru: Владычица аркан
uk: Повелителька аркан
