Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/weekly-dungeons.strings
Languages: de, es, fr, it, ja, pt, ru, tr, uk

source: Crypt of the End of Times
de: Krypta des Weltenendes
es: Cripta del Fin de los Tiempos
fr: Crypte de la Fin des Temps
it: Cripta della Fine dei Tempi
ja: 終焉の時の墓所
pt: Cripta do Fim dos Tempos
ru: Склеп Конца Времён
tr: Zamanın Sonunun Mezarlığı
uk: Крипта Кінця Часів

source: Temple of the Lonely Star
de: Tempel des Einsamen Sterns
es: Templo de la Estrella Solitaria
fr: Temple de l'Étoile Solitaire
it: Tempio della Stella Solitaria
ja: 孤独なる星の神殿
pt: Templo da Estrela Solitária
ru: Храм Одинокой Звезды
tr: Yalnız Yıldız Tapınağı
uk: Храм Самотньої Зірки

source: Dungeon of the Final Echo
de: Kerker des Letzten Echos
es: Mazmorra del Eco Final
fr: Donjon du Dernier Écho
it: Segreta dell'Eco Finale
ja: 最後のこだまのダンジョン
pt: Masmorra do Eco Final
ru: Темница Последнего Эха
tr: Son Yankının Zindanı
uk: Підземелля Останнього Відлуння

source: Labyrinth of Dead Hope
de: Labyrinth der Toten Hoffnung
es: Laberinto de la Esperanza Muerta
fr: Labyrinthe de l'Espoir Mort
it: Labirinto della Speranza Morta
ja: 死した希望の迷宮
pt: Labirinto da Esperança Morta
ru: Лабиринт Мёртвой Надежды
tr: Ölü Umutlar Labirenti
uk: Лабіринт Мертвої Надії

source: Palace of Golden Shadows
de: Palast der Goldenen Schatten
es: Palacio de Sombras Doradas
fr: Palais des Ombres Dorées
it: Palazzo delle Ombre Dorate
ja: 黄金の影の宮殿
pt: Palácio das Sombras Douradas
ru: Дворец Золотых Теней
tr: Altın Gölgeler Sarayı
uk: Палац Золотих Тіней

source: Fortress of the Shadow Flame
de: Festung der Schattenflamme
es: Fortaleza de la Llama Sombría
fr: Forteresse de la Flamme de l'Ombre
it: Fortezza della Fiamma Oscura
ja: 影炎の要塞
pt: Fortaleza da Chama Sombria
ru: Крепость Теневого Пламени
tr: Gölge Alev Kalesi
uk: Фортеця Полум'я Тіні

source: Catacombs of the Broken Clock
de: Katakomben der Zerbrochenen Uhr
es: Catacumbas del Reloj Roto
fr: Catacombes de l'Horloge Brisée
it: Catacombe dell'Orologio Rotto
ja: 壊れた時計の地下墓地
pt: Catacumbas do Relógio Quebrado
ru: Катакомбы Сломанных Часов
tr: Kırık Saat Yeraltı Mezarları
uk: Катакомби Зламаного Годинника

source: Throne of the Perpetual Night
de: Thron der Ewigen Nacht
es: Trono de la Noche Perpetua
fr: Trône de la Nuit Perpétuelle
it: Trono della Notte Perpetua
ja: 永夜の玉座
pt: Trono da Noite Perpétua
ru: Трон Вечной Ночи
tr: Ebedi Gece Tahtı
uk: Трон Вічної Ночі

source: Fortress of the Iron General
de: Festung des Eisernen Generals
es: Fortaleza del General de Hierro
fr: Forteresse du Général de Fer
it: Fortezza del Generale di Ferro
ja: 鉄将軍の要塞
pt: Fortaleza do General de Ferro
ru: Крепость Железного Генерала
tr: Demir Generalin Kalesi
uk: Фортеця Залізного Генерала

source: Tunnel of the Lost Soldiers
de: Tunnel der Verlorenen Soldaten
es: Túnel de los Soldados Perdidos
fr: Tunnel des Soldats Perdus
it: Tunnel dei Soldati Perduti
ja: 失われた兵士たちの坑道
pt: Túnel dos Soldados Perdidos
ru: Тоннель Потерянных Солдат
tr: Kayıp Askerlerin Tüneli
uk: Тунель Загублених Воїнів

source: Bastion of the Black Spear
de: Bastion des Schwarzen Speers
es: Bastión de la Lanza Negra
fr: Bastion de la Lance Noire
it: Bastione della Lancia Nera
ja: 黒槍の砦
pt: Bastião da Lança Negra
ru: Бастион Чёрного Копья
tr: Kara Mızrak Sığınağı
uk: Бастіон Чорного Списа

source: Fields of Shadowed Battle
de: Felder der Beschatteten Schlacht
es: Campos de Batalla Sombría
fr: Champs de Bataille Obscurcis
it: Campi della Battaglia Oscura
ja: 影に覆われし戦場
pt: Campos da Batalha Sombria
ru: Поля Теневой Битвы
tr: Gölgeli Savaş Alanları
uk: Поля Тіньової Битви

source: Crypt of the Eternal Warriors
de: Krypta der Ewigen Krieger
es: Cripta de los Guerreros Eternos
fr: Crypte des Guerriers Éternels
it: Cripta dei Guerrieri Eterni
ja: 永遠の戦士の墓所
pt: Cripta dos Guerreiros Eternos
ru: Склеп Вечных Воинов
tr: Ebedi Savaşçıların Mezarlığı
uk: Крипта Вічних Воїнів

source: Lair of the Bloodfang Chieftain
de: Versteck des Blutreißhäuptlings
es: Guarida del Jefe Colmillo Sangriento
fr: Repaire du Chef Croc-de-Sang
it: Tana del Capo Zannasanguinante
ja: 血牙の族長の巣
pt: Covil do Chefe Presa Sangrenta
ru: Логово Вожака Кровавого Клыка
tr: Kan Dişi Reisinin İnı
uk: Лігво Вожака Кровоклику

source: Cave of the Broken-Tusk Tribe
de: Höhle des Stamm der Gebrochenen Hauer
es: Cueva de la Tribu Colmillo Roto
fr: Grotte de la Tribu Croc-Brisé
it: Grotta della Tribù Zanna Spezzata
ja: 折れ牙族の洞窟
pt: Caverna da Tribo Presa Quebrada
ru: Пещера Племени Сломанного Бивня
tr: Kırık Diş Kabilesi Mağarası
uk: Печера Племені Зламаного Бивня

source: Fortress of the Green Axes
de: Festung der Grünen Äxte
es: Fortaleza de los Hachas Verdes
fr: Forteresse des Haches Vertes
it: Fortezza delle Asce Verdi
ja: 緑の斧の要塞
pt: Fortaleza dos Machados Verdes
ru: Крепость Зелёных Топоров
tr: Yeşil Baltalar Kalesi
uk: Фортеця Зелених Сокир

source: Arena of the Savage Clans
de: Arena der Wilden Clans
es: Arena de los Clanes Salvajes
fr: Arène des Clans Sauvages
it: Arena dei Clan Selvaggi
ja: 野蛮な部族の闘技場
pt: Arena das Tribos Selvagens
ru: Арена Диких Кланов
tr: Vahşi Kabileler Arenası
uk: Арена Диких Племен

source: Orc Blood Pit
de: Ork-Blutgrube
es: Foso de Sangre Orco
fr: Fosse Sanglante des Orques
it: Fossa del Sangue Orchesco
ja: オークの血の闘技場
pt: Fosso de Sangue Orc
ru: Яма Орочьей Крови
tr: Ork Kan Çukuru
uk: Яма Оркської Крові

source: Swamp of Whispering Shadows
de: Sumpf der Flüsternden Schatten
es: Pantano de las Sombras Susurrantes
fr: Marais des Ombres Murmurantes
it: Palude delle Ombre Sussurranti
ja: ささやく影の沼地
pt: Pântano das Sombras Sussurrantes
ru: Болото Шепчущих Теней
tr: Fısıldayan Gölgeler Bataklığı
uk: Болото Шепочучих Тіней

source: Lair of the Ancient Crocodile
de: Versteck des Uralten Krokodils
es: Guarida del Cocodrilo Ancestral
fr: Repaire du Crocodile Ancien
it: Tana del Coccodrillo Antico
ja: 古代のワニの巣
pt: Covil do Crocodilo Ancestral
ru: Логово Древнего Крокодила
tr: Kadim Timsahın İnı
uk: Лігво Древнього Крокодила

source: Tower of the Rotting Mist
de: Turm des Faulenden Nebels
es: Torre de la Niebla Putrefacta
fr: Tour de la Brume Putréfiée
it: Torre della Nebbia Marcia
ja: 腐敗の霧の塔
pt: Torre da Névoa Apodrecida
ru: Башня Гнилого Тумана
tr: Çürüyen Sis Kulesi
uk: Вежа Гнилої Мгли

source: Sanctuary of Poisoned Water
de: Zuflucht des Vergifteten Wassers
es: Santuario del Agua Envenenada
fr: Sanctuaire de l'Eau Empoisonnée
it: Santuario dell'Acqua Avvelenata
ja: 毒水の聖域
pt: Santuário da Água Envenenada
ru: Святилище Отравленной Воды
tr: Zehirli Sular Mabedi
uk: Святилище Отруєної Води

source: Abyss of the Cursed Marsh
de: Abgrund des Verfluchten Moors
es: Abismo del Pantano Maldito
fr: Abîme du Marais Maudit
it: Abisso della Palude Maledetta
ja: 呪われし湿地の深淵
pt: Abismo do Pântano Amaldiçoado
ru: Бездна Проклятого Болота
tr: Lanetli Bataklık Uçurumu
uk: Безодня Проклятого Болота

source: Hut of the Faceless Witch
de: Hütte der Gesichtslosen Hexe
es: Cabaña de la Bruja Sin Rostro
fr: Cabane de la Sorcière Sans Visage
it: Capanna della Strega Senza Volto
ja: 顔なき魔女の小屋
pt: Cabana da Bruxa Sem Rosto
ru: Хижина Безликой Ведьмы
tr: Yüzsüz Cadının Kulübesi
uk: Хатина Безликої Відьми

source: Tower of the Black Cauldron
de: Turm des Schwarzen Kessels
es: Torre del Caldero Negro
fr: Tour du Chaudron Noir
it: Torre del Calderone Nero
ja: 黒き大釜の塔
pt: Torre do Caldeirão Negro
ru: Башня Чёрного Котла
tr: Kara Kazan Kulesi
uk: Вежа Чорного Казана

source: Grove of the Endless Curse
de: Hain des Endlosen Fluchs
es: Arboleda de la Maldición Infinita
fr: Bosquet de la Malédiction Éternelle
it: Boschetto della Maledizione Infinita
ja: 終わりなき呪いの森
pt: Bosque da Maldição Infinita
ru: Роща Вечного Проклятия
tr: Sonsuz Lanet Korusu
uk: Гай Вічного Прокляття

source: Tomb of the Scarlet Sorceress
de: Grab der Scharlachroten Zauberin
es: Tumba de la Hechicera Escarlata
fr: Tombe de la Sorcière Écarlate
it: Tomba della Strega Scarlatta
ja: 緋色の魔女の墓
pt: Tumba da Feiticeira Escarlate
ru: Гробница Багровой Чародейки
tr: Kızıl Büyücünün Mezarı
uk: Гробниця Багряної Чаклунки

source: Cave of Forbidden Enchantments
de: Höhle der Verbotenen Zauber
es: Cueva de los Encantamientos Prohibidos
fr: Grotte des Enchantements Interdits
it: Grotta degli Incanti Proibiti
ja: 禁断の魔法の洞窟
pt: Caverna dos Encantamentos Proibidos
ru: Пещера Запретных Заклинаний
tr: Yasak Büyüler Mağarası
uk: Печера Заборонених Заклять

source: Arena of the One-Eyed Storm
de: Arena des Einäugigen Sturms
es: Arena de la Tormenta Tuerta
fr: Arène de la Tempête Cyclope
it: Arena della Tempesta Monocola
ja: 一つ目の嵐の闘技場
pt: Arena da Tempestade Monocular
ru: Арена Одноглазого Шторма
tr: Tek Gözlü Fırtına Arenası
uk: Арена Одноокої Бурі

source: Cave of the Iron Cyclops
de: Höhle des Eisernen Zyklopen
es: Cueva del Cíclope de Hierro
fr: Grotte du Cyclope de Fer
it: Grotta del Ciclope di Ferro
ja: 鉄のサイクロプスの洞窟
pt: Caverna do Ciclope de Ferro
ru: Пещера Железного Циклопа
tr: Demir Kiklop Mağarası
uk: Печера Залізного Циклопа

source: Cliff of the Dark Eye
de: Klippe des Dunklen Auges
es: Acantilado del Ojo Oscuro
fr: Falaise de l'Œil Sombre
it: Rupe dell'Occhio Oscuro
ja: 闇の目の崖
pt: Penhasco do Olho Sombrio
ru: Утёс Тёмного Ока
tr: Karanlık Göz Uçurumu
uk: Утес Темного Ока

source: Fortress of the One-Eyed Titan
de: Festung des Einäugigen Titanen
es: Fortaleza del Titán Tuerto
fr: Forteresse du Titan Cyclope
it: Fortezza del Titano Monocolo
ja: 一つ目のタイタンの要塞
pt: Fortaleza do Titã Monocular
ru: Крепость Одноглазого Титана
tr: Tek Gözlü Titanın Kalesi
uk: Фортеця Одноокого Титана

source: Valley of the Blind Hammer
de: Tal des Blinden Hammers
es: Valle del Martillo Ciego
fr: Vallée du Marteau Aveugle
it: Valle del Martello Cieco
ja: 盲目の槌の谷
pt: Vale do Martelo Cego
ru: Долина Слепого Молота
tr: Kör Çekiç Vadisi
uk: Долина Сліпого Молота

source: Lair of the Bonecrusher
de: Versteck des Knochenschmetterers
es: Guarida del Tritahuesos
fr: Repaire du Broyeur d'Os
it: Tana dello Spaccossa
ja: 骨砕きの巣
pt: Covil do Esmaga-ossos
ru: Логово Костолома
tr: Kemik Kıran İnı
uk: Лігво Кістколома

source: Tower of the Stone Fist
de: Turm der Steinfaust
es: Torre del Puño de Piedra
fr: Tour du Poing de Pierre
it: Torre del Pugno di Pietra
ja: 石拳の塔
pt: Torre do Punho de Pedra
ru: Башня Каменного Кулака
tr: Taş Yumruk Kulesi
uk: Вежа Кам'яного Кулака

source: Crypt of the Eternal Hammer
de: Krypta des Ewigen Hammers
es: Cripta del Martillo Eterno
fr: Crypte du Marteau Éternel
it: Cripta del Martello Eterno
ja: 永遠の槌の墓所
pt: Cripta do Martelo Eterno
ru: Склеп Вечного Молота
tr: Ebedi Çekiç Mezarlığı
uk: Крипта Вічного Молота

source: Arena of the Colossal Destroyer
de: Arena des Kolossalen Zerstörers
es: Arena del Destructor Colosal
fr: Arène du Destructeur Colossal
it: Arena del Distruttore Colossale
ja: 巨破壊者の闘技場
pt: Arena do Destruidor Colossal
ru: Арена Колоссального Разрушителя
tr: Devasa Yok Edici Arenası
uk: Арена Колосального Руйнівника

source: Throne of the Worldbreaker
de: Thron des Weltenbrechers
es: Trono del Rompemundos
fr: Trône du Briseur de Mondes
it: Trono dello Spezzamondi
ja: 世界砕きの玉座
pt: Trono do Quebrador de Mundos
ru: Трон Сокрушителя Миров
tr: Dünya Kıranın Tahtı
uk: Трон Ламача Світів

source: Cave of Venomous Fangs
de: Höhle der Giftigen Reißzähne
es: Cueva de los Colmillos Venenosos
fr: Grotte des Crocs Venimeux
it: Grotta delle Zanne Velenose
ja: 毒牙の洞窟
pt: Caverna das Presas Venenosas
ru: Пещера Ядовитых Клыков
tr: Zehirli Dişler Mağarası
uk: Печера Отруйних Ікол

source: Tower of the Toxic Alchemist
de: Turm des Toxischen Alchemisten
es: Torre del Alquimista Tóxico
fr: Tour de l'Alchimiste Toxique
it: Torre dell'Alchimista Tossico
ja: 毒の錬金術師の塔
pt: Torre do Alquimista Tóxico
ru: Башня Токсичного Алхимика
tr: Zehirli Simyacının Kulesi
uk: Вежа Отруйного Алхіміка

source: Swamp of the Green Death
de: Sumpf des Grünen Todes
es: Pantano de la Muerte Verde
fr: Marais de la Mort Verte
it: Palude della Morte Verde
ja: 緑の死の沼
pt: Pântano da Morte Verde
ru: Болото Зелёной Смерти
tr: Yeşil Ölüm Bataklığı
uk: Болото Зеленої Смерті

source: Lair of the Scorpion King
de: Versteck des Skorpionkönigs
es: Guarida del Rey Escorpión
fr: Repaire du Roi Scorpion
it: Tana del Re Scorpione
ja: 蠍王の巣
pt: Covil do Rei Escorpião
ru: Логово Короля Скорпионов
tr: Akrep Kralın İnı
uk: Лігво Царя Скорпіонів

source: Temple of Poisoned Mists
de: Tempel des Vergifteten Nebels
es: Templo de las Nieblas Envenenadas
fr: Temple des Brumes Empoisonnées
it: Tempio delle Nebbie Velenose
ja: 毒霧の神殿
pt: Templo das Névoas Envenenadas
ru: Храм Отравленных Туманов
tr: Zehirli Sisler Tapınağı
uk: Храм Отруйних Туманів

# Pit of the Serpents Bite
source: Pit of the Serpentâ€™s Bite
de: Grube des Bisses der Schlange
es: Foso de la Mordida de la Serpiente
fr: Fosse de la Morsure du Serpent
it: Fossa del Morso del Serpente
ja: 蛇咬の淵
pt: Fosso da Mordida da Serpente
ru: Яма Змеиного Укуса
tr: Yılan Isırığı Çukuru
uk: Прірва Зміїного Укусу

source: Catacombs of the Venom Lord
de: Katakomben des Giftherrschers
es: Catacumbas del Señor del Veneno
fr: Catacombes du Seigneur du Venin
it: Catacombe del Signore del Veleno
ja: 毒の主の地下墓地
pt: Catacumbas do Senhor do Veneno
ru: Катакомбы Ядовитого Владыки
tr: Zehir Efendisinin Yeraltı Mezarları
uk: Катакомби Володаря Отрут

source: Mire of the Venomous Queen
de: Sumpfland der Giftigen Königin
es: Ciénaga de la Reina Venenosa
fr: Marécage de la Reine Toxique
it: Pantano della Regina Velenosa
ja: 毒女王の泥沼
pt: Pântano da Rainha Venenosa
ru: Топь Ядовитой Королевы
tr: Zehirli Kraliçenin Bataklığı
uk: Трясовина Отруйної Королеви

source: Temple of the Acid Rain
de: Tempel des Sauren Regens
es: Templo de la Lluvia Ácida
fr: Temple de la Pluie Acide
it: Tempio della Pioggia Acida
ja: 酸雨の神殿
pt: Templo da Chuva Ácida
ru: Храм Кислотного Дождя
tr: Asit Yağmuru Tapınağı
uk: Храм Кислотного Дощу

source: Nest of the Shadow Vipers
de: Nest der Schattenvipern
es: Nido de las Víboras de Sombra
fr: Nid des Vipères de l'Ombre
it: Nido delle Vipere d'Ombra
ja: 影の毒蛇の巣
pt: Ninho das Víbora das Sombras
ru: Гнездо Теневых Гадюк
tr: Gölge Engereklerin Yuvası
uk: Гніздо Тіньових Гадюк

source: Crypt of the Venomfang
de: Krypta des Giftreißzahns
es: Cripta del Colmillo Venenoso
fr: Crypte du Croc de Venin
it: Cripta della Zanna Velenosa
ja: 毒牙の墓所
pt: Cripta da Presa Venenosa
ru: Склеп Ядовитого Клыка
tr: Zehirdiş Mezarlığı
uk: Крипта Отруйного Ікла

source: Grove of the Poisoned Bloom
de: Hain der Vergifteten Blüte
es: Arboleda de la Flor Envenenada
fr: Bosquet de la Fleur Empoisonnée
it: Boschetto del Fiore Avvelenato
ja: 毒花の森
pt: Bosque da Flor Envenenada
ru: Роща Отравленного Цветка
tr: Zehirli Çiçek Korusu
uk: Гай Отруєного Цвіту

source: Cavern of the Toxic Tide
de: Höhle der Toxischen Flut
es: Caverna de la Marea Tóxica
fr: Caverne de la Marée Toxique
it: Caverna della Marea Tossica
ja: 毒潮の洞窟
pt: Caverna da Maré Tóxica
ru: Пещера Токсичной Волны
tr: Zehirli Gelgit Mağarası
uk: Печера Отруйної Хвилі

source: Throne of the Black Venom
de: Thron des Schwarzen Giftes
es: Trono del Veneno Negro
fr: Trône du Venin Noir
it: Trono del Veleno Nero
ja: 黒毒の玉座
pt: Trono do Veneno Negro
ru: Трон Чёрного Яда
tr: Kara Zehir Tahtı
uk: Трон Чорної Отрути

source: Sanctum of the Plague Serpent
de: Heiligtum der Pestschlange
es: Sagrario de la Serpiente de la Peste
fr: Sanctuaire du Serpent de la Peste
it: Santuario del Serpente della Peste
ja: 疫病蛇の聖域
pt: Santuário da Serpente da Praga
ru: Святилище Чумной Змеи
tr: Veba Yılanının Kutsal Alanı
uk: Святилище Чумного Змія

source: Lair of the Spider Queen
de: Versteck der Spinnenkönigin
es: Guarida de la Reina Araña
fr: Repaire de la Reine Araignée
it: Tana della Regina dei Ragni
ja: 蜘蛛の女王の巣
pt: Covil da Rainha Aranha
ru: Логово Королевы Пауков
tr: Örümcek Kraliçesinin İnı
uk: Лігво Павучої Королеви

source: Tunnel of Endless Webs
de: Tunnel der Endlosen Netze
es: Túnel de Telarañas Interminables
fr: Tunnel des Toiles Infinies
it: Tunnel delle Reti Infinite
ja: 終わりなき蜘蛛の巣の坑道
pt: Túnel das Teias Infinitas
ru: Тоннель Бесконечных Паутины
tr: Sonsuz Ağ Tüneli
uk: Тунель Нескінченних Павутин

source: Cavern of the Shadowed Silk
de: Höhle der Beschatteten Seide
es: Caverna de la Seda Sombría
fr: Caverne de la Soie Obscure
it: Caverna della Seta Oscura
ja: 影の絹の洞窟
pt: Caverna da Seda Sombria
ru: Пещера Теневого Шёлка
tr: Gölgeli İpek Mağarası
uk: Печера Затіненого Шовку

source: Nest of the Black Widow
de: Nest der Schwarzen Witwe
es: Nido de la Viuda Negra
fr: Nid de la Veuve Noire
it: Nido della Vedova Nera
ja: クロゴケグモの巣
pt: Ninho da Viúva Negra
ru: Гнездо Чёрной Вдовы
tr: Kara Dulun Yuvası
uk: Гніздо Чорної Вдови

source: Crypt of the Whispering Spiders
de: Krypta der Flüsternden Spinnen
es: Cripta de las Arañas Susurrantes
fr: Crypte des Araignées Murmurantes
it: Cripta dei Ragni Sussurranti
ja: ささやく蜘蛛の墓所
pt: Cripta das Aranhas Sussurrantes
ru: Склеп Шепчущих Пауков
tr: Fısıldayan Örümcekler Mezarlığı
uk: Крипта Шепочучих Павуків

source: Temple of the Cursed Web
de: Tempel des Verfluchten Netzes
es: Templo de la Telaraña Maldita
fr: Temple de la Toile Maudite
it: Tempio della Rete Maledetta
ja: 呪われた蜘蛛の巣の神殿
pt: Templo da Teia Amaldiçoada
ru: Храм Проклятой Паутины
tr: Lanetli Ağ Tapınağı
uk: Храм Проклятого Павутиння

source: Rift of the Colossal Spider
de: Spalt der Kolossalen Spinne
es: Grieta de la Araña Colosal
fr: Faille de l'Araignée Colossale
it: Fenditura del Ragno Colossale
ja: 巨蜘蛛の裂け目
pt: Fenda da Aranha Colossal
ru: Разлом Колоссального Паука
tr: Dev Örümceğin Yarığı
uk: Розлом Колосального Павука

source: Pit of the Eight Legs
de: Grube der Acht Beine
es: Foso de las Ocho Patas
fr: Fosse des Huit Jambes
it: Fossa delle Otto Zampe
ja: 八脚の奈落
pt: Fosso das Oito Pernas
ru: Яма Восьми Ног
tr: Sekiz Bacak Çukuru
uk: Прірва Восьми Ніг

source: Fortress of the Bloody Web
de: Festung des Blutigen Netzes
es: Fortaleza de la Telaraña Sangrienta
fr: Forteresse de la Toile Sanglante
it: Fortezza della Rete Insanguinata
ja: 血の巣の要塞
pt: Fortaleza da Teia Sangrenta
ru: Крепость Кровавой Паутины
tr: Kanlı Ağ Kalesi
uk: Фортеця Кривавого Павутиння

source: Cave of the Insect Devourer
de: Höhle des Insektenfressers
es: Cueva del Devorador de Insectos
fr: Grotte du Dévoreur d'Insectes
it: Grotta del Divoratore d'Insetti
ja: 虫喰らいの洞窟
pt: Caverna do Devorador de Insetos
ru: Пещера Пожирателя Насекомых
tr: Böcek Yiyici Mağarası
uk: Печера Пожирача Комах

source: Echoes of an Empty Throne
de: Echos eines Leeren Thrones
es: Ecos de un Trono Vacío
fr: Échos d’un Trône Vide
it: Echi di un Trono Vuoto
ja: 空の玉座の残響
pt: Masmorra da Independência
ru: Эхо Пустого Трона
tr: Boş Tahtın Yankıları
uk: Луна Порожнього Трону

source: Cosmic Portals: Fire and Ice
de: Kosmosportale: Feuer und Eis
es: Portales cósmicos: fuego y hielo
fr: Cosmoportail : Feu et glace
it: Portali cosmici: Fuoco e ghiaccio
ja: コズミック・ポータル：炎と氷
pt: Portais Cósmicos: Fogo e Gelo
ru: Космические порталы: Огонь и лёд
tr: Kozmik Portallar: Ateş ve Buz
uk: Космічні портали: Вогонь і лід
