Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/weekly-dungeons.strings
Languages: de, es, fr, it, ja, pt, ru, tr, uk

source: The Dragontooth Pits
de: Die Drachenzahngruben
es: Los Fosos del Diente del Dragón
fr: Les Fosses de la Dent du Dragon
it: Le cave del dente del drago
ja: 竜牙の巣穴
pt: A Cova do Dente de Dragão
ru: Рудник Зуба Дракона
tr: Ejderdişi Savaş Çukuru
uk: Копальні драконячої кістки

source: The Dragon Burrows
de: Die Drachenbauen
es: Las Madrigueras del Dragón
fr: Les Terriers du Dragon
it: Le tane del drago
ja: ドラゴンの洞穴
pt: Refúgio do Dragão
ru: Драконьи Норы
tr: Ejder Sığınağı
uk: Нора дракона

source: The Cave
de: Höhle
es: La Cueva
fr: La grotte
it: La Grotta
ja: ザ・ケイブ
pt: A Gruta
ru: Пещера
tr: Mağara
uk: Печера

source: Lair of the Poisoned Creature
de: Versteck der vergifteten Kreatur
es: Guarida de la Criatura Envenenada
fr: Antre de la Créature empoisonnée
it: Covo della creatura avvelenata
ja: 毒持つ怪物の巣穴
pt: Covil da Criatura Envenenada
ru: Логово ядовитой гадины
tr: Zehirli Yaratığın İni
uk: Лігво отруйної гадини

source: The Empty Lair
de: Das leere Versteck
es: La Guarida Vacía
fr: L'Antre inoccupée
it: Il covo vuoto
ja: 気配なき巣穴
pt: O Covil Vazio
ru: Пустое логово
tr: Boş İn
uk: Пусте лігво

source: The Frozen Lair
de: Das gefrorene Versteck
es: La Guarida Congelada
fr: L'Antre gelée
it: Il covo gelato
ja: 凍り付いた巣穴
pt: O Covil Congelado
ru: Замёрзшее логово
tr: Donmuş İn
uk: Змерзле лігво

source: The Sunken Lair
de: Das versunkene Versteck
es: La Guarida Hundida
fr: L'Antre engloutie
it: Il covo sommerso
ja: 水底の巣穴
pt: O Covil Submerso
ru: Затопленное логово
tr: Batmış İn
uk: Затоплене лігво

source: The Black Chambers
de: Die schwarzen Kammern
es: Las Cámaras Negras
fr: Les Chambres noires
it: Le stanze nere
ja: 漆黒黒の間
pt: As Câmaras Negras
ru: Чёрные залы
tr: Karanlık Salon
uk: Чорні зали

source: Vault of the Renegade
de: Gruft der Renegaten
es: Cúpula del Renegado
fr: Caveau du Renégat
it: Il caveau del fuorilegge
ja: 反逆者の洞穴
pt: O Cofre do Renegado
ru: Схрон изменника
tr: Kaçağın Kasası
uk: Сховище зрадника

source: The Silent Maze
de: Der stille Irrgarten
es: El Laberinto Silencioso
fr: Le Labyrinthe du silence
it: Il labirinto silenzioso
ja: 静寂の迷宮
pt: O Labirinto Silencioso
ru: Безмолвный лабиринт
tr: Sessiz Labirent
uk: Безмовний лабіринт

source: The Frost Maze
de: Der gefrorene Irrgarten
es: El Laberinto de Escarcha
fr: Le Labyrinthe gelé
it: Il labirinto gelato
ja: フロストメイズ
pt: O Labirinto de Gelo
ru: Замёрзший лабиринт
tr: Donmuş Labirent
uk: Замерзлий лабіринт

source: The Wild Tunnels
de: Die wilden Tunnel
es: Los Túneles Salvajes
fr: Les Tunnels sauvages
it: Le gallerie selvagge
ja: 未開の地下道
pt: Os túneis indomáveis
ru: Тоннели безумия
tr: Vahşi Tüneller
uk: Тунелі божевілля

source: Vault of the Infernal Breath
de: Gruft des höllischen Atems
es: Cúpula del Aliento Infernal
fr: Caveau du Souffle infernal
it: Il caveau dell'alito infernale
ja: 黄泉の風穴
pt: Câmara do Sopro Infernal
ru: Подземелье дыхания вечности
tr: Cehennem Nefesinin Mahzeni
uk: Підземелля дихання вічності

source: The Eclipse Lair
de: Eklipsenhöhle
es: La Guarida del Eclipse
fr: L'Antre de l'éclipse
it: Il covo dell'eclissi
ja: 光り消ゆ巣穴
pt: A toca do eclipse
ru: Логово затмения
tr: Ay Tutulması İni
uk: Лігво затемнення

source: The Secret Caverns
de: Die geheimen Höhlen
es: Las Cavernas Secretas
fr: Les Cavernes secrètes
it: Le caverne segrete
ja: 秘密の洞窟
pt: As cavernas secretas
ru: Тайные пещеры
tr: Gizli Mağaralar
uk: Таємні печери

source: The Secret Ice Caverns
de: Die geheimen Eishöhlen
es: Las Cavernas de Hielo Secretas
fr: Les Cavernes secrètes de glace
it: Le caverne segrete di ghiaccio
ja: 秘密の氷洞
pt: As gélidas cavernas secretas
ru: Тайные ледяные пещеры
tr: Gizli Buz Mağaraları
uk: Таємні крижані печери

source: The Bottomless Point
de: Der bodenlose Punkt
es: El Punto Sin Fondo
fr: Le Gouffre sans fond
it: Il punto senza fondo
ja: 底なしの地
pt: O ponto sem fundo
ru: Бездонный провал
tr: Dipsiz Nokta
uk: Бездонне провалля

source: Labyrinth of the Unknown
de: Labyrinth des Unbekannten
es: Laberinto de lo Desconocido
fr: Labyrinthe de l'inconnu
it: Il labirinto dell'ignoto
ja: 誰も知らぬ迷宮
pt: Labirinto do Desconhecido
ru: Лабиринт неизвестности
tr: Bilinmeyenin Labirenti
uk: Лабіринт невідомості

source: Lair of the Unknown
de: Versteck des Unbekannten
es: Guarida de lo Desconocido
fr: Antre de l'inconnu
it: Il covo dell'ignoto
ja: 謎深き巣穴
pt: A Toca do Desconhecido
ru: Логово неизвестности
tr: Bilinmeyenin Mahzeni
uk: Лігво невідомості

source: The Deep Cells
de: Die tiefen Zellen
es: Las Celdas Profundas
fr: Les Cellules des profondeurs
it: Le celle profonde
ja: 奥深き地
pt: As celas profundas
ru: Глубокие камеры
tr: Derin Hücreler
uk: Глибокі камери

source: The Burning Forest Pits
de: Die brennenden Waldgruben
es: Los Ardientes Fosos del Bosque
fr: L'Enfer brûlant de la Forêt
it: Le fosse della foresta in fiamme
ja: 燃え盛る森の巣穴
pt: A fenda da floresta em chamas
ru: Пылающие лесные копи
tr: Yanan Orman Çukurları
uk: Палаючі лісові копальні

source: The Orc Burrows
de: Die Orkbaue
es: Las Madrigueras Orcas
fr: Les Terriers des Orcs
it: I rifugi dell'orco
ja: オークの洞穴
pt: As Tocas dos Orcs
ru: Орочьи норы
tr: Ork Yuvaları
uk: Орочі нори

source: The Smoky Lair
de: Das rauchige Versteck
es: La Guarida Humeante
fr: L'Antre enfumée
it: Il covo fumoso
ja: モクモク巣穴
pt: O Covil Esfumaçado
ru: Дымное логово
tr: Dumanlı Sığınak
uk: Димне лігво

source: Point of the Scarlet Forest
de: Punkt des Scharlachroten Waldes
es: Punto del Bosque Escarlata
fr: Zone de la forêt écarlate
it: Il punto della Foresta scarlatta
ja: スカーレットフォレスト
pt: A Floresta Escarlate
ru: Чаща алого леса
tr: Kızıl Orman Noktası
uk: Хаща червоного лісу

source: The Molten Cells
de: Die geschmolzenen Zellen
es: Las Celdas Derretidas
fr: Les Cellules incandescentes
it: Le celle fuse
ja: ドロドロ基地
pt: As celas derretidas
ru: Расплавленные камеры
tr: Erimiş Hücreler
uk: Розплавлені камери

source: The Cursed Maze
de: Der verfluchte Irrgarten
es: El Laberinto Maldito
fr: Le Labyrinthe maudit
it: Il labirinto dannato
ja: 呪いの迷宮
pt: O Labirinto Amaldiçoado
ru: Проклятый лабиринт
tr: Lanetli Labirent
uk: Проклятий лабіринт

source: The Cursed Ice
de: Das verfluchte Eis
es: El Hielo Maldito
fr: La glace maudite
it: Il ghiaccio dannato
ja: カースドアイス
pt: O Gelo Amaldiçoado
ru: Заколдованный лёд
tr: Lanetli Buzul
uk: Зачарований лід

source: The Oracle Chambers
de: Die Orakelkammern
es: Las Cámaras del Oráculo
fr: Les Chambres de l'Oracle
it: Le stanze dell'oracolo
ja: 導きの間
pt: As Câmaras do Oráculo
ru: Залы оракула
tr: Kehanet Odaları
uk: Зали оракула

source: The Dragontooth Point
de: Der Drachenzahnpunkt
es: El Punto Dientedragón
fr: La zone de la Dent du Dragon
it: Il punto del dente del drago
ja: 竜牙の地
pt: O Ponto Dente de Dragão
ru: Пункт драконьего зуба
tr: Ejderha Dişi Noktası
uk: Пункт драконячого зуба

source: The Phantom Lair
de: Das Phantom-Versteck
es: La Guarida Fantasma
fr: L'Antre fantôme
it: Il covo dello spettro
ja: ファントムレア
pt: O Covil Fantasma
ru: Призрачное логово
tr: Hayalet Sığınak
uk: Примарне лігво

source: The Iron Lair
de: Das Eisen-Versteck
es: La Guarida de Hierro
fr: L'Antre de fer
it: Il covo di ferro
ja: 鉄の巣穴
pt: O Covil de Ferro
ru: Железная обитель
tr: Demir İni
uk: Залізна обитель

source: The Deadly Carnival
de: Der tödliche Karneval
es: El Carnaval Mortífero
fr: Le carnaval mortel
it: Il carnevale mortale
ja: デッドカーニバル
pt: O Carnaval Mortal
ru: Карнавал смерти
tr: Ölümcül Karnaval
uk: Карнавал смерті

source: The Temple of Light
de: Der Tempel des Lichts
es: El Templo de la Luz
fr: Le temple de la lumière
it: Il tempio della luce
ja: 光の寺院
pt: O Templo da Luz
ru: Храм света
tr: Işık Tapınağı
uk: Храм світла

source: The Earth Empire
de: Das Erdreich
es: El Imperio de Tierra
fr: L'empire de la terre
it: Il tempio della terra
ja: 大地の帝国
pt: O Império da Terra
ru: Империя земли
tr: Dünya İmparatorluğu
uk: Імперія землі

source: The Magic Remembrance
de: Die magische Erinnerung
es: La Remembranza Mágica
fr: Le souvenir magique
it: La commemorazione magica
ja: 魔法の記憶
pt: As Lembranças Mágicas
ru: Волшебное воспоминание
tr: Sihirli Anma
uk: Чарівний спогад

source: The Last Monastery
de: Das letzte Kloster
es: El Último Monasterio
fr: Le dernier monastère
it: L'ultimo monastero
ja: 終末の修道院
pt: O Último Mosteiro
ru: Последняя обитель
tr: Son Manastır
uk: Остання обитель

source: The Legend Of The Phoenix
de: Die Legende des Phönix
es: La Leyenda del Fénix
fr: La légende du Phœnix
it: La leggenda della fenice
ja: レジェンドオブフェニックス
pt: A Lenda da Fênix
ru: Легенда о Фениксе
tr: Ankanın Efsanevi
uk: Легенда про Фенікса

source: Unity Makes Us Stronger
de: Einheit macht uns stärker
es: La Unidad Nos Hace Más Fuertes
fr: L'union fait la force
it: L'unione fa la forza
ja: 絆こそ強さ
pt: A União Faz a Força
ru: Вместе мы сила
tr: Birlik Bizi Güçlendirir
uk: Разом ми сила

source: The Illusion of St. John
de: Die Illusion von St. John
es: La Ilusión de San Juan
fr: L'illusion de Saint Jean
it: L'illusione di san Giovanni
ja: セイントジョンの幻惑
pt: A Ilusão de São João
ru: Иллюзия Св. Иоанна
tr: Aziz John İllüzyonu
uk: люзія Св. Іоанна

source: The Temple Of Anubis
de: Der Tempel von Anubis
es: El Templo de Anubis
fr: Le temple d'Anubis
it: Il tempio di Anubi
ja: アヌビスの神殿
pt: O Templo de Anúbis
ru: Храм Анубиса
tr: Anubis Tapınağı
uk: Храм Анубіса

source: The Pantheon's Bloodlust
de: Die Blutlust des Pantheons
es: La Sed de Sangre del Panteón
fr: La soif de sang du Panthéon
it: La sete di sangue del pantheon
ja: 血に飢えたパンテオン
pt: A Sede de Sangue do Panteão
ru: Кровожадность Пантеона
tr: Pantheon'un Kançukuru
uk: Кровожерливість Пантеону

source: Circus of Horrors
de: Zirkus des Horrors
es: Circo de los Horrores
fr: Le cirque des horreurs
it: Il circo degli orrori
ja: ホラーサーカス
pt: Circo dos Horrores
ru: Круг ужасов
tr: Korku Sirki
uk: Коло жахів

source: Horror on the Ghost Ship
de: Horror auf dem Geisterschiff
es: Terror en el Barco Fantasma
fr: Effroi sur le bateau fantôme
it: L'orrore della nave fantasma
ja: 恐怖の幽霊船
pt: Terror no Navio Fantasma
ru: Кошмар на корабле-призраке
tr: Korkunç Hayalet Gemi
uk: Кошмар на кораблі-привиді

source: The Dark Nightmare
de: Der dunkle Albtraum
es: La Pesadilla Oscura
fr: Le sinistre cauchemar
it: L'incubo oscuro
ja: 暗き悪夢
pt: O Pesadelo Sombrio
ru: Тёмный кошмар
tr: Kara Kabus
uk: Темний кошмар

source: Dungeon of the Poisoned King
de: Dungeon des vergifteten Königs
es: Mazmorra del Rey Envenenado
fr: Donjon du Roi empoisonné
it: Il sotterraneo del re avvelenato
ja: ポイズンキングダンジョン
pt: Calabouço do Rei Envenenado
ru: Подземелье отравленного короля
tr: Zehirlenmiş Kralın Zindanı
uk: Підземелля отруєного короля

source: The Witch Of The Crimson Forest
de: Die Hexe des Purpurwaldes
es: La Bruja del Bosque Carmesí
fr: La Sorcière de la forêt pourpre
it: La strega della foresta cremisi
ja: クリムゾンフォレストの魔女
pt: A Bruxa da Floresta Carmesim
ru: Ведьма багрового леса
tr: Kızıl Ormanın Cadısı
uk: Відьма багряного лісу

source: Ruins Of Icarus
de: Ruinen von Ikarus
es: Ruinas de Ícaro
fr: Ruines d'Icarus
it: Le rovine di Icaro
ja: イカルスの遺産
pt: Ruínas de Ícaro
ru: Руины Икара
tr: Icarus Harabeleri
uk: Руїни Ікара

source: Magic New Year's
de: Magisches Silvester
es: Año Nuevo Mágico
fr: Nouvel an magique
it: Magico anno nuovo
ja: マジックニューイヤー
pt: Ano Novo Mágico
ru: Волшебный Новый год
tr: Sihirli Yeni Yıl
uk: Чарівний Новий рік

source: The Frozen Crystal
de: Der gefrorene Kristall
es: El Cristal Congelado
fr: Le cristal gelé
it: Il cristallo ghiacciato
ja: 凍り付いたクリスタル
pt: O Cristal Congelado
ru: Замёрзший кристалл
tr: Donmuş Kristal
uk: Замерзлий кристал

source: The Forbidden Frozen Mountain
de: Der verbotene gefrorene Berg
es: La Montaña Congelada Prohibida
fr: La montagne gelée interdite
it: La montagna ghiacciata proibita
ja: 禁じられた氷山
pt: A Montanha Congelada Proibida
ru: Запретная ледяная гора
tr: Yasak Donmuş Dağ
uk: Заборонена крижана гора

source: The Tormented Snow
de: Der gequälte Schnee
es: La Nieve Atormentada
fr: Les neiges tourmentées
it: La neve tormentata
ja: 苦しみの雪
pt: A Neve Atormentada
ru: Измученный снег
tr: Acı Dolu Kar
uk: Змучений сніг

source: Lair of Freezing Hallucination
de: Versteck der eiskalten Halluzination
es: Guarida de Alucinación Gélida
fr: Antre de l'hallucination glaciale
it: Il covo dell'allucinazione glaciale
ja: 凍てる幻の巣穴
pt: Covil da Alucinação Congelante
ru: Логово ледяных галлюцинаций
tr: Dondurucu Halüsinasyon İni
uk: Лігво крижаних галюцинацій

source: Savage Ice Pit
de: Wilde Eisgrube
es: Foso de Hielo Salvaje
fr: Puits de glace sauvage
it: Fossa di ghiaccio selvaggia
ja: 慈悲なき氷穴
pt: Poço de Gelo Selvagem
ru: Ледяная яма
tr: Vahşi Buz Çukuru
uk: Льодяна яма

source: Abyss of the Dark Sigh
de: Abgrund des dunklen Seufzers
es: Abismo del Último Suspiro
fr: Abysse du Soupir sinistre
it: Abisso del sospiro oscuro
ja: 闇の息の深淵
pt: Abismo do Suspiro Sombrio
ru: Пропасть мрачных вздохов
tr: Karanlık Ahtın Uçurumu
uk: Прірва похмурих зітхань

source: Cave of Lost Spirits
de: Höhle der verlorenen Geister
es: Cueva de los Espíritus Perdidos
fr: Grotte des Esprits égarés
it: Caverna degli spiriti perduti
ja: 失われた魂の洞窟
pt: Caverna dos Espíritos Perdidos
ru: Пещера заблудших духов
tr: Kayıp Ruhların Mağarası
uk: Печера загублених духів

source: Labyrinth of Damnation
de: Labyrinth der Verdammnis
es: Laberinto de la Condenación
fr: Labyrinthe de la Damnation
it: Labirinto della dannazione
ja: 破滅の迷宮
pt: Labirinto da Condenação
ru: Лабиринт погибели
tr: Lanet Labirenti
uk: Лабіринт загибелі

source: Grotto of the Cursed Dragon
de: Grotte des verfluchten Drachen
es: Gruta del Dragón Maldito
fr: Grotte du Dragon maudit
it: Grotta del drago maledetto
ja: 呪竜の洞穴
pt: Gruta do Dragão Maldito
ru: Грот проклятого дракона
tr: Lanetli Ejderhanın Mağarası
uk: Грот проклятого дракона

source: Tower of Arcane Storm
de: Turm des arkanen Sturms
es: Torre de la Tormenta Arcana
fr: Tour de la Tempête impénétrable
it: Torre della tempesta arcana
ja: 神風の塔
pt: Torre da Tormenta Arcana
ru: Башня магического шторма
tr: Esrarlı Fırtına Kulesi
uk: Вежа магічного шторму

source: Lich's Profane Den
de: Lichs profane Höhle
es: Cubil Profano del Lich
fr: Antre profane de la Liche
it: Tana profana dei defunti
ja: リッチの邪穴
pt: Covil do Lich Profano
ru: Осквернённое логово Лича
tr: Ölümsüzün Saygısız Mağarası
uk: Осквернене лігво Ліча

source: Hall of Tormented Souls
de: Halle der gequälten Seelen
es: Salón de las Almas Atormentadas
fr: Salle des Âmes tourmentées
it: Sala delle anime tormentate
ja: 苦魂の穴
pt: Salão das Almas Atormentadas
ru: Зал измученных душ
tr: Eziyet Çekmiş Ruhlar Salonu
uk: Зала змучених душ

source: Cave of Eternal Ice
de: Höhle des ewigen Eises
es: Cueva del Hielo Eterno
fr: Grotte des glaces éternelles
it: Caverna del ghiaccio eterno
ja: 無尽氷の洞窟
pt: Caverna do Gelo Eterno
ru: Пещера нетающих льдов
tr: Ebedi Buz Mağarası
uk: Печера нетанучого льоду

source: Tomb of the Frozen Marsh
de: Grab der gefrorenen Marsch
es: Tumba de la Marisma Congelada
fr: Mausolée du marécage gelé
it: Tomba della palude ghiacciata
ja: 氷沼の墓
pt: Tumba do Pântano Congelado
ru: Гробница замёрзшего болота
tr: Donmuş Bataklık Mezarı
uk: Гробниця замерзлого болота

source: Chamber of the Icy Marsh
de: Kammer der Eismarsch
es: Cámara de la Marisma Gélida
fr: Chambre du marécage gelé
it: Stanza della palude gelata
ja: 凍沼の間
pt: Câmara do Gélido Pântano
ru: Зал ледяного болота
tr: Buzul Bataklık Odası
uk: Зал крижаного болота

source: Glacial Abyss of the Marsh
de: Gletscherabgrund der Marsch
es: Abismo Glacial de la Marisma
fr: Abysses glaciales du marécage
it: Abisso glaciale della palude
ja: 凍てつく沼の淵
pt: Abismo Glacial do Pântano
ru: Пропасть замёрзшего болота
tr: Bataklığın Buzul Uçurumu
uk: Прірва замерзлого болота

source: Crypt of the Frosty Marsh
de: Krypta der Frostmarsch
es: Cripta de la Marisma Escarchada
fr: Crypte du marécage gelé
it: Cripta della palude gelida
ja: 氷沼の霊廟
pt: Cripta do Pântano Gélido
ru: Склеп морозного болота
tr: Ayaz Bataklığın Mahzeni
uk: Склеп морозного болота

source: Labyrinth of Cursed Ice
de: Labyrinth des verfluchten Eises
es: Laberinto del Hielo Maldito
fr: Labyrinthe des glaces maudites
it: Labirinto del ghiaccio maledetto
ja: 呪氷の迷宮
pt: Labirinto do Gelo Amaldiçoado
ru: Лабиринт проклятого льда
tr: Lanetli Buz Labirenti
uk: Лабіринт проклятого льоду

source: Den of the Lord of the Icy Marsh
de: Höhle des Herrn der Eismarsch
es: Cubil del Señor de la Marisma Gélida
fr: Antre du Seigneur du marécage gelé
it: Tana del Signore della palude gelata
ja: 氷沼王の洞穴
pt: Covil do Senhor do Pântano Gélido
ru: Логово повелителя ледяного болота
tr: Buzul Bataklığın Efendisinin İni
uk: Лігво повелителя крижаного болота

source: Grotto of Frozen Shadows
de: Grotte der gefrorenen Schatten
es: Gruta de las Sombras Congeladas
fr: Grotte des Ombres gelées
it: Grotta delle ombre ghiacciate
ja: 凍影の洞穴
pt: Gruta das Sombras Congeladas
ru: Грот ледяных теней
tr: Donmuş Gölgeler Mağarası
uk: Грот крижаних тіней

source: Tower of Marshy Ice
de: Turm aus sumpfigem Eis
es: Torre del Hielo Marismeño
fr: Tour des glaces marécageuses
it: Torre del ghiaccio paludoso
ja: 氷沼の塔
pt: Torre do Gelo Pantanoso
ru: Башня ледяного болота
tr: Buzul Bataklık Kulesi
uk: Вежа крижаного болота

source: Den of Scavenger Spiders
de: Höhle der Aasfresserspinnen
es: Cubil de las Arañas Carroñeras
fr: Antre des Araignées charognardes
it: Tana dei ragni saprofagi
ja: おそうじスパイダーの洞穴
pt: Covil das Aranhas Carniçeiras
ru: Логово пауков-падальщиков
tr: Leş Yiyen Örümceklerin Yuvası
uk: Лігво павуків-падальщиків

source: Web of the Arachnid Queen
de: Netz der Spinnentierkönigin
es: Telaraña de la Reina Arácnida
fr: Toile de la Reine des Arachnides
it: Ragnatela della regina aracnide
ja: 女王グモの糸
pt: Teia da Rainha Aracnídea
ru: Паутина королевы арахнидов
tr: Araknid Kraliçesinin Ağı
uk: Павутина королеви арахнідів

source: Labyrinth of Cursed Arachnids
de: Labyrinth der verfluchten Spinnentiere
es: Laberinto de los Arácnidos Malditos
fr: Labyrinthe des Arachnides maudites
it: Labirinto degli aracnidi maledetti
ja: 呪われたクモの迷宮
pt: Labirinto dos Aracnídeos Malditos
ru: Лабиринт проклятых арахнидов
tr: Lanetli Araknidlerin Labirenti
uk: Лабіринт проклятих арахнідів

source: Lair of Venomous Scorpions
de: Versteck der giftigen Skorpione
es: Guarida de los Escorpiones Venenosos
fr: Antre des Scorpions venimeux
it: Covo degli scorpioni velenosi
ja: 毒サソリの巣穴
pt: Toca dos Escorpiões Venenosos
ru: Логово ядовитых скорпионов
tr: Zehirli Akreplerin Yuvasıs
uk: Лігво отруйних скорпіонів

source: Cave of Eight-Legged Dark Beings
de: Höhle der achtbeinigen dunklen Wesen
es: Cueva de Seres Oscuros de Ocho Patas
fr: Grotte des Créatures sombres à huit pattes
it: Caverna degli esseri oscuri dalle otto zampe
ja: 八本脚悪魔の洞窟
pt: Caverna dos Seres Sombrios de Oito Pernas
ru: Пещера восьминогих порождений тьмы
tr: Sekiz Bacaklı Karanlık Varlıklar Mağarası
uk: Печера восьминогих породжень пітьми

source: Chamber of Vampiric Arachnids
de: Kammer der vampirischen Spinnentiere
es: Cámara de los Arácnidos Vampíricos
fr: Chambre des Arachnides vampiriques
it: Stanza degli aracnidi vampirici
ja: 吸血グモの巣
pt: Câmara dos Aracnídeos Vampíricos
ru: Палата арахнидов-вампиров
tr: Vampir Arachnids Odası
uk: Палата арахнідів-вампірів

source: Hideout of Weaver Spiders
de: Versteck der Weberspinnen
es: Escondrijo de las Arañas Tejedoras
fr: Repaire des Araignées tisseuses
it: Nascondiglio dei ragni tessitori
ja: 糸編みグモの隠れ家
pt: Esconderijo das Aranhas Tecedoras
ru: Обитель пауков-ткачей
tr: Dokumacı Örümceklerin Saklanma Noktası
uk: Обитель павуків-ткачів

source: Den of Ancestral Arachnids
de: Höhle der Ahnenspinnentiere
es: Cubil de los Arácnidos Ancestrales
fr: Antres des Arachnides ancestrales
it: Tana degli aracnidi ancestrali
ja: ご先祖グモの洞穴
pt: Antro dos Aracnídeos Ancestrais
ru: Логово древних арахнидов
tr: Araknik Ataların Yuvası
uk: Лігво прадавніх арахнідів

source: Sanctuary of Arachnomancy
de: Heiligtum der Arachnomantie
es: Santuario de la Aracnomancia
fr: Sanctuaire de l'Arachnomancie
it: Santuario dell'aracnomachia
ja: 蛛形の聖域
pt: Santuário da Aracnomancia
ru: Святилище Арахномантии
tr: Araknomani Tapınağı
uk: Святилище Арахномантії

source: Abyss of Blazing Flames
de: Abgrund der lodernden Flammen
es: Abismo de las Llamas Ardientes
fr: Abysse des Flammes ardentes
it: Abisso delle fiamme ardenti
ja: まばゆい炎の奈落
pt: Abismo das Chamas Ardentes
ru: Пропасть пылающего пламени
tr: Kor Alevlerin Uçurumu
uk: Прірва палаючого полум'я

source: Infernal Volcanic Cave
de: Höllische Vulkanhöhle
es: Cueva Volcánica Infernal
fr: Grotte volcanique infernale
it: Caverna vulcanica infernale
ja: 冥火の洞窟
pt: Caverna Vulcânica Infernal
ru: Адская вулканическая пещера
tr: Volkanik Cehennem Mağarası
uk: Пекельна вулканічна печера

source: Tomb of the Fire Dragon
de: Grab des Feuerdrachen
es: Tumba del Dragón de Fuego
fr: Mausolée du Dragon de feu
it: Tomba del drago di fuoco
ja: 火竜の墓
pt: Tumba do Dragão de Fogo
ru: Гробница огненного дракона
tr: Ateş Ejderinin Mezarı
uk: Гробниця вогняного дракона

source: Den of the Fiery Elemental
de: Höhle des feurigen Elementars
es: Cubil del Elemental Ígneo
fr: Antre de l'Élémentaire ardent
it: Tana dell'elementale impetuoso
ja: 火元素の洞穴
pt: Covil do Elemental Ígneo
ru: Логово огненного элементаля
tr: Ateşli Elementlerin Mağarası
uk: Лігво вогняного елементаля

source: Chamber of Blazing Hell
de: Kammer der lodernden Hölle
es: Cámara del Infierno Ardiente
fr: Chambre de l'Enfer ardent
it: Camera dell'inferno fiammante
ja: 火炎地獄の間
pt: Câmara do Inferno Flamejante
ru: Адская камера
tr: Alevli Cehennem Odası
uk: Пекельна камера

source: Labyrinth of Purgatory Lava
de: Labyrinth der Purgatorium-Lava
es: Laberinto de la Lava del Purgatorio
fr: Labyrinthe de la Lave du Purgatoire
it: Labirinto della lava del purgatorio
ja: 煉獄の迷宮
pt: Labirinto da Lava Purgatória
ru: Чистилище лавы
tr: Araf Lav Labirenti
uk: Чистилище лави

source: Hall of Incandescent Demons
de: Halle der glühenden Dämonen
es: Salón de los Demonios Incandescentes
fr: Salle des Démons incandescents
it: Sala dei demoni incandescenti
ja: 白熱悪鬼の間
pt: Salão dos Demônios Incandescentes
ru: Зал раскалённых демонов
tr: Akkor Şeytanlar Salonu
uk: Зала палаючих демонів

source: Grotto of the Underground Volcano
de: Grotte des unterirdischen Vulkans
es: Gruta del Volcán Subterráneo
fr: Grotte du Volcan souterrain
it: Grotta del vulcano sotterraneo
ja: 地下火山の洞穴
pt: Gruta do Vulcão Subterrâneo
ru: Грот подземного вулкана
tr: Yeraltı Volkanı Mağarası
uk: Грот підземного вулкана

source: Tower of the Doomed Furnace
de: Turm des verdammten Ofens
es: Torre del Horno Infausto
fr: Tour de la Fournaise maudite
it: Torre della fornace sventurata
ja: 破滅炉の塔
pt: Torre da Fornalha da Perdição
ru: Башня печи судьбы
tr: Lanetli Fırın Kulesi
uk: Вежа печі долі

source: Abyss of Eternal Damnation
de: Abgrund der ewigen Verdammnis
es: Abismo de la Condenación Eterna
fr: Abysse de la Damnation éternelle
it: Abisso della dannazione eterna
ja: 永遠断罪の深淵
pt: Abismo da Condenação Eterna
ru: Бездна вечного проклятия
tr: Ebedi Lanet Uçurumu
uk: Безодня вічного прокляття

source: Crypt of the Profane Awakening
de: Krypta des profanen Erwachens
es: Cripta del Despertar Profano
fr: Crypte de l'Éveil du Profane
it: Cripta del risveglio profano
ja: 悪目覚める地下聖堂
pt: Cripta do Profano Despertar
ru: Осквернённый склеп пробуждения
tr: Saygısız Uyanışın Mahzeni
uk: Осквернений склеп пробудження

source: Den of the Dark Abyss
de: Höhle des dunklen Abgrunds
es: Cubil del Abismo Oscuro
fr: Antre des Abysses obscures
it: Tana dell'abisso oscuro
ja: 闇の底の洞穴
pt: Covil do Abismo Obscuro
ru: Логово тёмной пучины
tr: Karanlık Uçurumun Mağarası
uk: Лігво темної безодні

source: Chamber of Profaned Souls
de: Kammer der frevelhaften Seelen
es: Cámara de las Almas Profanadas
fr: Chambre des Âmes profanées
it: Camera degli spiriti profani
ja: 不浄魂の間
pt: Câmara das Almas Profanadas
ru: Зал осквернённых душ
tr: Saygısız Ruhlar Odası
uk: Зала сплутаних душ
