Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/weekly-dungeons.strings
Languages: de, es, fr, it, ja, pt, ru, tr, uk

source: Labyrinth of the Endless Abyss
de: Labyrinth des endlosen Abgrunds
es: Laberinto del Abismo Sinfín
fr: Labyrinthe des Abysses infinies
it: Labirinto dell'abisso infinito
ja: 終わらぬ混沌の迷宮
pt: Labirinto do Abismo Sem Fim
ru: Бескрайний лабиринт бездны
tr: Sonsuz Uçurumun Labirenti
uk: Безкрайній лабіринт безодні

source: Grotto of Deep Lamentations
de: Grotte der tiefen Wehklagen
es: Gruta de las Grandes Lamentaciones
fr: Grotte des Lamentations profondes
it: Grotta dei lamenti profondi
ja: 深き悲哀の洞穴
pt: Gruta das Lamentações Profundas
ru: Грот глубоких рыданий
tr: Derin Ağıtlar Mağarası
uk: Грот глибоких ридань

source: Tomb of Fallen Gods
de: Grab der gefallenen Götter
es: Tumba de los Dioses Caídos
fr: Mausolée des Dieux déchus
it: Tomba degli Dei caduti
ja: 堕神の墓
pt: Tumba dos Deuses Caídos
ru: Гробница павших богов
tr: Düşmüş Tanrıların Mezarı
uk: Гробниця полеглих богів

source: Tower of Abyssal Storm
de: Turm des Abgrundsturms
es: Torre de la Tormenta Abisal
fr: Tour de la Tempête abyssale
it: Torre della tempesta abissale
ja: 極嵐の塔
pt: Torre da Tormenta Abissal
ru: Башня безбрежного шторма
tr: Dipsiz Fırtına Kulesi
uk: Вежа неосяжного шторму

source: Cave of the Unfathomable Abyss
de: Höhle des unergründlichen Abgrunds
es: Cueva del Abismo Insondable
fr: Grotte des Abysses insondables
it: Caverna dell'abisso insondabile
ja: 果てしなき深淵の洞窟
pt: Caverna do Abismo Insondável
ru: Пещера бездонной пропасти
tr: Anlaşılmaz Uçurumun Mağarası
uk: Печера бездонного провалля

source: Cave of Orc Warriors
de: Höhle der Orkkrieger
es: Cueva de los Guerreros Orcos
fr: Grotte des Guerriers Orcs
it: Caverna dei guerrieri orchi
ja: オークウォーリアーの洞窟
pt: Caverna dos Guerreiros Orc
ru: Пещера орков-воинов
tr: Ork Savaşçıları Mağarası
uk: Печера орків-воїнів

source: Den of Devouring Orcs
de: Höhle der verschlingenden Orks
es: Cubil de los Orcos Devoradores
fr: Antre des Orcs affamés
it: Tana degli orchi divoratori
ja: むさぼるオークの洞穴
pt: Toca dos Orcs Devoradores
ru: Логово орков-людоедов
tr: Acıkmış Orkların İni
uk: Лігво орків-людожерів

source: Lair of Wild Ogres
de: Versteck der wilden Oger
es: Guarida de los Ogros Salvajes
fr: Antre des Ogres sauvages
it: Covo degli orchi selvaggi
ja: 野放しオーガの巣穴
pt: Covil dos Ogros Selvagens
ru: Логово диких огров
tr: Vahşi Ogrelerin İni
uk: Лігво диких огрів

source: Chamber of Dark Orcs
de: Kammer der dunklen Orks
es: Cámara de los Orcos Oscuros
fr: Chambre des Orcs sombres
it: Camera degli orchi oscuri
ja: ダークオークの間
pt: Câmara dos Orcs Sombrios
ru: Палата тёмных орков
tr: Kara Orklar Odası
uk: Палата темних орків

source: Fortress of Marsh Ogres
de: Festung der Marschoger
es: Fortaleza de los Ogros de la Marisma
fr: Forteresse des Ogres du marécage
it: Fortezza degli orchi di palude
ja: 沼オーガの砦
pt: Fortaleza dos Ogros do Pântano
ru: Крепость болотных огров
tr: Bataklık Ogrelerinin İni
uk: Фортеця болотних огрів

source: Labyrinth of Mountain Orcs
de: Labyrinth der Bergorks
es: Laberinto de los Orcos de la Montaña
fr: Labyrinthe des Orcs de la montagne
it: Labirinto degli orchi di montagna
ja: マウンテンオークの迷宮
pt: Labirinto dos Orcs da Montanha
ru: Лабиринт горных орков
tr: Dağ Orklarınının Labirenti
uk: Лабіринт гірських орків

source: Grotto of Enraged Ogres
de: Grotte der wütenden Oger
es: Gruta de los Ogros Iracundos
fr: Grotte des Ogres enragés
it: Grotta degli orchi inferociti
ja: 怒れるオーガの洞穴
pt: Gruta dos Ogros Enfurecidos
ru: Грот разъярённых огров
tr: Öfkeli Devler Mağarası
uk: Грот розлючених огрів

source: Abyss of Renegade Orcs
de: Abgrund der abtrünnigen Orks
es: Abismo de los Orcos Renegados
fr: Abysse des Orcs renégats
it: Abisso degli orchi rinnegati
ja: 裏切りオークの間
pt: Abismo dos Orcs Renegados
ru: Пропасть орков-отступников
tr: Hain Orkların Uçurumu
uk: Прірва орків-відступників

source: Den of Night Ogres
de: Höhle der Nachtoger
es: Cubil de los Ogros Nocturnos
fr: Antre des Ogres de la nuit
it: Tana degli orchi notturni
ja: ナイトオーガの巣穴
pt: Antro dos Ogros da Noite
ru: Логово ночных огров
tr: Gece Ogrelerinin Mağarası
uk: Лігво нічних огрів

source: Tomb of Relentless Cold
de: Grab der gnadenlosen Kälte
es: Tumba del Frío Implacable
fr: Mausolée du Froid implacable
it: Tomba del freddo inesorabile
ja: 極寒の墓地
pt: Tumba do Frio Implacável
ru: Гробница неослабевающего холода
tr: Acımasız Soğuk Mezarlığı
uk: Гробниця неослабного холоду

source: Vault of the Deep Glacier
de: Tresor des Tiefengletschers
es: Cámara del Glaciar Profundo
fr: Caveau du Glacier profond
it: Cripta del ghiacciaio profondo
ja: 深き氷河の間
pt: Abóbada do Glaciar Profundo
ru: Свод глубинного ледника
tr: Derin Buzulun Kasası
uk: Склепіння глибинного льодовика

source: Den of the Icy Guardian
de: Höhle des Eiswächters
es: Cubil del Guardián Gélido
fr: Antre du Gardien des glaces
it: Tana del guardiano gelido
ja: 凍てる守護者の洞穴
pt: Covil do Guardião Gélido
ru: Логово ледяного хранителя
tr: Buzul Muhafızın Mağarası
uk: Лігво крижаного хранителя

source: Labyrinth of Infinite Snow
de: Labyrinth aus unendlichem Schnee
es: Laberinto de la Nieve Infinita
fr: Labyrinthe de la Neige éternelle
it: Labirinto della neve infinita
ja: 降り続く雪の迷宮
pt: Labirinto da Neve Infinita
ru: Лабиринт бесконечных снегов
tr: Sonsuz Kar Labirenti
uk: Лабіринт нескінченних снігів

source: Chamber of Immortal Ice
de: Kammer des unsterblichen Eises
es: Cámara del Hielo Inmortal
fr: Chambre des Glaces éternelles
it: Camera del ghiaccio immortale
ja: 解けぬ氷の間
pt: Câmara do Gelo Imortal
ru: Зал бессмертного льда
tr: Ölümsüz Buz Odası
uk: Зала вічного льоду

source: Grotto of Frozen Dawn
de: Grotte der gefrorenen Morgenröte
es: Gruta del Amanecer Congelado
fr: Grotte de l'Aube glacée
it: Grotta dell'alba di ghiaccio
ja: 凍朝の洞穴
pt: Gruta da Aurora Congelada
ru: Грот застывшего рассвета
tr: Donmuş Şafak Mağarası
uk: Грот застиглого світанку

source: Fortress of Eternal Winter
de: Festung des ewigen Winters
es: Fortaleza del Invierno Eterno
fr: Forteresse de l'Hiver éternel
it: Fortezza dell'eterno inverno
ja: 終わらぬ冬の要塞
pt: Fortaleza do Inverno Eterno
ru: Крепость вечной зимы
tr: Ebedi Kış Kalesi
uk: Фортеця вічної зими

source: Abyss of Icy Shadows
de: Abgrund der eisigen Schatten
es: Abismo de las Sombras Gélidas
fr: Abysse des Ombres des glaces
it: Abisso delle ombre fredde
ja: 氷影の深み
pt: Abismo das Sombras Gélidas
ru: Пучина ледяных теней
tr: Buzul Gölgelerin Uçurumu
uk: Безодня крижаних тіней

source: Hall of Snowstorms
de: Halle der Schneestürme
es: Salón de las Ventiscas
fr: Salle des Tempêtes de neige
it: Stanza delle bufere di neve
ja: 吹雪の間
pt: Salão das Tempestades de Neve
ru: Зал снежных бурь
tr: Kar Fırtınaları Salonu
uk: Зал снігових вихорів

source: The Haunted Sewers
de: Die Verfluchten Abwasserkanäle
es: Las Alcantarillas Embrujadas
fr: Les Égouts Hantés
it: Le Fogne Infestate
ja: 呪われた下水道
pt: Os Esgotos Assombrados
ru: Проклятые Канализации
tr: Lanetlenmiş Kanalizasyonlar
uk: Зачаровані Каналізації

source: Ashen Dragon's Rest
de: Ruhe des Aschedrachen
es: Reposo del dragón cinéreo
fr: Le repos du dragon couleur cendres
it: Il riposo del drago livido
ja: 灰色ドラゴンの安息所
pt: O Descanso do Dragão Cinzento
ru: Обитель пепельного дракона
tr: Kül Ejderi'nin İni
uk: Обитель попелястого дракона

source: Cosmic Portals: Void Abyss
de: Kosmosportale: Leerenabgrund
es: Portales cósmicos: abismo vacío
fr: Cosmoportail : Gouffre du néant
it: Portali cosmici: Abisso del vuoto
ja: コズミック・ポータル：虚無の深淵
pt: Portais Cósmicos: Abismo do Vazio
ru: Космические порталы: Бездна
tr: Kozmik Portallar: Hiçlik Uçurumu
uk: Космічні портали: Безодня

source: Crypt of Eternal Flames
de: Krypta der Ewigen Flammen
es: Cripta de las Llamas Eternas
fr: Crypte des Flammes Éternelles
it: Cripta delle Fiamme Eterne
ja: 永炎の地下墓地
pt: Cripta das Chamas Eternas
ru: Склеп Вечных Пламён
tr: Sonsuz Alevler Mezarlığı
uk: Крипта Вічного Полум'я

source: Forge of the Crimson Dragon
de: Schmiede des Karmesinroten Drachen
es: Forja del Dragón Carmesí
fr: Forge du Dragon Cramoisi
it: Fucina del Drago Cremisi
ja: 紅竜の炉
pt: Forja do Dragão Carmesim
ru: Кузня Багрового Дракона
tr: Kızıl Ejderhanın Ocağı
uk: Кузня Багряного Дракона

source: Sanctuary of Living Magma
de: Zuflucht des Lebendigen Magmas
es: Santuario del Magma Viviente
fr: Sanctuaire du Magma Vivant
it: Santuario del Magma Vivente
ja: 生きたマグマの聖域
pt: Santuário do Magma Vivo
ru: Святилище Живой Магмы
tr: Yaşayan Magma Mabedi
uk: Святилище Живої Магми

source: Abyss of Black Embers
de: Abgrund der Schwarzen Glut
es: Abismo de las Brasas Negras
fr: Abysses des Braises Noires
it: Abisso delle Braci Nere
ja: 黒き残り火の深淵
pt: Abismo de Brasas Negras
ru: Бездна Чёрных Углей
tr: Kara Közlerin Uçurumu
uk: Безодня Чорного Жариння

source: Tower of Ancestral Fire
de: Turm des Urahnenfeuers
es: Torre del Fuego Ancestral
fr: Tour du Feu Ancestral
it: Torre del Fuoco Ancestrale
ja: 祖なる炎の塔
pt: Torre do Fogo Ancestral
ru: Башня Родового Огня
tr: Ata Ateşi Kulesi
uk: Вежа Прадавнього Вогню

source: Cavern of Burning Ashes
de: Höhle der Brennenden Asche
es: Caverna de las Cenizas Ardientes
fr: Caverne des Cendres Ardentes
it: Caverna delle Ceneri Ardenti
ja: 燃え尽きた灰の洞窟
pt: Caverna das Cinzas Ardentes
ru: Пещера Пылающего Пепла
tr: Yanan Küllerin Mağarası
uk: Печера Палаючого Попелу

source: Throne of the Lava Tyrant
de: Thron des Lavatyrrannen
es: Trono del Tirano de Lava
fr: Trône du Tyran de Lave
it: Trono del Tiranno di Lava
ja: 溶岩の暴君の玉座
pt: Trono do Tirano de Lava
ru: Трон Лавового Тирана
tr: Lava Tiranının Tahtı
uk: Трон Лавового Тирана

source: Blazing Catacombs
de: Lodernde Katakomben
es: Catacumbas Llameantes
fr: Catacombes Enflammées
it: Catacombe Fiammeggianti
ja: 猛火のカタコンベ
pt: Catacumbas em Chamas
ru: Пылающие Катакомбы
tr: Alevli Yeraltı Mezarları
uk: Палаючі Катакомби

source: Volcano of Endless Wrath
de: Vulkan des Endlosen Zorns
es: Volcán de la Ira Infinita
fr: Volcan de la Colère Éternelle
it: Vulcano dell'Ira Infinita
ja: 無限の怒りの火山
pt: Vulcão da Fúria Infinita
ru: Вулкан Бесконечного Гнева
tr: Sonsuz Öfke Yanardağı
uk: Вулкан Нескінченного Гніву

source: Labyrinth of Scorching Walls
de: Labyrinth der Sengenden Wände
es: Laberinto de Muros Abrasadores
fr: Labyrinthe des Murs Brûlants
it: Labirinto delle Mura Rovianti
ja: 灼熱の壁の迷宮
pt: Labirinto das Paredes Escaldantes
ru: Лабиринт Обжигающих Стен
tr: Yakıcı Duvarlar Labirenti
uk: Лабіринт Палаючих Стін

source: Fortress of Eternal Ice
de: Festung des Ewigen Eises
es: Fortaleza del Hielo Eterno
fr: Forteresse de Glace Éternelle
it: Fortezza del Ghiaccio Eterno
ja: 永久氷の要塞
pt: Fortaleza do Gelo Eterno
ru: Крепость Вечного Льда
tr: Ebedi Buz Kalesi
uk: Фортеця Вічного Льоду

source: Cave of the Perpetual Blizzard
de: Höhle des Immerwährenden Schneesturms
es: Cueva de la Ventisca Perpetua
fr: Grotte du Blizzard Perpétuel
it: Grotta della Bufera Perpetua
ja: 永久吹雪の洞窟
pt: Caverna da Nevasca Perpétua
ru: Пещера Бесконечной Метель
tr: Bitmeyen Tipi Mağarası
uk: Печера Нескінченної Завірюхи

source: Crypt of the Frozen King
de: Krypta des Gefrorenen Königs
es: Cripta del Rey Helado
fr: Crypte du Roi Gelé
it: Cripta del Re Ghiacciato
ja: 凍れる王の墓所
pt: Cripta do Rei Congelado
ru: Склеп Замёрзшего Короля
tr: Donmuş Kralın Mezarlığı
uk: Крипта Замороженого Короля

source: Hall of the Icy Dawn
de: Halle der Eisigen Morgenröte
es: Sala del Amanecer Gélido
fr: Salle de l'Aube Glacée
it: Sala dell'Alba Gelida
ja: 氷の夜明けの間
pt: Salão do Alvorecer Gélido
ru: Зал Ледяного Рассвета
tr: Buzlu Şafak Salonu
uk: Зал Крижаної Зорі

source: Cliff of the Glacial Wind
de: Klippe des Gletscherwinds
es: Acantilado del Viento Glacial
fr: Falaise du Vent Glaciaire
it: Rupe del Vento Glaciale
ja: 氷風の崖
pt: Penhasco do Vento Glacial
ru: Утёс Ледяного Ветра
tr: Buzul Rüzgar Uçurumu
uk: Утес Льодовикового Вітру

source: Tomb of the Ice Queen
de: Grab der Eiskönigin
es: Tumba de la Reina de Hielo
fr: Tombe de la Reine des Glaces
it: Tomba della Regina di Ghiaccio
ja: 氷の女王の墓
pt: Tumba da Rainha de Gelo
ru: Гробница Ледяной Королевы
tr: Buz Kraliçesinin Mezarı
uk: Гробниця Крижаної Королеви

source: Tower of Deep Frost
de: Turm des Tiefen Frosts
es: Torre de la Escarcha Profunda
fr: Tour du Givre Profond
it: Torre del Gelo Profondo
ja: 深き霜の塔
pt: Torre da Geada Profunda
ru: Башня Глубокого Мороза
tr: Derin Don Kulesi
uk: Вежа Глибокого Морозу

source: Freezing Abyss
de: Gefrorener Abgrund
es: Abismo Gélido
fr: Abîme Glacial
it: Abisso Gelido
ja: 凍てつく深淵
pt: Abismo Congelante
ru: Замерзающая Бездна
tr: Dondurucu Uçurum
uk: Крижана Безодня

source: Grotto of the Frozen Heart
de: Grotte des Gefrorenen Herzens
es: Gruta del Corazón Helado
fr: Grotte du Cœur Gelé
it: Grotta del Cuore Ghiacciato
ja: 凍った心の洞穴
pt: Gruta do Coração Congelado
ru: Грот Замёрзшего Сердца
tr: Donmuş Kalp Mağarası
uk: Грота Замерзлого Серця

source: Palace of Silent Snow
de: Palast des Stillen Schnees
es: Palacio de la Nieve Silenciosa
fr: Palais de la Neige Silencieuse
it: Palazzo della Neve Silenziosa
ja: 静寂の雪の宮殿
pt: Palácio da Neve Silenciosa
ru: Дворец Безмолвного Снега
tr: Sessiz Karlar Sarayı
uk: Палац Тихого Снігу

source: Cave of the Endless Hurricane
de: Höhle des Endlosen Hurrikans
es: Cueva del Huracán Interminable
fr: Grotte de l'Ouragan Sans Fin
it: Grotta dell'Uragano Infinito
ja: 無限の嵐の洞窟
pt: Caverna do Furacão Interminável
ru: Пещера Бесконечного Урагана
tr: Sonsuz Kasırga Mağarası
uk: Печера Нескінченного Урагану

source: Sanctuary of Cutting Winds
de: Zuflucht der Schneidenden Winde
es: Santuario de los Vientos Cortantes
fr: Sanctuaire des Vents Tranchants
it: Santuario dei Venti Taglienti
ja: 切り裂く風の聖域
pt: Santuário dos Ventos Cortantes
ru: Святилище Режущих Ветров
tr: Keskin Rüzgarların Mabedi
uk: Святилище Ріжучих Вітрів

source: Tower of Turbulent Skies
de: Turm der Turbulenten Himmel
es: Torre de los Cielos Turbulentos
fr: Tour des Cieux Tourmentés
it: Torre dei Cieli Turbolenti
ja: 乱気流の空の塔
pt: Torre dos Céus Turbulentos
ru: Башня Беспокойного Неба
tr: Çalkantılı Gökyüzü Kulesi
uk: Вежа Бурхливого Неба

source: Temple of the Invisible Currents
de: Tempel der Unsichtbaren Strömungen
es: Templo de las Corrientes Invisibles
fr: Temple des Courants Invisibles
it: Tempio delle Correnti Invisibili
ja: 見えざる気流の神殿
pt: Templo das Correntes Invisíveis
ru: Храм Невидимых Потоков
tr: Görünmez Akıntılar Tapınağı
uk: Храм Невидимих Потоків

source: Maelstrom of Laments
de: Strudel der Klagen
es: Torbellino de Lamentos
fr: Maelström des Lamentations
it: Maelstrom dei Lamenti
ja: 嘆きの渦潮
pt: Redemoinho dos Lamentos
ru: Водоворот Стенаний
tr: Ağıtların Girdabı
uk: Вир Скорбот

source: Nest of the Storm Eagle
de: Nest des Sturmadlers
es: Nido del Águila de la Tormenta
fr: Nid de l'Aigle de Tempête
it: Nido dell'Aquila della Tempesta
ja: 嵐の鷲の巣
pt: Ninho da Águia da Tempestade
ru: Гнездо Штормового Орла
tr: Fırtına Kartalının Yuvası
uk: Гніздо Штормового Орла

source: Cave of the Enchanted Breeze
de: Höhle der Verzauberten Brise
es: Cueva de la Brisa Encantada
fr: Grotte de la Brise Enchantée
it: Grotta della Brezza Incantata
ja: 魔法のそよ風の洞窟
pt: Caverna da Brisa Encantada
ru: Пещера Зачарованного Ветра
tr: Büyülü Esinti Mağarası
uk: Печера Зачарованого Вітру

source: Throne of the Ancient Cyclone
de: Thron des Uralten Zyklons
es: Trono del Ciclón Ancestral
fr: Trône du Cyclone Ancien
it: Trono del Ciclone Antico
ja: 古のサイクロンの玉座
pt: Trono do Ciclone Ancestral
ru: Трон Древнего Циклона
tr: Kadim Kasırganın Tahtı
uk: Трон Древнього Циклону

source: Cathedral of Black Gusts
de: Kathedrale der Schwarzen Böen
es: Catedral de las Ráfagas Negras
fr: Cathédrale des Rafales Noires
it: Cattedrale delle Raffiche Nere
ja: 黒風の大聖堂
pt: Catedral das Rajadas Negras
ru: Собор Чёрных Порывов
tr: Kara Esintilerin Katedrali
uk: Собор Чорних Поривів

source: Cliffs of the Howling Gale
de: Klippen des Heulenden Sturms
es: Acantilados del Vendaval Aullador
fr: Falaises de la Rafale Hurlante
it: Scogliere del Vento Urlante
ja: 遠吠えの突風の崖
pt: Penhascos da Rajada Uivante
ru: Скалы Воющего Ветра
tr: Uğuldayan Fırtına Kayalıkları
uk: Скелі Виючого Вітру

source: Palace of Eternal Tides
de: Palast der Ewigen Gezeiten
es: Palacio de las Mareas Eternas
fr: Palais des Marées Éternelles
it: Palazzo delle Maree Eterne
ja: 永遠の潮の宮殿
pt: Palácio das Marés Eternas
ru: Дворец Вечных Приливов
tr: Sonsuz Gelgit Sarayı
uk: Палац Вічних Припливів

source: Grotto of the Sleeping Leviathan
de: Grotte des Schlafenden Leviathans
es: Gruta del Leviatán Dormido
fr: Grotte du Léviathan Endormi
it: Grotta del Leviatano Dormiente
ja: 眠れるリヴァイアサンの洞穴
pt: Gruta do Leviatã Adormecido
ru: Грот Спящего Левиафана
tr: Uyuyan Leviathan Mağarası
uk: Грота Сплячого Левіафана

source: Cave of the Sunken Tears
de: Höhle der Versunkenen Tränen
es: Cueva de las Lágrimas Hundidas
fr: Grotte des Larmes Englouties
it: Grotta delle Lacrime Sommerse
ja: 沈んだ涙の洞窟
pt: Caverna das Lágrimas Submersas
ru: Пещера Утонувших Слёз
tr: Batık Gözyaşları Mağarası
uk: Печера Потоплених Сліз

source: Abyss of Deadly Currents
de: Abgrund der Tödlichen Strömungen
es: Abismo de Corrientes Mortales
fr: Abîme des Courants Mortels
it: Abisso delle Correnti Letali
ja: 死の潮流の深淵
pt: Abismo das Correntes Mortais
ru: Бездна Смертоносных Течений
tr: Ölümcül Akıntıların Uçurumu
uk: Безодня Смертельних Течій

source: Tower of Endless Rain
de: Turm des Endlosen Regens
es: Torre de Lluvia Infinita
fr: Tour de la Pluie Infinie
it: Torre della Pioggia Infinita
ja: 終わりなき雨の塔
pt: Torre da Chuva Infinita
ru: Башня Бесконечного Дождя
tr: Bitmeyen Yağmur Kulesi
uk: Вежа Нескінченного Дощу

source: Ruins of the Drowned City
de: Ruinen der Ertrunkenen Stadt
es: Ruinas de la Ciudad Ahogada
fr: Ruines de la Cité Engloutie
it: Rovine della Città Sommersa
ja: 沈没都市の遺跡
pt: Ruínas da Cidade Afogada
ru: Руины Затопленного Города
tr: Boğulmuş Şehrin Harabeleri
uk: Руїни Потонулого Міста

source: Lake of the Deep Shadows
de: See der Tiefen Schatten
es: Lago de las Sombras Profundas
fr: Lac des Ombres Profondes
it: Lago delle Ombre Profonde
ja: 深き影の湖
pt: Lago das Sombras Profundas
ru: Озеро Глубоких Теней
tr: Derin Gölgelerin Gölü
uk: Озеро Глибоких Тіней

source: Sanctuary of Wild Waves
de: Zuflucht der Wilden Wellen
es: Santuario de las Olas Salvajes
fr: Sanctuaire des Vagues Sauvages
it: Santuario delle Onde Selvagge
ja: 荒波の聖域
pt: Santuário das Ondas Selvagens
ru: Святилище Диких Волн
tr: Vahşi Dalgalar Mabedi
uk: Святилище Диких Хвиль

source: Temple of the Sunken Doom
de: Tempel des Versunkenen Unheils
es: Templo de la Perdición Sumergida
fr: Temple de la Perdition Engloutie
it: Tempio della Rovina Sommersa
ja: 沈みし運命の神殿
pt: Templo da Perdição Submersa
ru: Храм Затонувшей Погибели
tr: Batık Kader Tapınağı
uk: Храм Потонулої Загибелі

source: Well of a Thousand Seas
de: Brunnen der Tausend Meere
es: Pozo de los Mil Mares
fr: Puits des Mille Mers
it: Pozzo dei Mille Mari
ja: 千の海の井戸
pt: Poço dos Mil Mares
ru: Источник Тысячи Морей
tr: Bin Deniz Kuyusu
uk: Криниця Тисячі Морів

source: Forest of Silent Death
de: Wald des Stillen Todes
es: Bosque de la Muerte Silenciosa
fr: Forêt de la Mort Silencieuse
it: Foresta della Morte Silenziosa
ja: 沈黙の死の森
pt: Floresta da Morte Silenciosa
ru: Лес Тихой Смерти
tr: Sessiz Ölüm Ormanı
uk: Ліс Тихої Смерті

source: Lair of the Choking Roots
de: Unterschlupf der Würgenden Wurzeln
es: Guarida de las Raíces Asfixiantes
fr: Repaire des Racines Étouffantes
it: Tana delle Radici Soffocanti
ja: 窒息する根の巣窟
pt: Covil das Raízes Asfixiantes
ru: Логово Душащих Корней
tr: Boğucu Köklerin İnı
uk: Лігво Душних Коренів

source: Ruins of the Stone Guardian
de: Ruinen des Steinernen Wächters
es: Ruinas del Guardián de Piedra
fr: Ruines du Gardien de Pierre
it: Rovine del Guardiano di Pietra
ja: 石の守護者の遺跡
pt: Ruínas do Guardião de Pedra
ru: Руины Каменного Стража
tr: Taş Muhafızın Harabeleri
uk: Руїни Кам'яного Охоронця

source: Cave of Whispering Leaves
de: Höhle der Flüsternden Blätter
es: Cueva de las Hojas Susurrantes
fr: Grotte des Feuilles Murmurantes
it: Grotta delle Foglie Sussurranti
ja: ささやく葉の洞窟
pt: Caverna das Folhas Sussurrantes
ru: Пещера Шепчущих Листьев
tr: Fısıldayan Yapraklar Mağarası
uk: Печера Шепочучого Листя

source: Temple of Eternal Vines
de: Tempel der Ewigen Ranken
es: Templo de las Enredaderas Eternas
fr: Temple des Lianes Éternelles
it: Tempio delle Viti Eterne
ja: 永遠の蔓の神殿
pt: Templo das Vinhas Eternas
ru: Храм Вечных Лиан
tr: Sonsuz Sarmaşıklar Tapınağı
uk: Храм Вічних Ліан

source: Heart of the Dark Jungle
de: Herz des Dunklen Dschungels
es: Corazón de la Selva Oscura
fr: Cœur de la Jungle Sombre
it: Cuore della Giungla Oscura
ja: 暗黒の密林の心臓部
pt: Coração da Selva Sombria
ru: Сердце Тёмных Джунглей
tr: Karanlık Ormanın Kalbi
uk: Серце Темних Джунглів

source: Valley of the Stone Colossus
de: Tal des Steinkolosses
es: Valle del Coloso de Piedra
fr: Vallée du Colosse de Pierre
it: Valle del Colosso di Pietra
ja: 石の巨像の谷
pt: Vale do Colosso de Pedra
ru: Долина Каменного Колосса
tr: Taş Dev Vadisi
uk: Долина Кам'яного Колоса

source: Trail of the Haunted Trees
de: Pfad der Verfluchten Bäume
es: Senda de los Árboles Embrujados
fr: Sentier des Arbres Hantés
it: Sentiero degli Alberi Infestati
ja: 呪われし木々の小径
pt: Trilha das Árvores Assombradas
ru: Тропа Проклятых Деревьев
tr: Lanetli Ağaçların Yolu
uk: Стежка Примарних Дерев

source: Tomb of the Green Guardian
de: Grab des Grünen Wächters
es: Tumba del Guardián Verde
fr: Tombe du Gardien Vert
it: Tomba del Guardiano Verde
ja: 緑の守護者の墓
pt: Tumba do Guardião Verde
ru: Гробница Зелёного Стража
tr: Yeşil Muhafızın Mezarı
uk: Гробниця Зеленого Охоронця

source: Nest of the Ancestral Earth Spirit
de: Nest des Urahnen-Erdengeists
es: Nido del Espíritu Terrenal Ancestral
fr: Nid de l'Esprit Terrestre Ancestral
it: Nido dello Spirito Ancestrale della Terra
ja: 祖なる地霊の巣
pt: Ninho do Espírito Terrestre Ancestral
ru: Гнездо Древнего Духа Земли
tr: Atasal Toprak Ruhu Yuvası
uk: Гніздо Древнього Духу Землі

source: Dungeon of the Eternal Moon
de: Kerker des Ewigen Mondes
es: Mazmorra de la Luna Eterna
fr: Donjon de la Lune Éternelle
it: Segreta della Luna Eterna
ja: 永遠の月のダンジョン
pt: Masmorra da Lua Eterna
ru: Темница Вечной Луны
tr: Ebedi Ay Zindanı
uk: Підземелля Вічного Місяця

source: Fortress of the Fallen
de: Festung der Gefallenen
es: Fortaleza de los Caídos
fr: Forteresse des Déchus
it: Fortezza dei Caduti
ja: 堕ちし者の要塞
pt: Fortaleza dos Caídos
ru: Крепость Павших
tr: Düşenlerin Kalesi
uk: Фортеця Полеглих

source: Abyss of Lost Souls
de: Abgrund der Verlorenen Seelen
es: Abismo de Almas Perdidas
fr: Abîme des Âmes Perdues
it: Abisso delle Anime Perdute
ja: 失われた魂の深淵
pt: Abismo das Almas Perdidas
ru: Бездна Потерянных Душ
tr: Kayıp Ruhların Uçurumu
uk: Безодня Загублених Душ

source: Tower of the Shadowed Dawn
de: Turm der Beschatteten Dämmerung
es: Torre del Amanecer Sombrío
fr: Tour de l'Aube Obscure
it: Torre dell'Alba Oscura
ja: 影の夜明けの塔
pt: Torre da Aurora Sombria
ru: Башня Затенённого Рассвета
tr: Gölgeli Şafak Kulesi
uk: Вежа Затьмареного Світанку

source: Cave of the Forgotten Blade
de: Höhle der Vergessenen Klinge
es: Cueva de la Espada Olvidada
fr: Grotte de la Lame Oubliée
it: Grotta della Lama Dimenticata
ja: 忘れられた剣の洞窟
pt: Caverna da Lâmina Esquecida
ru: Пещера Забытого Клинка
tr: Unutulmuş Kılıç Mağarası
uk: Печера Забутого Клинка

source: Castle of Infinite Shadows
de: Schloss der Unendlichen Schatten
es: Castillo de Sombras Infinitas
fr: Château des Ombres Infinies
it: Castello delle Ombre Infinite
ja: 無限の影の城
pt: Castelo das Sombras Infinitas
ru: Замок Бесконечных Теней
tr: Sonsuz Gölgeler Şatosu
uk: Замок Нескінченних Тіней

source: Sanctuary of a Thousand Echoes
de: Zuflucht der Tausend Echos
es: Santuario de los Mil Ecos
fr: Sanctuaire des Mille Échos
it: Santuario dei Mille Echi
ja: 千のこだまの聖域
pt: Santuário dos Mil Ecos
ru: Святилище Тысячи Эхо
tr: Bin Yankının Mabedi
uk: Святилище Тисячі Відлунь
