Repository: IvanCvetanovic/Item-Parser-for-Magic-Rampage
Catalog: lang/*/weekly-dungeons.strings
Languages: de, es, fr, it, ja, pt, ru, tr, uk

source: The Upside Down
de: Die andere Seite
es: El Mundo del Revés
fr: Le monde à l'envers
it: Il Sottosopra
ja: 裏側の世界
pt: O Mundo Invertido
ru: Вверх Дном
tr: Ters Yüz
uk: Догори дном

source: Taken by Nature
de: Naturbeherrscht
es: Capturado por la naturaleza
fr: Repris par la nature
it: Sottratto dalla natura
ja: 自然の力
pt: Tomado pela Natureza
ru: Зов Природы
tr: Doğanın Elinde
uk: Поклик природи

source: Spider's Nest
de: Spinnennest
es: Nido de arañas
fr: Le nid de l'araignée
it: Il nido del ragno
ja: クモの巣
pt: Ninho da Aranha
ru: Паучье Гнездо
tr: Örümcek Yuvası
uk: Павуче лігво

source: Castle's Sewers
de: Burgkanäle
es: Cloacas del castillo
fr: Les égouts du château
it: Fogne del castello
ja: 城の地下水路
pt: Esgotos do Castelo
ru: Оборона Замка
tr: Kale Kanalizasyonu
uk: Канали під замком

source: Burning Castle
de: Burg in Flammen
es: Castillo en llamas
fr: Le château en feu
it: Castello in fiamme
ja: 燃え盛る城
pt: Castelo Flamejante
ru: Пылающий Замок
tr: Alevli Kale
uk: Замок у вогні

source: Warlock's Clone Wars
de: Hexers Klonkriege
es: Las Guerras Clon del Brujo
fr: La guerre des clones de l'enchanteur
it: La guerra dei cloni dello stregone
ja: 魔法のクローンウォー
pt: Guerro dos Clones do Bruxo
ru: Войны Клонов Тьмы
tr: Kara Büyücünün Klon Savaşları
uk: Чорнокнижні війни клонів

source: Balls of Death
de: Todeskugeln
es: Bolas de muerte
fr: Les balles mortelles
it: Sfere di morte
ja: 死の舞踏会
pt: Esferas da Morte
ru: Шары Смерти
tr: Ölüm Topları
uk: Шари смерті

source: Fire Spitters
de: Feuerspeier
es: Escupefuegos
fr: Les cracheurs de feu
it: Sputafuoco
ja: 火を噴く者
pt: Cuspidores de Fogo
ru: Огненные Плевки
tr: Ateş Püskürenler
uk: Вогняне дихання

source: Breath of Fire
de: Feueratem
es: Aliento de fuego
fr: Le souffle de feu
it: Alito rovente
ja: ブレスオブファイア
pt: Bafo de Fogo
ru: Горячее Дыхание
tr: Ateş Nefesi
uk: Ревуче полум'я

source: Spider Nightmare
de: Spinnenalbtraum
es: Pesadilla arácnida
fr: Le cauchemar de l'araignée
it: Incubo del ragno
ja: スパイダーナイトメア
pt: Pesadelo com Aranhas
ru: Арахнофобия
tr: Örümcek Kabusu
uk: Павучий кошмар

source: Orc Town
de: Orkstadt
es: Ciudad orca
fr: La ville des Orcs
it: La città degli orchi
ja: オークのまち
pt: Cidade dos Orcs
ru: Лагерь Орков
tr: Ork Şehri
uk: Табір орків

source: Fire Lord's Revenge
de: Feuerlords Rache
es: Venganza del Señor del Fuego
fr: La vengeance du Seigneur du Feu
it: La vendetta del Signore del fuoco
ja: 火の主の復讐
pt: A Revanche do Lorde de Fogo
ru: Месть Огненного Лорда
tr: Ateş Efendisinin İntikamı
uk: Помста лорда вогню

source: Like a Rolling Stone
de: Wie ein Rolling Stone
fr: Pierre qui roule...
it: Pietra rotante
ja: ライク・ア・ローリング・ストーン
pt: Como uma Pedra que Rola
ru: Как Перекати-Поле
tr: Yuvarlanan bir Taş Gibi
uk: Перекотиполе

source: Flood Nightmare
de: Albtraumflut
es: Pesadilla anegadiza
fr: Le cauchemar du déluge
it: Alluvione da incubo
ja: 洪水の悪夢
pt: Pesadelo do Dilúvio
ru: Жуткое Наводнение
tr: Taşkın Kabusu
uk: Смертоносна повінь

source: Certain Death Arena
de: Arena des sicheren Todes
es: Arena de muerte certera
fr: L'arène de la mort certaine
it: Arena della morte certa
ja: 絶死のアリーナ
pt: Arena da Morte Certa
ru: Арена Верной Смерти
tr: Kesin Ölüm Arenası
uk: Гладіаторські бої

source: Clone Wars
de: Klonkriege
es: Las Guerras Clon
fr: La guerre des clones
it: Guerre dei cloni
ja: クローン・ウォー
pt: Guerra dos Clones
ru: Двойниковые Войны
tr: Klon Savaşları
uk: Битва клонів

source: Halloween Rampage
es: Devastación de Halloween
fr: Le carnage d'Halloween
it: Furia di Halloween
ja: ハロウィンランページ
pt: Tumulto no Halloween
ru: Буйный Хэллоуин
tr: Cadılar Bayramı Saldırısı
uk: Божевільний Геловін

source: Christmas Rampage
de: Weihnachts-Rampage
es: Devastación de Navidad
fr: Le carnage de Noël
it: Furia di Natale
ja: クリスマスランページ
pt: Confusões de Natal
ru: Буйное Рождество
tr: Noel Saldırısı
uk: Божевільне Різдво

source: New Year's Rampage
de: Neujahrs-Rampage
es: Devastación de Año Nuevo
fr: Le carnage du Nouvel An
it: Furia di Capodanno
ja: ニューイヤーランページ
pt: Confusão de Ano Novo
ru: Буйный Новый Год
tr: Yeni Yıl Saldırısı
uk: Божевільний Новий рік

source: Fire and Blood
de: Feuer und Blut
es: Fuego y sangre
fr: De feu et de sang
it: Fuoco e sangue
ja: 炎と血と
pt: Fogo e Sangue
ru: Кровь и Огонь
tr: Ateş ve Kan
uk: Кров і вогонь

source: Wonderland
de: Wunderland
es: País de las Maravillas
fr: Le pays des Merveilles
it: Il paese delle meraviglie
ja: ワンダーランド
pt: O País das Maravilhas
ru: Страна Чудес
tr: Harikalar Diyarı
uk: Країна чудес

source: Mushroom Kingdom
de: Pilzland
es: Reino Champiñón
fr: Le royaume Champignon
it: Il regno dei funghi
ja: キノコの王国
pt: Reino do Cogumelo
ru: Грибное Королевство
tr: Mantar Krallığı
uk: Грибне королівство

source: Monster Kingdom
de: Reich der Monster
es: Reino de los Monstruos
fr: Le royaume des monstres
it: Il regno dei mostri
ja: 怪物たちがいる王国
pt: Reino dos Monstros
ru: Чудовищное Королевство
tr: Canavar Krallığı
uk: Володіння монстрів

source: Moonkeeper's Nightmare
de: Mondwächters Albtraum
es: Pesadilla del Guardián Lunar
fr: Le cauchemar du Gardien de la Lune
it: L'incubo del guardiano della luna
ja: ムーンキーパーの悪夢
pt: Pesadelo do Guardião da Lua
ru: Кошмар Хранителя Луны
tr: Ay Bekçisinin Kabusu
uk: Страшний сон Хранителя місяця

source: Ape Escape
de: Affenflucht
es: Huida simiesca
fr: La fuite du singe géant
it: La fuga delle scimmie
ja: エイプエスケープ
pt: Fuga dos Macacos
ru: Побег Обезьян
tr: Maymun Kaçısı
uk: Мавпяча втеча

source: A Slimy Day
de: Ein schleimiger Tag
es: Un día viscoso
fr: Une journée glissante
it: Un giorno melmoso
ja: 曇りのちスライム
pt: Um dia pegajoso
ru: Слизкий День
tr: Sülüksü Bir Gün
uk: Слизький день

source: Time Patroller's Time
de: Zeitpatrouillenzeit
es: Tiempo de la Patrulla del Tiempo
fr: L'heure du patrouilleur du temps
it: Il tempo del guardiano temporale
ja: タイムパトローラータイム
pt: A hora do Patrulheiro do Tempo
ru: Время Патруля Времени
tr: Zaman Devriyesinin Zamanı
uk: Патруль часу

source: Hail to the King
de: Lang lebe der König
es: Salve al rey
fr: Le salut au Roi
it: Ave, Re!
ja: 王への呼び声
pt: Salve o Rei
ru: Слава Королю!
tr: Krala Selam Olsun
uk: Слава королю

source: Venomous Creatures
de: Giftige Kreaturen
es: Criaturas venenosas
fr: Les créatures venimeuses
it: Creature velenose
ja: ヴェノムクリーチャー
pt: Criaturas Venenosas
ru: Ядовитые Твари
tr: Zehirli Yaratıklar
uk: Отруйні потвори

source: Occasional Rampage
de: Gelegenheitsamok
es: Devastación ocasional
fr: Le carnage occasionnel
it: Furia occasionale
ja: 気分屋ランページ
pt: Tumulto casual
ru: Неконтролируемое Буйство
tr: Anlık Saldırı
uk: Неконтрольована лють

source: Thunderstruck
de: Donnerschlag
fr: Foudroyé
it: Esterefatto
ja: サンダーストラック
ru: Гром Средь Ясного Неба
tr: Yıldırım Çarpması
uk: Грім серед ясного неба

source: A Shocking Day
de: Ein elektrisierender Tag
es: Un día electrizante
fr: Une journée électrisante
it: Un giorno scioccante
ja: ビビっときちゃった
pt: Um dia Chocante
ru: Шокирующий День
tr: Şok Edici Bir Gün
uk: Шокуючі події

source: Jumpmans Paradise
de: Jumpmans Paradies
es: Paraíso de Jumpman
fr: Le paradis des amateurs de sauts
it: Il paradiso dei saltellanti
ja: ジャンプマンパラダイス
pt: Paraíso do Jumpman
ru: Рай Для Джампмэна
tr: Atlayıcılar Cenneti
uk: Мрія Джампмена

source: The Keeper of the Keys
de: Der Schlüsselwächter
es: El Guardián de las Llaves
fr: Le gardien des clés
it: Il guardiano delle chiavi
ja: 鍵の主
pt: O Guardião das Chaves
ru: Лучший Ключник
tr: Anahtarların Bekçisi
uk: Хранитель ключів

source: The Swamp Monsters
de: Die Sumpfmonster
es: Los monstruos del pantano
fr: Les monstres du marécage
it: I mostri della palude
ja: 沼地の怪物
pt: Monstros do Pântano
ru: Болотные Чудовища
tr: Bataklık Canavarları
uk: Болотні чудовиська

source: Volcano
de: Vulkan
es: Volcán
fr: Le volcan
it: Vulcano
ja: 火山
pt: Vulcão
ru: Вулкан
tr: Volkan
uk: Вулкан

source: The Floor is Lava
de: Der Boden ist Lava
es: El suelo es lava
fr: Le sol est en lave
it: Pavimento di lava
ja: 溶岩のじゅうたん
pt: O Chão é Lava!
ru: Пол - Это Лава
tr: Sakın Yere Basma
uk: Лава під ногами

source: Salesman's Payback
de: Händlerrache
es: Venganza del vendedor
fr: La vengeance du vendeur
it: La vendetta del venditore
ja: 商人のお返し
pt: O Troco
ru: Долги Торговца
tr: Satıcının Geri Ödemesi
uk: Помста торговця

source: Payback Time
de: Zeit der Vergeltung
es: Hora de la venganza
fr: L'heure de la vengeance
it: Tempo di vendetta
ja: 報復の時
pt: Hora de Pagar
ru: Час Расплаты
tr: Geri Ödeme Zamanı
uk: Час розплати

source: Dudes' Family Adventure
de: Normalverbraucher-Familienabenteuer
es: Aventura familiar del Tío
fr: L'aventure ordinaire d'une famille ordinaire
it: Avventura di famiglia
ja: キサク一家の冒険
pt: Aventura em Família
ru: О Семье Рядового Райана
tr: Kankaların Aile Macerası
uk: Сім'я рядового Раяна

source: The Kingslayer
de: Der Königsmörder
es: El Matarreyes
fr: Le Régicide
it: L'uccisore dei Re
ja: キングスレイヤー
pt: O Matador de Rei
ru: Цареубийца
tr: Kral Katili
uk: Царевбивця

source: Behold the King
de: Schaut den König
es: He aquí al rey
fr: La contemplation du Roi
it: Ecco il Re!
ja: キングを見よ
pt: Contemple o Rei
ru: Склонитесь Перед Королём
tr: Karşınızda Kral
uk: Схилися перед королем

source: The King of Kings
de: Der König der Könige
es: El rey de reyes
fr: Le Roi des rois
it: Il Re dei Re
ja: 王の中の王
pt: O Rei dos Reis
ru: Король Королей
tr: Kralların Kralı
uk: Король королів

source: Magic Forest
de: Zauberwald
es: Bosque mágico
fr: La forêt magique
it: Foresta magica
ja: 魔法の森
pt: Floresta Mágica
ru: Магический Лес
tr: Sihir Ormanı
uk: Чарівний ліс

source: Magic Swamp
de: Zaubersumpf
es: Pantano mágico
fr: Les marécages magiques
it: Palude magica
ja: 魔法の沼
pt: Pântano Mágico
ru: Волшебное Болото
tr: Sihir Bataklığı
uk: Зачароване болото

source: Ghostbusters
es: Cazafantasmas
fr: SOS Fantômes
it: Acchiappafantasmi
ja: ゴーストバスター
pt: Caçafantasmas
ru: Охотники За Привидениями
tr: Hayalet Avcıları
uk: Мисливці на привидів

source: Ape Demon's Sanctuary
de: Affendämons Heiligtum
es: Santuario del Demonio Simio
fr: Le sanctuaire du Démon singe
it: Il santuario del demone delle scimmie
ja: 猿魔の聖域
pt: Santuário do Macaco Demoníaco
ru: Обитель Обезьяньего Демона
tr: Maymun İblisin Sığınağı
uk: Обитель мавпячого демона

source: Competitive Challenge
de: Wettbewerbsfähige Herausforderung
es: Desafío competitivo
fr: Le défi compétitif
it: Sfida competitiva
ja: コンペティティブチャレンジ
pt: Desafio Competitivo
ru: Состязание Из Состязаний
tr: Rekabet Meydan Okuması
uk: Змагання

source: The Dark Side of the Moon
de: Die dunkle Seite des Mondes
es: El lado oscuro de la luna
fr: La face cachée de la Lune
it: Il lato oscuro della luna
ja: 光当たらぬ月の暗がり
pt: O Lado Sombrio da Lua
ru: Тёмная Сторона Луны
tr: Ayın Karanlık Yüzü
uk: Темна сторона місяця

source: Time Rush
de: Drangzeit
es: Prisa temporal
fr: La ruée du temps
it: Corsa temporale
ja: タイムラッシュ
pt: Corrida contra o tempo
ru: Спешка
tr: Zaman Hücumu
uk: Поспіх

source: Rush Hour
de: Hauptverkehrszeit
es: Hora punta
fr: L'heure de pointe
it: Ora di punta
ja: ラッシュアワー
pt: Hora do Rush
ru: Час Пик
tr: Yoğun Saat
uk: Час пік

source: Death Corridor
de: Todesflur
es: Pasillo de la muerte
fr: Couloir de la mort
it: Corridoio della morte.
ja: 死の回廊
pt: Corredor da Morte
ru: Коридор Смерти
tr: Ölüm Koridoru
uk: Коридор смерті

source: Into the Swamp
de: In den Sumpf
es: Hacia el pantano
fr: Dans les marécages
it: Nella palude.
ja: 沼地の中へ
pt: Dentro do Pântano
ru: В Глубине Болот
tr: Bataklığın İçi
uk: У глибині болота

source: Easter Nightmare!
de: Ostern Albtraum!
es: ¡Pesadilla de Pascua!
fr: Le cauchemar de Pâques !
it: Incubo di Pasqua!
ja: イースターナイトメア！
pt: Pesadelo na Páscoa!
ru: Пасхальный Ужас!
tr: Paskalya Kabusu!
uk: Великодній жах!

source: Lair of the Forbidden Warlord
de: Versteck des Verbotenen Kriegsherrn
es: Guarida del Señor de la Guerra Prohibido
fr: Antre du Seigneur de guerre banni
it: Covo del condottiero proibito
ja: 禁じられた将軍の隠れ家
pt: Lar do Guerreiro Banido
ru: Логово Изгнанного Полководца
tr: Dikdatör Savaş Beyinin Sığınağı
uk: Лігво вигнаного полководця

source: Caverns of the Ebon Knight
de: Höhlen des Schwarzen Ritters
es: Cavernas del Caballero de Ébano
fr: Cavernes du Chevalier Ebon
it: Caverne del cavaliere d'ebano
ja: エボンナイトの洞窟
pt: Cavernas do Cavaleiro de Ébano
ru: Пещеры Чернейшего Рыцаря
tr: Kapkara Şovalye'nin Mağaraları
uk: Печери Чорного лицаря

source: Lair of the Vanishing Dragon
de: Versteck des verschwindenden Drachen
es: Guarida del Dragón Desaparecido
fr: Tanière du Dragon évanescent
it: Covo del drago evanescente
ja: 消えたドラゴンのねぐら
pt: Lar do Dragão Desvanecido
ru: Логово Вымирающего Дракона
tr: Kaybolan Ejderha'nın İni
uk: Лігво останнього дракона

source: Tunnels of the Savage Desert
de: Tunnel der wilden Wüste
es: Túneles del Desierto Salvaje
fr: Tunnels du Désert sauvage
it: Tunnel del deserto selvaggio
ja: 慈悲なき砂漠のトンネル
pt: Túneis do Deserto Selvagem
ru: Туннели Диких Пустошей
tr: Vahşi Çölün Tünelleri
uk: Тунелі Диких пустищ

source: The Black Mountain Maze
de: Der schwarze Berg-Irrgarten
es: El Laberinto de la Montaña Negra
fr: Le labyrinthe de la Montagne noire
it: Il labirinto della Montagna nera
ja: ブラックマウンテンメイズ
pt: O Labirinto da Montanha Negra
ru: Лабиринт Чёрной Горы
tr: Kara Dağ Labirenti
uk: Лабіринт Чорної гори

source: The Mourning Haunt
de: Der Trauerspuk
es: El Lugar del Luto
fr: Les Tourments du deuil
it: Il luogo del cordoglio
ja: 嘆きのねぐら
pt: A Assombração do Luto
ru: Обиталище Скорби
tr: Yas Tutan Lanetli Bölge
uk: Гніздо скорботи

source: The Moaning Caverns
de: Die stöhnenden Höhlen
es: Las Cavernas Plañideras
fr: Les Cavernes gémissantes
it: Le caverne del cordoglio
ja: うなる洞窟
pt: Cavernas da Lamentação
ru: Пещеры Стенаний
tr: İnleyen Mağaralar
uk: Грот стогону

source: The Violent Vault
de: Die gewalttätige Gruft
es: La Bóveda Violenta
fr: Le Caveau violent
it: Il caveau violento
ja: バイオレントボルト
pt: A Cripta Brutal
ru: Убежище Неистовства
tr: Şiddetli Mahzen
uk: Притулок відчаю

source: The Distant Burrows
de: Die fernen Bauen
es: Las Madrigueras Distantes
fr: Les Terriers lointains
it: I rifugi distanti
ja: 遥か彼方の隠れ穴
pt: Os Refúgios Distantes
ru: Продольные Норы
tr: Uzak Sığınak
uk: Дальні канали

source: The Grim Crypt
de: Die grimmige Krypta
es: La Cripta Lúgubre
fr: La Crypte lugubre
it: La cripta tetra
ja: 不気味な地下室
pt: A Cripta Impiedosa
ru: Зловещий Склеп
tr: Azrail'in Mezarlığı
uk: Зловісний склеп

source: Vault of the Silver Arachnid
de: Gruft der silbernen Spinnentiere
es: Bóveda del Arácnido Argénteo
fr: Caveau de l'Arachnide d'argent
it: Il caveau dell'aracnide d'argento
ja: 銀クモの洞穴
pt: Câmara do Aracnídeo Prateado
ru: Убежище Серебрянного Паукообразного
tr: Gümüş Örümceğin Mahzeni
uk: Катакомби сріблястого арахніда

source: Point of the Elemental Jungle
de: Punkt des Elementardschungels
es: Punto de la Jungla Elemental
fr: Dans la Jungle élémentaire
it: Punto della giungla elementale
ja: 元素の森
pt: Sítio da Floresta Elemental
ru: Схрон Стихийных Джунглей
tr: Elemental Orman Noktası
uk: Джунглі елементалей

source: Haunt of the Perished Legion
de: Spuk der umgekommenen Legion
es: Lugar de la Legión Perecida
fr: Tourments de la Légion décimée
it: Luogo della legione distrutta
ja: 堕ちた地の隠れ場
pt: Assombração da Legião Sucumbida
ru: Обиталище Павшего Легиона
tr: Yok Olan Lejyonun Lanetli Bölgesi
uk: Притулок зниклого легіону

source: Vault of the Furious Arachnid
de: Gruft des wütenden Spinnentiers
es: Bóveda del Arácnido Furioso
fr: Caveau de l'Arachnide furieuse
it: Il caveau dell'aracnide furioso
ja: 怒れるクモの洞穴
pt: Câmara do Aracnídeo Furioso
ru: Убежище Свирепого Паукообразного
tr: Öfkeli Örümceğin Mahzeni
uk: Лігво лютого арахніда

source: The Oracle Cells
de: Die Orakelzellen
es: Las Celdas del Oráculo
fr: Les Cellules de l'Oracle
it: Le celle dell'oracolo
ja: 導きの房
pt: As Celas do Oráculo
ru: Пристанище Оракула
tr: Mucize Hücreleri
uk: Обитель Оракула

source: The Roaring Tunnels
de: Die brüllenden Tunnel
es: Los Túneles Rugientes
fr: Les Tunnels hurlants
it: I tunnel ruggenti
ja: とどろく洞窟
pt: Túneis Urrantes
ru: Ревущие Туннели
tr: Kükreyen Tüneller
uk: Ревучі тунелі

source: The White Forest Chambers
de: Die Weißwaldkammern
es: Las Cámaras del Bosque Blanco
fr: Les Cavités de la Forêt blanche
it: Le stanze della Foresta bianca
ja: 白森の間
pt: Câmaras da Floresta Branca
ru: Чертоги Белого Леса
tr: Beyaz Orman Hücreleri
uk: Чертоги Білого лісу

source: The Arid Grotto
de: Die dürre Grotte
es: La Gruta Árida
fr: La Grotte aride
it: La grotta arida
ja: 荒れ果てた洞穴
pt: A Gruta Árida
ru: Безводный Грот
tr: Kurak Mağara
uk: Безводний грот

source: The Savage Burrows
de: Die wilden Bauen
es: Las Madrigueras Salvajes
fr: Les Terriers sauvages
it: Le tane selvagge
ja: 荒涼の塚
pt: O Refúgio Selvagem
ru: Дикие Норы
tr: Vahşi Sığınak
uk: Нори диких

source: The Wrath Tunnels
de: Die Zornstunnel
es: Los Túneles de la Ira
fr: Les Tunnels de la rage
it: I tunnel della collera
ja: 憤怒の地下道
pt: Os Túneis da Fúria
ru: Туннели гнева
tr: Gazap Tünelleri
uk: Тунелі гніву

source: Caverns of the Ruthless Paladin
de: Höhlen des rücksichtslosen Paladins
es: Cavernas del Paladín Despiadado
fr: Cavernes du Paladin impitoyable
it: Caverne del paladino spietato
ja: 冷酷なパラディンの洞窟
pt: Cavernas do Paladino Implacável
ru: Пещера беспощадного паладина
tr: Acımasız Şövalye'nin Mağaraları
uk: Печера нещадного Паладіна

source: Pits of the Elemental Thief
de: Gruben des Elementardiebs
es: Fosos del Ladrón Elemental
fr: Fosses du Voleur élémentaire
it: Cave del ladro elementale
ja: エレメンタルシーフの洞穴
pt: A Fenda do Ladrão Elemental
ru: Рудник Стихийных Воров
tr: Elemtanl Hırsız'ın Savaş Çukuru
uk: Шахта грабіжників

source: Maze of the Poisoned Mage
de: Irrgarten des vergifteten Magiers
es: Laberinto del Mago Envenenado
fr: Labyrinthe du Mage empoisonné
it: Labirinto del mago avvelenato
ja: ポイズンメイジの迷宮
pt: O Labirinto do Mago Envenenado
ru: Лабиринт Отравленного Мага
tr: Zehirlenmiş Büyücünün Labirenti
uk: Лабіринт отруєного мага

source: Pits of the Brutal King
de: Gruben des brutalen Königs
es: Fosos del Rey Brutal
fr: Fosses du Roi cruel
it: Cave del re brutale
ja: 暴王の洞穴
pt: A Cova do Rei Brutal
ru: Рудник Жёсткого Короля
tr: Gaddar Kral'ın Savaş Çukuru
uk: Рудник Жорстокого короля

source: The Damned Tombs
de: Die verdammten Gräber
es: Las Tumbas Malditas
fr: Les Tombeaux maudits
it: Le tombe dannate
ja: 忌まわき墓場
pt: Tumbas Amaldiçoadas
ru: Проклятые Склепы
tr: Lanetli Lahit
uk: Проклята гробниця

source: The Dire Caverns
de: Die schrecklichen Höhlen
es: Las Cavernas Funestas
fr: Les Cavernes du désespoir
it: Le caverne catastrofiche
ja: 不吉な洞窟
pt: Cavernas Terríveis
ru: Пещеры Жути
tr: Uğursuz Mağaralar
uk: Моторошна печера

source: The Watching Eyes Tombs
de: Die Wachaugengräber
es: Las Tumbas de Ojos Vigilantes
fr: Les Tombeaux sentinelles
it: Le tombe dagli occhi attenti
ja: 目あり墓場
pt: Tumba dos Olhos que Tudo Veem
ru: Склепы Следящих Глаз
tr: İzleyen Göz Lahiti
uk: Мавзолей слідкуючих очей

source: The Fire Mountain Burrows
de: Die Feuerbergbauen
es: Las Madrigueras de la Montaña de Fuego
fr: Les Terriers de la Montagne de feu
it: Le tane della Montagna di fuoco
ja: 火の山の潜穴
pt: Refúgio da Montanha Ígnea
ru: Норы Огненной Горы
tr: Ateşli Dağ Sığınağı
uk: Свердловина Вогненної гори

source: The Depraved Lair
de: Das verdorbene Versteck
es: La Guarida Perversa
fr: L'Antre de la Dépravation
it: Il covo corrotto
ja: 邪悪が住む穴
pt: O covil degenerado
ru: Порочное Логово
tr: Ahlaksız Sığınağı
uk: Кубло пороку

source: The Eternal Agony Haunt
de: Der Spuk der ewigen Qual
es: El Lugar de la Agonía Eterna
fr: Les Tourments de l'Agonie éternelle
it: Il luogo dell'agonia eterna
ja: 止まぬ苦悩の巣穴
pt: Assombração da Agonia Eterna
ru: Обиталище Вечных Мучений
tr: Sonuz Istırap Lanetli Bölgesi
uk: Притулок вічних мук

source: Chambers of the Lonely Warlock
de: Kammern des einsamen Hexenmeisters
es: Cámaras del Brujo Solitario
fr: Cavités du Seigneur de guerre solitaire
it: Le stanze dello stregone solitario
ja: 孤独な魔導士の間
pt: Câmaras do Bruxo Solitário
ru: Чертоги Колдуна-Отшельника
tr: Yalnız Büyücünün Hücreleri
uk: Чертог чаклуна-відлюдника

source: Point of the Renegade Minion
de: Punkt des abtrünnigen Schergen
es: Punto del Esbirro Renegado
fr: Le Sbire renégat
it: Punto del tirapiedi rinnegato
ja: 裏切りミニオンの地
pt: A Região do Lacaio Renegado
ru: Схрон Миньона-Изменника
tr: Firari Köle'nin Noktası
uk: Криївка міньйона-зрадника

source: Pits of the Elemental Warlock
de: Gruben des elementaren Hexenmeisters
es: Fosos del Brujo Elemental
fr: Fosses du Seigneur de guerre élémentaire
it: Cave dello stregone elementale
ja: 属性魔導士の洞穴
pt: Câmaras do Bruxo Elemental
ru: Рудник Стихийного Колдуна
tr: Elemental Büyücü'nün Savaş Çukurları
uk: Копальні стихійного мага

source: Catacombs of the Rejected Cyclops
de: Katakomben der abgelehnten Zyklopen
es: Catacumbas de los Cíclopes Rechazados
fr: Catacombes du Cyclope rejeté
it: Le catacombe dei ciclopi rifiutati
ja: 捨てられたサイクロプスの墓場
pt: Catacumbas do Ciclope Rejeitado
ru: Катакомбы Отвергнутых Циклопов
tr: Reddedilmiş Tepegöz'ün Katakompu
uk: Катакомби знехтуваних циклопів

source: The Glowing Cells
de: Die leuchtenden Zellen
es: Las Celdas Luminosas
fr: Les Cellules rougeoyantes
it: Le celle raggianti
ja: グローイングセル
pt: As Celas Cintilantes
ru: Пылающее Пристанище
tr: Parlayan Hücreler
uk: Палаюча обитель

source: The Ogre Pits
de: Die Ogergruben
es: Los Fosos de los Ogros
fr: Les Fosses de l'Ogre
it: Le cave dell'orco
ja: オーガの巣穴
pt: O Fosso do Ogro
ru: Рудник Огров
tr: Ogre Savaş Çukuru
uk: Шахта огрів

source: The Haunted Lair
de: Das verfolgte Versteck
es: La Guarida Embrujada
fr: L'Antre hantée
it: Il covo infestato
ja: 取り憑かれた巣穴
pt: O Covil Assombrado
ru: Призрачное Логово
tr: Lanetli Sığınak
uk: Прокляте лігво

source: The Dreadful Tombs
de: Die schrecklichen Gräber
es: Las Tumbas Horrendas
fr: Les Tombeaux de l'Épouvante
it: Le tombe tremende
ja: 恐怖の墓
pt: A Tumba Medonha
ru: Ужасающий Склеп
tr: Dehşet Veren Lahit
uk: Страхітлива усипальниця

source: The Volcanic Haunt
de: Der vulkanische Spuk
es: El Lugar Volcánico
fr: Les Tourments volcaniques
it: Il luogo vulcanico
ja: 燃え上がるねぐら
pt: A Assombração Vulcânica
ru: Вулканическое Обиталище
tr: Lanetli Volkan Bölgesi
uk: Лігво біля вулкана

source: The Enchanted Lair
de: Das verzauberte Versteck
es: La Guarida Encantada
fr: L'Antre enchantée
it: Il covo incantato
ja: 魔法の巣穴
pt: O Covil Encantado
ru: Зачарованное Логово
tr: Büyülü Sığınak
uk: Зачаровані гніздо

source: Vault of the Dishonored
de: Gruft der Entehrten
es: Bóveda de los Deshonrosos
fr: Caveau du Déshonoré
it: Il caveau degli infami
ja: 不名誉の洞穴
pt: O Jazigo dos Infames
ru: Убежище Позора
tr: Onursuz'un Mahzeni
uk: Притон безчестя

source: Point of the Destroyed Soldier
de: Punkt des zerstörten Soldaten
es: Punto del Soldado Destruido
fr: Le Soldat anéanti
it: Punto del soldato distrutto
ja: 敗れた兵士のたまり場
pt: Local do Soldado Destruido
ru: Схрон Поверженного Солдата
tr: Katledilmiş Askerin Noktası
uk: Криївка переможеного солдата

source: The Fractured Labyrinth
de: Das gebrochene Labyrinth
es: El Laberinto Fracturado
fr: Le Labyrinthe fragmenté
it: Il labirinto rotto
ja: 道理通じぬラビリンス
pt: O Labirinto Partido
ru: Рушащийся лабиринт
tr: Kırık Labirent
uk: Потрісканий лабіринт

source: The Nightmare Burrows
de: Die Albtraumbauen
es: Las Madrigueras de la Pesadilla
fr: Les Terriers cauchemardesques
it: Le tane dell'incubo
ja: ナイトメアバロー
pt: A Toca do Pesadelo
ru: Норы Кошмаров
tr: Kabus Sığınağı
uk: Канали жахів

source: The Fabled Chambers
de: Die fabelhaften Kammern
es: Las Cámaras Legendarias
fr: Les Cavités légendaires
it: Le stanze fiabesche
ja: 伝説の地
pt: Câmaras Míticas
ru: Баснословные Чертоги
tr: Masallaşmış Hücreler
uk: Легендарна обитель

source: The Deepest Point
de: Der tiefste Punkt
es: El Punto Más Profundo
fr: Dans les profondeurs
it: Il punto più profondo
ja: 最奥地点
pt: O Ponto mais Profundo
ru: Глубочайший Схрон
tr: En derin nota
uk: Глибокий забій
